{
  "backgrounds": [
    {
      "name": "Aberrant Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "Your aberrant dragonmark has made life challenging since it manifested. You might have hidden it successfully for most of your life or managed to avoid notice. Alternatively, you might have encountered suspicion and fear, perhaps coupled with the outright antagonism of one or more dragonmarked houses. You might have formed an association with the House Tarkanan criminal organization (named for one of the most notorious leaders of the aberrant dragonmarked in the War of the Mark twenty-five centuries ago). Or you might struggle to find your own way in the world, relying on your wits and the power of your mark.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Aberrant Dragonmark",
              "source": "EFA",
              "description": "You gain the following benefits. Aberrant Fortitude: When you fail a Constitution saving throw, you can take a Reaction to roll 1d4 and add the number rolled to the save, potentially turning the failure into a success. Once you've used this benefit, you can't use it again until you finish a Long Rest. Aberrant Magic: You know one cantrip of your choice from the Sorcerer spell list. Also, choose a level 1 spell from that spell list. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Short Rest or Long Rest. You can also cast this spell using any spell slots you have. Constitution is your spellcasting ability for this spell. Aberrant Surge: When you cast the level 1 spell from this feat, you can expend one of your Hit Point Dice and roll it. If you roll an even number, you gain a number of Temporary Hit Points equal to the number rolled. If you roll an odd number, one creature within 30 feet of you (not including you) takes Force damage equal to the number rolled. If no other creatures are in range, you take the damage."
            }
          ],
          "skillProficiencies": [
            "history",
            "intimidation"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Disguise Kit, Costume, Traveler's Clothes, 16 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Acolyte",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You have spent your life in the service of a temple to a specific god or pantheon of gods. You act as an intermediary between the realm of the holy and the mortal world, performing sacred rites and offering sacrifices in order to conduct worshipers into the presence of the divine. You are not necessarily a cleric—performing sacred rites is not the same thing as channeling divine power.\n\nChoose a god, a pantheon of gods, or some other quasi-divine being, and work with your DM to detail the nature of your religious service. The Gods of the Multiverse section contains a sample pantheon, from the Forgotten Realms setting. Were you a lesser functionary in a temple, raised from childhood to assist the priests in the sacred rites? Or were you a high priest who suddenly experienced a call to serve your god in a different way? Perhaps you were the leader of a small cult outside of any established temple structure, or even an occult group that served a fiendish master that you now deny.",
          "skillProficiencies": [
            "insight",
            "religion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A holy symbol (a gift to you when you entered the priesthood), a prayer book or prayer wheel, 5 sticks of incense, vestments, a set of common clothes, and a belt pouch containing 15 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You devoted yourself to service in a temple, either nestled in a town or secluded in a sacred grove. There you performed rites in honor of a god or pantheon. You served under a priest and studied religion. Thanks to your priest's instruction and your own devotion, you also learned how to channel a modicum of divine power in service to your place of worship and the people who prayed there.",
          "abilityBonuses": [
            {
              "from": [
                "int",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "int",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Magic Initiate",
              "source": "XPHB",
              "description": "You gain the following benefits. Two Cantrips: You learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat). Level 1 Spell: Choose a level 1 spell from the same list you selected for this feat's cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have. Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list. Repeatable: You can take this feat more than once, but you must choose a different spell list each time."
            }
          ],
          "skillProficiencies": [
            "insight",
            "religion"
          ],
          "toolProficiencies": [
            "calligrapher's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) Calligrapher's Supplies, Book, Holy Symbol, Parchment (10 sheets), Robe, 8 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Anthropologist",
      "descriptions": [
        {
          "source": "ToA",
          "description": "You have always been fascinated by other cultures, from the most ancient and primeval lost lands to the most modern civilizations. By studying other cultures' customs, philosophies, laws, rituals, religious beliefs, languages, and art, you have learned how tribes, empires, and all forms of society in between craft their own destinies and doom. This knowledge came to you not only through books and scrolls, but also through firsthand observation—by visiting far-flung settlements and exploring local histories and customs.",
          "skillProficiencies": [
            "insight",
            "religion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A leather-bound diary, a Ink (1-ounce bottle), an ink pen, a set of traveler's clothes, one trinket of special significance, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Archaeologist",
      "descriptions": [
        {
          "source": "EFA",
          "description": "You've made a lifelong study of the lost and fallen cultures of the past, visiting their ruins, deciphering their written records, and examining their surviving masterworks. Perhaps you studied at Morgrave University or a similar institution, supplementing your time in the library with fieldwork amid ancient ruins in remote locations. Some archaeologists plunder the treasures of the past in search of wealth or fame, but most consider it their calling to learn from the past. In any case, the archaeologists of Eberron combine the qualities of learned historians with the grit of treasure hunters.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Skilled",
              "source": "XPHB",
              "description": "You gain proficiency in any combination of three Skill List; Skills or tools of your choice. Repeatable: You can take this feat more than once."
            }
          ],
          "skillProficiencies": [
            "history",
            "survival"
          ],
          "toolProficiencies": [
            "cartographer's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Cartographer's Tools, Bullseye Lantern, Map, Map or Scroll Case, Shovel, Tent, Traveler's Clothes, 17 GP; or (B) 50 GP"
          ]
        },
        {
          "source": "ToA",
          "description": "An archaeologist learns about the long-lost and fallen cultures of the past by studying their remains-their bones, their ruins, their surviving masterworks, and their tombs. Those who practice archaeology travel to the far corners of the world to root through crumbled cities and lost dungeons, digging in search of artifacts that might tell the stories of monarchs and high priests, wars and cataclysms.",
          "skillProficiencies": [
            "history",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A Map or Scroll Case containing a map to a ruin or dungeon, a bullseye lantern, a miner's pick, a set of traveler's clothes, a shovel, a two-person tent, a trinket recovered from a dig site, and a pouch containing 25 gp"
          ]
        }
      ]
    },
    {
      "name": "Artisan",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "You began mopping floors and scrubbing counters in an artisan's workshop for a few coppers per day as soon as you were strong enough to carry a bucket. When you were old enough to apprentice, you learned to create basic crafts of your own, as well as how to sweet-talk the occasional demanding customer. Your trade has also given you a keen eye for detail.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Crafter",
              "source": "XPHB",
              "description": "You gain the following benefits. Tool Proficiency: You gain proficiency with three different Artisan's Tools of your choice from the Fast Crafting table. Discount: Whenever you buy a nonmagical item, you receive a 20 percent discount on it. Fast Crafting: When you finish a Long Rest, you can craft one piece of gear from the Fast Crafting table, provided you have the Artisan's Tools associated with that item and have proficiency with those tools. The item lasts until you finish another Long Rest, at which point the item falls apart."
            }
          ],
          "skillProficiencies": [
            "investigation",
            "persuasion"
          ],
          "equipment": [
            "Choose A or B: (A) Artisan's Tools (same as above), 2 Pouch, Traveler's Clothes, 32 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Ashari",
      "descriptions": [
        {
          "source": "TDCSR",
          "description": "Isolated from the political struggles of urban Tal'Dorei, you are a member of the Ashari people—a society bound to an ancient covenant protecting the Material Plane from the chaos of the primordial elements. You've been raised to revere and protect the natural world, and to shepherd the tumultuous elemental forces that give it life. When the elements threaten to overwhelm the delicate balance of nature, it is the role of the Ashari to restore harmony.\n\nYou grew up in a tight-knit society, bound to a leader who successfully returned from the traditional journey to the Elemental Planes known as an Aramente. By contrast, you might well have never traveled more than a few days from your home, and thus have closer bonds with your family and neighbors than many people of Tal'Dorei.\n\nIn your early life, you likely took up one of the many roles that make up your society, whether homemaker, hunter, explorer, or protector. If you have the ability to use elemental magic, you might have had one of the most important duties of all: protecting and soothing the elemental rift at the heart of your home. And even as an adventurer now traveling far beyond that home, your loyalties still lie with the continued safety of your order. Whatever else you do as you learn about the new world around you, you're conscious of the need to gather allies to your cause.\n\nEach Ashari is tethered to one of the four elemental orders and their settlements. You must select Pyrah (fire), Vesrah (water), Terrah (earth), or Zephrah (wind). The rifts of earth and air are both in Tal'Dorei. If you live or lived among your people, then you are familiar with the remarkable sights of Air Ashari on skysail above the Summit Peaks, or Earth Ashari erupting from the solid stone of the Cliffkeep Mountains on their earthboard.",
          "skillProficiencies": [
            "nature"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "languages": [
            "primordial",
            "choose"
          ],
          "equipment": [
            "A set of traveler's clothes, a staff carved with symbols of your tribe, an herbalism kit, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Astral Drifter",
      "descriptions": [
        {
          "source": "AAG",
          "description": "For longer than you can remember, you have traversed the Astral Sea. There, you experienced firsthand the wonders of the Silver Void: you stopped aging and no longer felt hunger or thirst. Driven by wanderlust, you drifted from one part of the Astral Sea to another, like a mote of dust on the wind. You have lost count of the decades that have passed since you arrived here.\n\nIn your travels, you have camped on the petrified hulks of dead gods and narrowly escaped the psychic winds that sweep across the Astral Sea while also avoiding prolonged contact with the plane's most dangerous denizens.",
          "feats": [
            {
              "name": "Magic Initiate",
              "source": "PHB",
              "description": "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class's spell list. In addition, choose one 1st-level spell to learn from that same list. Using this feat, you can cast the spell once at its lowest level, and you must finish a long rest before you can cast it in this way again. Your spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard."
            }
          ],
          "skillProficiencies": [
            "insight",
            "religion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A set of traveler's clothes, a diary, an ink pen, a Ink (1-ounce bottle), and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Athlete",
      "descriptions": [
        {
          "source": "MOT",
          "description": "You strive to perfect yourself physically and in execution of everything you do. The thrill of competition lights fire in your blood, and the roar of the crowd drives you forward. Tales of your exploits precede you and might open doors or loosen tongues.\n\nWhether in one of the poleis, between them, or among the nonhuman peoples of Theros, physical contests and those who pursue them command respect bordering on reverence. Athletes arise from all walks of life and all cultures and quite often cross paths with one another.",
          "skillProficiencies": [
            "acrobatics",
            "athletics"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A bronze discus or leather ball, a lucky charm or past trophy, a set of traveler's clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Azorius Functionary",
      "descriptions": [
        {
          "source": "GGR",
          "description": "The brutes are at the gate, chaos is looming, and the only thing standing in the way of disaster is the foundation of law and order—as embodied in the Azorius Senate. You're a proud member of the Azorius guild, which both enacts and enforces the laws that make Ravnican society function smoothly and safely.",
          "skillProficiencies": [
            "insight",
            "intimidation"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "An Azorius insignia, a scroll containing the text of a law important to you, a Ink (1-ounce bottle), a ink pen, a set of fine clothes, and a belt pouch containing 10 gp (Azorius-minted 1-zino coins)"
          ]
        }
      ]
    },
    {
      "name": "Black Fist Double Agent",
      "descriptions": [
        {
          "source": "ALCurseOfStrahd",
          "description": "You are an informant for the Tears of Virulence who now lord over Phlan, but are also a double agent for original town guard of Phlan, the Black Fists. For the Tears you've been tasked with ferreting out the secrets of Phlan's criminal underworld, insurgency, and the common peoples of Phlan. In exchange for reporting on the activities of dissenters, criminals, and other rebel elements, the Tears of Virulence leave you alone to conduct your affairs in peace.\n\nIn reality you work for the deposed Black Fists, sharing misinformation with the Tears of Virulence that often helps the Black Fists and other Phlan insurgents. Since the evacuation of Phlan, you are even busier today than you ever were previously, as the number of dissenters among the refugees grows daily, while you are afforded many opportunities to spy on the peoples of Mulmaster and Elventree, to the pleasure of your contact(s) within the Tears of Virulence.",
          "skillProficiencies": [
            "deception",
            "insight"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "equipment": [
            "Disguise kit, common clothes, a Tears of Virulence emblem, a writ of free agency signed by the Lord Regent, a set of artisan's tools or gaming set you are proficient with, and a pouch with 15 gp (payment for services rendered)."
          ]
        }
      ]
    },
    {
      "name": "Boros Legionnaire",
      "descriptions": [
        {
          "source": "GGR",
          "description": "As a member of the Boros Legion, your life is devoted to the service of angels and consecrated to the work of establishing justice and peace on the streets of Ravnica. You might be a true believer, inspired by the example of the angels, moved by the plight of the downtrodden, and devoted to the cause of justice. Or you could be a cynic in the ranks, perhaps because you reluctantly followed in the footsteps of a Boros parent, succumbed to the persuasion of a charismatic recruiter's lofty promises, or were drawn in by the prospect of a life of action.",
          "skillProficiencies": [
            "athletics",
            "intimidation"
          ],
          "languages": [
            "choose"
          ],
          "equipment": [
            "A Boros insignia, a feather from an angel's wing, a tattered piece of a Boros banner (a souvenir from a famous battle), a set of common clothes, and a belt pouch containing 2 gp (Boros-minted 1-zino coins)"
          ]
        }
      ]
    },
    {
      "name": "Caravan Specialist",
      "descriptions": [
        {
          "source": "ALElementalEvil",
          "description": "You are used to life on the road. You pride yourself at having traveled every major trade way in the Moonsea region, including the best backroads and shortcuts. When traveling these roads, you know where the best inns, campsites, and water sources are located, as well as potential locations of danger such as ambush. Having worked the roads as long as you have, you have made many acquaintances and find it easy to pick up information and rumors floating from town to town. You are skilled with beasts of burden and handling and repairing wagons of all kinds.",
          "skillProficiencies": [
            "animal handling",
            "survival"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A whip, a two-person tent, a regional map, a set of traveler's clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Carouser",
      "descriptions": [
        {
          "source": "ABH",
          "description": "You grew to adulthood in the beating heart of a large city, such as Baldur's Gate. You spent countless evenings in taverns, playhouses, parlors, and gambling dens, savoring all the city had to offer. You're a natural at interacting with people to learn their secrets, whether over a high-stakes game or at a high-class soiree. You might have been thrown out of an establishment or ten, but only by people who don't know how to party.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Tireless Reveler",
              "source": "ABH",
              "description": "When an ally you can see within 60 feet of yourself expends Heroic Inspiration, you can gain Heroic Inspiration if you lack it. You can use this benefit a number of times equal to your Proficiency, and you regain all expended uses when you finish a Short Rest or Long Rest."
            }
          ],
          "skillProficiencies": [
            "deception",
            "persuasion"
          ],
          "toolProficiencies": [
            "gaming set"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Gaming Set (same as above), Fine Clothes, Glass Bottle, Mirror, Perfume, Pouch, Tinderbox, 19 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Celebrity Adventurer's Scion",
      "descriptions": [
        {
          "source": "AI",
          "description": "Your family name strikes fear and admiration in the hearts of the common folk—but that's got nothing to do with you. Songs and stories celebrating the adventuring exploits of your famous parent are widely known. Kids across the land grew up wishing they were you. But being the child of a famous adventurer wasn't all hugs and kisses.\n\nYou seldom saw your celebrity-adventurer parent, and when they were around, it was all about them and tales of slaying this demon or vanquishing that dragon. All too often, you'd be woken out of a sound sleep by someone standing outside your home screaming about the latest threat to the town, the region, or the world.\n\nIn the end, all you have to show for your lineage is your name. Most of the family's money went for consumables, from potions of healing and spell scrolls to copious amounts of dwarven ale. And everyone expects you to swing a sword or sling spells like your famous forebear, making it doubly hard for you to prove yourself.",
          "skillProficiencies": [
            "perception",
            "performance"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "Disguise kit, a set of fine clothes, and a belt pouch containing 30 gp."
          ]
        }
      ]
    },
    {
      "name": "Charlatan",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You have always had a way with people. You know what makes them tick, you can tease out their hearts' desires after a few minutes of conversation, and with a few leading questions you can read like they were children's books. It's a useful talent, and one that you're perfectly willing to use for your advantage\n\nYou know what people want and you deliver, or rather, you promise to deliver. Common sense should steer people away from things that sound too good to be true, but common sense seems to be in short supply when you're around. The bottle of pink-colored liquid will surely cure that unseemly rash, this ointment–nothing more than a bit of fat with a sprinkle of silver dust–can restore youth and vigor, and there's a bridge in the city that just happens to be for sale. These marvels sound implausible, but you can make them sound like the real deal.",
          "skillProficiencies": [
            "deception",
            "sleight of hand"
          ],
          "toolProficiencies": [
            "disguise kit",
            "forgery kit"
          ],
          "equipment": [
            "A set of fine clothes, a disguise kit, tools of the con of your choice (ten stoppered bottles filled with colored liquid, a set of weighted dice, a deck of marked cards, or a signet ring of an imaginary duke), and a belt pouch containing 15 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "Once you were old enough to order an ale, you soon had a favorite stool in every tavern within ten miles of where you were born. As you traveled the circuit from public house to watering hole, you learned to prey on unfortunates who were in the market for a comforting lie or two—perhaps a sham potion or forged ancestry records.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Skilled",
              "source": "XPHB",
              "description": "You gain proficiency in any combination of three Skill List; Skills or tools of your choice. Repeatable: You can take this feat more than once."
            }
          ],
          "skillProficiencies": [
            "deception",
            "sleight of hand"
          ],
          "toolProficiencies": [
            "forgery kit"
          ],
          "equipment": [
            "Choose A or B: (A) Forgery Kit, Costume, Fine Clothes, 15 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Chondathan Freebooter",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "Though most youths in Chondath accept their four-year term of compulsory military service, you bristled at that authoritarian attempt to control your life. You forsook your nationhood, discarded your given name, and worked as a freebooter with the first ship that would have you. Since then, you've traveled the Vilhon Reach. Though you've never sailed more than a few dozen leagues from land, you make up for it with deep local connections and the breadth of your experiences.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Skilled",
              "source": "XPHB",
              "description": "You gain proficiency in any combination of three Skill List; Skills or tools of your choice. Repeatable: You can take this feat more than once."
            }
          ],
          "skillProficiencies": [
            "athletics",
            "sleight of hand"
          ],
          "toolProficiencies": [
            "weaver's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Weaver's Tools, Backpack, Ball Bearings, Basket, Bedroll, Bucket, Rations (3 days' worth), Rope, Signal Whistle, Traveler's Clothes, 38 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "City Watch",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "You have served the community where you grew up, standing as its first line of defense against crime. You aren't a soldier, directing your gaze outward at possible enemies. Instead, your service to your hometown was to help police its populace, protecting the citizenry from lawbreakers and malefactors of every stripe.\n\nYou might have been part of the City Watch of Waterdeep, the baton-wielding police force of the City of Splendors, protecting the common folk from thieves and rowdy nobility alike. Or you might have been one of the valiant defenders of Silverymoon, a member of the Silverwatch or even one of the magic-wielding Spellguard.\n\nPerhaps you hail from Neverwinter and have served as one of its Wintershield watchmen, the newly founded branch of guards who vow to keep safe the City of Skilled Hands.\n\nEven if you're not city-born or city-bred, this background can describe your early years as a member of law enforcement. Most settlements of any size have their own constables and police forces, and even smaller communities have sheriffs and bailiffs who stand ready to protect their community.",
          "skillProficiencies": [
            "athletics",
            "insight"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A uniform in the style of your unit and indicative of your rank, a horn with which to summon help, a set of manacles, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Clan Crafter",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "The Stout Folk are well known for their artisanship and the worth of their handiworks, and you have been trained in that ancient tradition. For years you labored under a dwarf master of the craft, enduring long hours and dismissive, sour-tempered treatment in order to gain the fine skills you possess today.\n\nYou are most likely a dwarf, but not necessarily—particularly in the North, the shield dwarf clans learned long ago that only proud fools who are more concerned for their egos than their craft turn away promising apprentices, even those of other races. If you aren't a dwarf, however, you have taken a solemn oath never to take on an apprentice in the craft: it is not for non-dwarves to pass on the skills of Moradin's favored children. You would have no difficulty, however, finding a dwarf master who was willing to receive potential apprentices who came with your recommendation.",
          "skillProficiencies": [
            "history",
            "insight"
          ],
          "languages": [
            "dwarvish",
            "1 of your choice"
          ],
          "equipment": [
            "A set of artisan's tools with which you are proficient, a maker's mark chisel used to mark your handiwork with the symbol of the clan of crafters you learned your skill from, a set of traveler's clothes, and a pouch containing 5 gp and a gem worth 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Clasp Member",
      "descriptions": [
        {
          "source": "TDCSR",
          "description": "Whether you grew up in the mean streets of Kymal bamboozling foolish gamblers, or spent your youth pilfering loose coin from the pockets of Emon's many tourists, your lifestyle of deceiving-to-survive eventually drew the attention of the Clasp: a storied crime syndicate that has hideouts in every city in Tal'Dorei. In exchange for protection, a modicum of kinship, and a number of useful resources to further develop your craft as a criminal, you agreed to receive the brand of the Clasp and join their ranks.\n\nYou might have spent time working the guild's most menial assignments, wandering the alleys as a simple cutpurse and filling your pockets with silver while you waited to climb the professional ladder. Or you might be a clever actor and liar, whose skill at blending in with all facets of society has made you an indispensable spy. Perhaps your swift technique with a blade led you to become a feared assassin for the Spireling leader of a local Clasp sect. Regardless, though the threat of the law is ever looming, the advantages to having a connection to such a powerful cartel greatly outweighs your paranoia. Most of the time.\n\nSince the Clasp is an organization, its members can rise in rank by proving their worth, by making the right friends in high places, or even through blackmail and bribery. You and the Game Master can decide together how your actions affect your rank in the Clasp, and what benefits that rank grants you.",
          "skillProficiencies": [
            "deception"
          ],
          "languages": [
            "thieves' cant"
          ],
          "equipment": [
            "A set of inconspicuous common clothes, a set of tools with which you're proficient, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Cloistered Scholar",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of Faerûn's great institutes of learning, where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home—not to abandon it, but to quest for new lore to add to its storehouse of knowledge.\n\nThe most well known of Faerûn's fonts of knowledge is Candlekeep. The great library is always in need of workers and attendants, some of whom rise through the ranks to assume roles of greater responsibility and prominence. You might be one of Candlekeep's own, dedicated to the curatorship of what is likely the most complete body of lore and history in all the world.\n\nPerhaps instead you were taken in by the scholars of the Vault of the Sages or the Map House in Silverymoon, and now you have struck out to increase your knowledge and to make yourself available to help those in other places who seek your expertise. You might be one of the few who aid Herald's Holdfast, helping to catalogue and maintain records of the information that arrives daily from across Faerûn.",
          "skillProficiencies": [
            "history"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "The scholar's robes of your cloister, a writing kit (small pouch with a quill, ink, folded parchment, and a small penknife), a borrowed book on the subject of your current study, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Cormanthor Refugee",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "You are one of hundreds of refugees that were driven from Hillsfar or that fled the destruction of Myth Drannor and who now shelter in hidden camps under the northern eaves of the Cormanthor Forest. If you up grew in the camps, you have never been to a settlement other than the village of Elventree. As a guest of the elves, you have learned their ways and the ways of the forest. You are also a traumatized, as residual wild magic, energies released by the fall of Thultanthar upon Myth Drannor, and the constant fear of raids hunting for nonhumans to fight in Hillsfar's Arena have taken their toll on you, as they have on everyone in the camps.",
          "skillProficiencies": [
            "nature",
            "survival"
          ],
          "equipment": [
            "A two-person tent, artisan's tools, a holy symbol, a set of traveler's clothes, a belt pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Courtier",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "In your earlier days, you were a personage of some significance in a noble court or a bureaucratic organization. You might or might not come from an upper-class family; your talents, rather than the circumstances of your birth, could have secured you this position.\n\nYou might have been one of the many functionaries, attendants, and other hangers-on in the Court of Silverymoon, or perhaps you traveled in Waterdeep's baroque and sometimes cutthroat conglomeration of guilds, nobles, adventurers, and secret societies. You might have been one of the behind-the-scenes law-keepers or functionaries in Baldur's Gate or Neverwinter, or you might have grown up in and around the castle of Daggerford.\n\nEven if you are no longer a full-fledged member of the group that gave you your start in life, your relationships with your former fellows can be an advantage for you and your adventuring comrades. You might undertake missions with your new companions that further the interest of the organization that gave you your start in life. In any event, the abilities that you honed while serving as a courtier will stand you in good stead as an adventurer.",
          "skillProficiencies": [
            "insight",
            "persuasion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A set of fine clothes and a pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Criminal",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You are an experienced criminal with a history of breaking the law. You have spent a lot of time among other criminals and still have contacts within the criminal underworld. You're far closer than most people to the world of murder, theft, and violence that pervades the underbelly of civilization, and you have survived up to this point by flouting the rules and regulations of society.",
          "skillProficiencies": [
            "deception",
            "stealth"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "A crowbar, a set of dark common clothes including a hood, and a belt pouch containing 15 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You eked out a living in dark alleyways, cutting purses or burgling shops. Perhaps you were part of a small gang of like-minded wrongdoers who looked out for each other. Or maybe you were a lone wolf, fending for yourself against the local thieves' guild and more fearsome lawbreakers.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Alert",
              "source": "XPHB",
              "description": "You gain the following benefits. Initiative Proficiency: When you roll Initiative, you can add your Proficiency to the roll. Initiative Swap: Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition."
            }
          ],
          "skillProficiencies": [
            "sleight of hand",
            "stealth"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Thieves' Tools, Crowbar, Pouch, Traveler's Clothes, 16 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Dead Magic Dweller",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "The dead magic zones of the Anauroch desert are anathema to spellcasters and monsters that rely on magic—which is exactly why you made your life there. Perhaps you're on the run from Red Wizards, or you ran afoul of a powerful djinni in Calimshan. Whatever the case, you decided that living in Anauroch was your best option. After long months or years, you're stronger, wiser, and armed with hard-earned knowledge of desert medicine and wasteland survival.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Healer",
              "source": "XPHB",
              "description": "You gain the following benefits. Battle Medic: If you have a Healer's Kit, you can expend one use of it and tend to a creature within 5 feet of yourself as a Utilize action. That creature can expend one of its Hit Point Dice, and you then roll that die. The creature regains a number of Hit Points equal to the roll plus your Proficiency. Healing Rerolls: Whenever you roll a die to determine the number of Hit Points you restore with a spell or with this feat's Battle Medic benefit, you can reroll the die if it rolls a 1, and you must use the new roll."
            }
          ],
          "skillProficiencies": [
            "medicine",
            "survival"
          ],
          "toolProficiencies": [
            "leatherworker's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Greatclub, Leatherworker's Tools, Bedroll, Blanket, Healer's Kit, Pole, Rations (3 days' worth), Tent, Tinderbox, 5 Torch, Traveler's Clothes, Waterskin, 32 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Dimir Operative",
      "descriptions": [
        {
          "source": "GGR",
          "description": "You're a spy. Secrets and misinformation are your stock in trade. You skulk in the shadows, infiltrate other guilds, and steal the most precious secrets, whether they're written in locked journals or hidden away in someone's mind. Even you might not be aware of all the reasons behind the missions you carry out. Sometimes a mission's sole purpose is to conceal the motivation behind another strike performed in a different part of the city, or simply to spread fear.\n\nAs part of your covert work for House Dimir, you maintain a false identity as a member of another guild. You can choose your secondary guild or roll to determine it randomly. This secondary guild membership determines a portion of your starting equipment and is also where most of your contacts come from. You infiltrate your secondary guild to learn its secrets, keep tabs on its activities, or perhaps undermine it from within.",
          "skillProficiencies": [
            "deception",
            "stealth"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A Dimir insignia, three small knives, a set of dark-colored common clothes, and the starting equipment of the background described in this chapter for your secondary guild"
          ]
        }
      ]
    },
    {
      "name": "Dragon Casualty",
      "descriptions": [
        {
          "source": "ALCurseOfStrahd",
          "description": "When the Maimed Virulence descended upon Phlan, you were one of the unfortunate casualties of war. Captured during the initial assault, you have spent the last year of your life as a plaything of a capricious and malevolent overlord. While many of your fellow prisoners fell to the dragon's insatiable fury over the coming months, you and your fellow \"survivors\" were spared only for a worse fate as one of the dragon's magical experiments, leaving you and those who survived the torture scarred and disfigured.\n\nWhat reasons the dragon had for releasing you few survivors, nobody knows. You only fear that those who died under his terrible claw were the lucky ones, and you and your fellow Dragonscarred are doomed for a fate worse than death.",
          "skillProficiencies": [
            "intimidation",
            "survival"
          ],
          "toolProficiencies": [
            "vehicles (water)",
            "vehicles (land)"
          ],
          "languages": [
            "draconic"
          ],
          "equipment": [
            "A dagger, tattered rags, a loaf of moldy bread, a small cast-off scale belonging to Vorgansharax—the Maimed Virulence, and a pouch with 5 gp of various coins (salvaged during your escape from Phlan)."
          ]
        }
      ]
    },
    {
      "name": "Dragon Cultist",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You are an initiate of the Cult of the Dragon. You discovered or were brought to a cell cult, where you exemplified the values honored by dragon cultists: duplicity, secrecy, and determination. In exchange for your oath to serve the cult, the cult offered you the company of fellow dragon worshipers, plus access to resources that might help further your studies in the realms of arcana and occultism.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Cult of the Dragon Initiate",
              "source": "FRHoF",
              "description": "You gain the following benefits. Dragon's Tongue: You know Draconic. If you already know Draconic when you select this feat, you instead learn one language of your choice from the language tables in the Player's Handbook or Chapter 2 of this book. Dragon's Terror: You can take a Magic action to instill terror in a creature you can see within 30 feet of yourself. The target must succeed on a Wisdom saving throw (DC 8 plus your Wisdom modifier and Proficiency) or have the Frightened condition until the end of your next turn. If the target succeeds on the save or when the effect ends for a target, the target is immune to this effect for 24 hours. Inspired by Fear: When you cause a creature to have the Frightened condition and you are the source of its fear, you can gain Heroic Inspiration if you lack it. Once you use this benefit, you can't use it again until you finish a Short Rest or Long Rest."
            }
          ],
          "skillProficiencies": [
            "deception",
            "stealth"
          ],
          "toolProficiencies": [
            "calligrapher's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) Calligrapher's Supplies, Dagger, Glass Bottle, Lamp, Manacles, Oil (5 flasks), 2 Pouch, Robe, Rope, 30 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Earthspur Miner",
      "descriptions": [
        {
          "source": "ALElementalEvil",
          "description": "You are a down-on your luck miner from the Earthspur Mountains who is no stranger to hardship. You have spent a great deal of time living among the dwarves, goliaths, and denizens of the Underdark that also work mines in the area. At this point, you're just as comfortable working underground as above. You know how to read a seam, dicker for supplies with the deep gnomes, party with dwarves, and find your way back to the surface afterwards. Unfortunately, you haven't struck it rich...yet. Although you've come to Mulmaster looking for work, the tall peaks and deep mines of the Earthspurs still call to you.",
          "skillProficiencies": [
            "athletics",
            "survival"
          ],
          "languages": [
            "dwarvish",
            "undercommon"
          ],
          "equipment": [
            "A shovel or a miner's pick, a block and tackle, a climber's kit, a set of common clothes, and a belt pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Emerald Enclave Caretaker",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "As a Caretaker with the Emerald Enclave, you take care of those who care for the world. Either alongside your fellow Emerald Enclave members or by yourself, you've learned essential skills for living with the land: how to track game, where to forage for useful herbs, and even how to forecast the weather. You use these talents to maintain the balance between civilization and the wilds and to rid the world of unnatural creatures.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Emerald Enclave Fledgling",
              "source": "FRHoF",
              "description": "You gain the following benefits. Speak with Animals: You always have the Speak with Animals spell prepared and can cast it with any spell slots you have. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). When you cast this spell as a Ritual, its duration is 8 hours. Tag Team: When you take the Help action, you can switch places with a willing ally within 5 feet of yourself as part of that same action. This movement doesn't provoke Opportunity Attack. You can't use this benefit if the ally has the Incapacitated condition."
            }
          ],
          "skillProficiencies": [
            "nature",
            "survival"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "equipment": [
            "Choose A or B: (A) Shortbow, Arrow, Herbalism Kit, Bedroll, Blanket, Pouch, Tent, Traveler's Clothes, 13 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Entertainer",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You thrive in front of an audience. You know how to entrance them, entertain them, and even inspire them. Your poetics can stir the hearts of those who hear you, awakening grief or joy, laughter or anger. Your music raises their spirits or captures their sorrow. Your dance steps captivate, your humor cuts to the quick. Whatever techniques you use, your art is your life.",
          "skillProficiencies": [
            "acrobatics",
            "performance"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "equipment": [
            "A musical instrument (one of your choice), the favor of an admirer (love letter, lock of hair, or trinket), costume clothes, and a belt pouch containing 15 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You spent much of your youth following roving fairs and carnivals, performing odd jobs for musicians and acrobats in exchange for lessons. You may have learned how to walk a tightrope, how to play a lute in a distinct style, or how to recite poetry with impeccable diction. To this day, you thrive on applause and long for the stage.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Musician",
              "source": "XPHB",
              "description": "You gain the following benefits. Instrument Training: You gain proficiency with three Musical Instruments of your choice. Encouraging Song: As you finish a Short Rest or Long Rest, you can play a song on a Musical Instrument with which you have proficiency and give Heroic Inspiration to allies who hear the song. The number of allies you can affect in this way equals your Proficiency."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "performance"
          ],
          "equipment": [
            "Choose A or B: (A) Musical Instrument (same as above), Costume, Mirror, Perfume, Traveler's Clothes, 11 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Faceless",
      "descriptions": [
        {
          "source": "BGDIA",
          "description": "Being who you are, you could never be a hero. Whether due to your class, your people, your family, or your sins, something about you prevents you from effectively pursuing the path you've chosen. Even so, that doesn't stop you. You've left your old face behind, taking on a new persona, becoming something more.\n\nCharacters with the faceless background don a disguise—literally or otherwise—as they adventure. This persona might be dramatic or subtle. In a way, though, many characters have such larger than life personalities. Therefore, this background largely focuses on detailing the hero behind the mask.",
          "skillProficiencies": [
            "deception",
            "intimidation"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "Disguise kit, a costume clothes, a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Faction Agent",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "Many organizations active in the North and across the face of Faerûn aren't bound by strictures of geography. These factions pursue their agendas without regard for political boundaries, and their members operate anywhere the organization deems necessary. These groups employ listeners, rumormongers, smugglers, sellswords, cache-holders (people who guard caches of wealth or magic for use by the faction's operatives), haven keepers, and message drop minders, to name a few. At the core of every faction are those who don't merely fulfill a small function for that organization, but who serve as its hands, head, and heart.\n\nAs a prelude to your adventuring career (and in preparation for it), you served as an agent of a particular faction in Faerûn. You might have operated openly or secretly, depending on the faction and its goals, as well as how those goals mesh with your own. Becoming an adventurer doesn't necessarily require you to relinquish membership in your faction (though you can choose to do so), and it might enhance your status in the faction.\n\nThe lack of large, centralized governments in the North and along the Sword Coast is likely directly responsible for the proliferation of secret societies and conspiracies in those lands. If your background is as an agent for one of the main factions of the North and Sword Coast, here are some possibilities.\n\nFounded more than a millennium ago, disbanded and reorganized several times, the Harpers remain a powerful, behind-the-scenes agency, which acts to thwart evil and promote fairness through knowledge, rather than brute force. Harper agents are often proficient in Investigation, enabling them to be adept at snooping and spying. They often seek aid from other Harpers, sympathetic bards and innkeepers, rangers, and the clergy of gods that are aligned with the Harpers' ideals.\n\nOne of the newest power groups in Faerûn, the Order of the Gauntlet has an agenda similar to that of the Harpers. Its methods are vastly different, however: bearers of the gauntlet are holy warriors on a righteous quest to crush evil and promote justice, and they never hide in the shadows. Order agents tend to be proficient in Religion, and frequently seek aid from law enforcement friendly to the order's ideals, and the clergy of the order's patron gods.\n\nMaintaining balance in the natural order and combating the forces that threaten that balance is the twofold goal of the Emerald Enclave. Those who serve the faction are masters of survival and living off the land. They are often proficient in Nature, and can seek assistance from woodsmen, hunters, rangers, barbarian tribes, druid circles, and priests who revere the gods of nature.\n\nOn one level, the agents of the Lords' Alliance are representatives of the cities and other governments that constitute the alliance. But, as a faction with interests and concerns that transcend local politics and geography, the Alliance has its own cadre of individuals who work on behalf of the organizations, wider agenda. Alliance agents are required to be knowledgeable in History, and can always rely on the aid of the governments that are part of the Alliance, plus other leaders and groups who uphold the Alliance's ideals.\n\nIn recent years, the Zhentarim have become more visible in the world at large, as the group works to improve its reputation among the common people. The faction draws employees and associates from many walks of life, setting them to tasks that serve the goals of the Black Network but aren't necessarily criminal in nature. Agents of the Black Network must often work in secret, and are frequently proficient in Deception. They seek aid from the wizards, mercenaries, merchants and priesthoods allied with the Zhentarim.",
          "skillProficiencies": [
            "insight"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "Badge or emblem of your faction, a copy of a seminal faction text (or code-book for a covert faction), a set of common clothes, and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Failed Merchant",
      "descriptions": [
        {
          "source": "AI",
          "description": "Maybe you come from a long line of merchants. Perhaps you were an entrepreneur. Regardless, your ventures ended poorly. Whether it was because of outside influences, bad luck, or simply because your business acumen was weak, you lost everything.\n\nWith failure, however, comes experience. You're free of that old life, having made some connections and learned your lessons. Prepared to pursue the life of an adventurer, your insight into the world of commerce brought you into the sphere of Acquisitions Incorporated—and a franchise just might be in your future.",
          "skillProficiencies": [
            "investigation",
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "One set of artisan's tools, merchant's scale, a set of fine clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Far Traveler",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "Almost all of the common people and other folk that one might encounter along the Sword Coast or in the North have one thing in common: they live out their lives without ever traveling more than a few miles from where they were born.\n\nYou aren't one of those folk.\n\nYou are from a distant place, one so remote that few of the common folk in the North realize that it exists, and chances are good that even if some people you meet have heard of your homeland, they know merely the name and perhaps a few outrageous stories. You have come to this part of Faerûn for your own reasons, which you might or might not choose to share.\n\nAlthough you will undoubtedly find some of this land's ways to be strange and discomfiting, you can also be sure that some things its people take for granted will be to you new wonders that you've never laid eyes on before. By the same token, you're a person of interest, for good or ill, to those around you almost anywhere you go.\n\nThe most important decision in creating a far traveler background is determining your homeland. The places discussed here are all sufficiently distant from the North and the Sword Coast to justify the use of this background.\n\nThe fabled elven islands far to the west are home to elves who have never been to Faerûn. They often find it a harsher place than they expected when they do make the trip. If you are an elf, Evermeet is a logical (though not mandatory) choice for your homeland.\n\nMost of those who emigrate from Evermeet are either exiles, forced out for committing some infraction of elven law, or emissaries who come to Faerûn for a purpose that benefits elven culture or society.\n\nLocated on the southern edges of the Shining South, and hemmed in by mountains all around, the magocracy of Halruaa is a bizarre land to most in Faerûn who know about it. Many folk have heard of the strange skyships the Halruaans sail, and a few know of the tales that even the least of their people can work magic.\n\nHalruaans usually make their journeys into Faerûn for personal reasons, since their government has a strict stance against unauthorized involvement with other nations and organizations. You might have been exiled for breaking one of Halruaa's many byzantine laws, or you could be a pilgrim who seeks the shrines of the gods of magic.\n\nThe continent of Kara-Tur, far to the east of Faerûn, is home to people whose customs are unfamiliar to the folk of the Sword Coast. If you come from Kara-Tur, the people of Faerûn likely refer to you as Shou, even if that isn't your true ethnicity, because that's the blanket term they use for everyone who shares your origin.\n\nThe folk of Kara-Tur occasionally travel to Faerûn as diplomats or to forge trade relations with prosperous merchant cartels. You might have come here as part of some such delegation, then decided to stay when the mission was over.\n\nFrom the terrain to the architecture to the god-kings who rule over these lands, nearly everything about Mulhorand is alien to someone from the Sword Coast. You likely experienced the same sort of culture shock when you left your desert home and traveled to the unfamiliar climes of northern Faerûn. Recent events in your homeland have led to the abolition of slavery, and a corresponding increase in the traffic between Mulhorand and the distant parts of Faerûn.\n\nThose who leave behind Mulhorand's sweltering deserts and ancient pyramids for a glimpse at a different life do so for many reasons. You might be in the North simply to see the strangeness this wet land has to offer, or because you have made too many enemies among the desert communities of your home.\n\nFew have heard of your homeland, but many have questions about it upon seeing you. Humans from Sossal seem crafted from snow, with alabaster skin and white hair, and typically dressed in white.\n\nSossal exists far to the northeast, hard up against the endless ice to the north and bounded on its other sides by hundreds of miles of the Great Glacier and the Great Ice Sea. No one from your nation makes the effort to cross such colossal barriers without a convincing reason. You must fear something truly terrible or seek something incredibly important.\n\nAs the saying goes among those in Faerûn who know of the place, \"To get to Zakhara, go south. Then go south some more.\" Of course, you followed an equally long route when you came north from your place of birth. Though it isn't unusual for Zakharans to visit the southern extremes of Faerûn for trading purposes, few of them stray as far from home as you have.\n\nYou might be traveling to discover what wonders are to be found outside the deserts and sword-like mountains of your homeland, or perhaps you are on a pilgrimage to understand the gods that others worship, so that you might better appreciate your own deities.\n\nThough your home is physically closer to the Sword Coast than the other locations discussed here, it is far more unnatural. You hail from one of the settlements in the Underdark, each of which has its own strange customs and laws. If you are a native of one of the great subterranean cities or settlements, you are probably a member of the race that occupies the place - but you might also have grown up there after being captured and brought below when you were a child.\n\nIf you are a true Underdark native, you might have come to the surface as an emissary of your people, or perhaps to escape accusations of criminal behavior (whether warranted or not). If you aren't a native, your reason for leaving \"home\" probably has something to do with getting away from a bad situation.\n\nYour accent, mannerisms, figures of speech, and perhaps even your appearance all mark you as foreign. Curious glances are directed your way wherever you go, which can be a nuisance, but you also gain the friendly interest of scholars and others intrigued by far-off lands, to say nothing of everyday folk who are eager to hear stories of your homeland.\n\nYou can parley this attention into access to people and places you might not otherwise have, for you and your traveling companions. Noble lords, scholars, and merchant princes, to name a few, might be interested in hearing about your distant homeland and people.",
          "skillProficiencies": [
            "insight",
            "perception"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "One set of traveler's clothes, any one musical instrument or gaming set you are proficient with, poorly wrought maps from your homeland that depict where you are in Faerûn, a small piece of jewelry worth 10 gp in the style of your homeland's craftsmanship, and a pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Farmer",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "You grew up close to the land. Years tending animals and cultivating the earth rewarded you with patience and good health. You have a keen appreciation for nature's bounty alongside a healthy respect for nature's wrath.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Tough",
              "source": "XPHB",
              "description": "Your Hit Points maximum increases by an amount equal to twice your character level when you gain this feat. Whenever you gain a character level thereafter, your Hit Points maximum increases by an additional 2 Hit Points."
            }
          ],
          "skillProficiencies": [
            "animal handling",
            "nature"
          ],
          "toolProficiencies": [
            "carpenter's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Sickle, Carpenter's Tools, Healer's Kit, Iron Pot, Shovel, 30 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Feylost",
      "descriptions": [
        {
          "source": "WBtW",
          "description": "You grew up in the Feywild after disappearing from your home plane as a child. Perhaps you were spirited away by kindly Fey who thought you were destined for great things. Perhaps you stumbled through a fey crossing by chance during a twilight stroll in the woods. Perhaps you were kidnapped by evil Fey but escaped from their clutches. Whatever the manner of your disappearance, you gradually fell under the Feywild's spell and learned a little about the nature of the mercurial tricksters that dwell there.\n\nWhen you finally returned to your home plane, you did not come back unchanged. You are haunted by the fact that the Feywild—a mirror world hidden behind a mere twist of perception—is only a hair's breadth away. Although your memories of the Feywild grow fainter with each passing day, your heart swells with a mixture of fear and joy at the prospect of one day venturing back to the Plane of Faerie—your home away from home.",
          "skillProficiencies": [
            "deception",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A musical instrument (one of your choice), a Traveler's Clothes, three trinkets (each determined by rolling on the Feywild Trinket table), and a pouch containing 8 gp"
          ]
        }
      ]
    },
    {
      "name": "Fisher",
      "descriptions": [
        {
          "source": "GoS",
          "description": "You have spent your life aboard fishing vessels or combing the shallows for the bounty of the ocean. Perhaps you were born into a family of fisher folk, working with your kin to feed your village. Maybe the job was a means to an end—a way out of an undesirable circumstance that forced you to take up life aboard a ship. Regardless of how you began, you soon fell in love with the sea, the art of fishing, and the promise of the eternal horizon.",
          "skillProficiencies": [
            "history",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "Fishing tackle, a net, a favorite fishing lure or oiled leather wading boots, a set of traveler's clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Flaming Fist Mercenary",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "The chief law enforcement branch of Baldur's Gate is the Flaming Fist, a brawny mercenary guild led by the city's grand duke. You once served as a Flaming Fist, where you learned how to preempt trouble with your intimidating stare and, when necessary, absorb deadly blows. Flaming Fist mercenaries, active or retired, are known as some of the toughest, most resilient warriors along the Sword Coast, and you seek to maintain that reputation.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Tough",
              "source": "XPHB",
              "description": "Your Hit Points maximum increases by an amount equal to twice your character level when you gain this feat. Whenever you gain a character level thereafter, your Hit Points maximum increases by an additional 2 Hit Points."
            }
          ],
          "skillProficiencies": [
            "intimidation",
            "perception"
          ],
          "toolProficiencies": [
            "smith's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Mace, Smith's Tools, Fine Clothes, Manacles, Portable Ram, 4 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Folk Hero",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You come from a humble social rank, but you are destined for so much more. Already the people of your home village regard you as their champion, and your destiny calls you to stand against the tyrants and monsters that threaten the common folk everywhere.",
          "skillProficiencies": [
            "animal handling",
            "survival"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "equipment": [
            "A set of artisan's tools (one of your choice), a shovel, an iron pot, a set of common clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Gambler",
      "descriptions": [
        {
          "source": "AI",
          "description": "All you need to make a lot of gold is a little gold. Except at those times when all you need to have no gold at all is a little gold. Whether you're a good gambler or a bad one rarely matters, because no one can divine the whims of Lady Luck. Sometimes you're up, sometimes you're down. But the thing about gambling is that someone is always willing to take a bet.",
          "skillProficiencies": [
            "deception",
            "insight"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "One gaming set, a lucky charm, a set of fine clothes, and a belt pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Gate Urchin",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "All traffic into and out of the City of Trade passes through the Hillsfar Gate, making it the ideal place for the destitute to gather to panhandle, busk, gossip, and pick pockets. You grew up on the streets in the shadow of that great steel edifice, which houses both Red Plumes and Guild Mages. Though you may have moved on, you still have friends among them, and that life has had a lasting impact on you.",
          "skillProficiencies": [
            "deception",
            "sleight of hand"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "A battered alms box, a musical instrument, a cast-off military jacket, cap, or scarf, a set of common clothes, a belt pouch, and 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Gate Warden",
      "descriptions": [
        {
          "source": "SatO",
          "description": "You spent a significant amount of time somewhere influenced by intense planar forces or a portal to another plane of existence, such as one of the gatetowns in the Outlands. You're accustomed to experiences that would leave others reeling in terror or enraptured by otherworldly beauty, and you're as comfortable dealing with Celestials and Fiends as you are with the vendors in town (who might be one and the same).",
          "feats": [
            {
              "name": "Scion of the Outer Planes",
              "source": "SatO",
              "description": "Your connection to an Outer Plane infuses you with the energy there. Choose a type of plane listed in the Planar Infusion table. Your choice gives you resistance to a damage type and the ability to cast a cantrip, as specified in the table. You can cast this cantrip without material components, and your spellcasting ability for it is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "persuasion",
            "survival"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A ring of keys to unknown locks, a blank book, an ink pen or quill, a bottle of black ink, a set of traveler's clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Genie Touched",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "Although genies no longer rule Calimshan, genie magic is still common in your homeland. Perhaps you inadvertently summoned a djinni from a magic lamp, or maybe you came upon an oasis guarded by a marid. A dao might have saved you from a landslide, or you bargained with an efreeti for fleeting wealth. However your fate intersected with that of a genie, the experience left you with a keen eye, a silver tongue, and more than a touch of magic.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "skillProficiencies": [
            "perception",
            "persuasion"
          ],
          "toolProficiencies": [
            "glassblower's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Light Hammer, Glassblower's Tools, Fine Clothes, Lamp, Oil (3 flasks), Waterskin, 2 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Giant Foundling",
      "descriptions": [
        {
          "source": "BGG",
          "description": "Though you aren't a Giant, you grew up among giants. Maybe you were an orphan taken in by a sympathetic family of stone giants who raised you as one of their own. Or perhaps you lived in a lost prehistoric pocket of the world, surrounded by giants and fearsome behemoths or hulking dinosaurs.\n\nSomething about your environment—perhaps the food or water that sustained you, elemental magic inherent in the site of your home, or some verdant blessing of growth placed on you—caused you to grow to a remarkable size for your kind. With the aid of this magic, you have learned how to embody the might of giants. You are used to moving through a world much bigger than you, and that is reflected in your skills, attitude, and perspective on life.",
          "feats": [
            {
              "name": "Strike of the Giants",
              "source": "BGG",
              "description": "You have absorbed primeval magic that gives you an echo of the might of giants. When you take this feat, choose one of the benefits listed below. Once per turn, when you hit a target with a melee weapon attack or a ranged weapon attack using a thrown weapon, you can imbue the attack with an additional effect depending on the benefit you chose: Cloud Strike: The target takes an extra 1d4 thunder damage. If the target is a creature, it must succeed on a Wisdom saving throw, or you become invisible to it until the start of your next turn or until immediately after you make an attack roll or cast a spell. Fire Strike: The target takes an extra 1d10 fire damage. Frost Strike: The target takes an extra 1d6 cold damage. If the target is a creature, it must succeed on a Constitution saving throw, or its speed is reduced to 0 until the start of your next turn. Hill Strike: The target takes an extra 1d6 damage of the weapon's type. If the target is a creature, it must succeed on a Strength saving throw or have the prone condition. Stone Strike: The target takes an extra 1d6 force damage. If the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet from you in a straight line. Storm Strike: The target takes an extra 1d6 lightning damage. If the target is a creature, it must succeed on a Constitution saving throw, or it has disadvantage on attack rolls until the start of your next turn. The saving throw DC for these effects equals 8 + your proficiency bonus + your Strength or Constitution modifier. You can use this feat a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
            }
          ],
          "skillProficiencies": [
            "intimidation",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A backpack, a set of traveler's clothes, a small stone or sprig that reminds you of home, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Golgari Agent",
      "descriptions": [
        {
          "source": "GGR",
          "description": "You are a member of a teeming horde—one small part of a sprawling organism. Just as you are part of the swarm, the swarm is part of a larger ecosystem, a never-ending cycle of life, death, rot, and rebirth. You have spent your life in the slow churn of that ecosystem, in the dark places of the city where the messy parts of existence are on display. There is little squeamishness among the Golgari, no fear of death or taboo about the dead, just a fierce affirmation of the cycle.",
          "skillProficiencies": [
            "nature",
            "survival"
          ],
          "toolProficiencies": [
            "poisoner's kit"
          ],
          "languages": [
            "choose"
          ],
          "equipment": [
            "A Golgari insignia, a poisoner's kit, a pet beetle or spider, a set of common clothes, and a belt pouch containing 10 gp worth of mixed coins"
          ]
        }
      ]
    },
    {
      "name": "Grinner",
      "descriptions": [
        {
          "source": "EGW",
          "description": "The Golden Grin began in the far-off land of Tal'Dorei, trading secret messages through a network of bards and minstrels to undermine an iron-fisted king's authoritarian rule. Today, Tal'Dorei is a relatively peaceful republic, and some Grinners have grown restless while waiting for tyranny to raise its ugly head again. A contingent of such Grinners traveled to the Menagerie Coast and set up a network of secret bases in the cities of the Clovis Concord, from which they are presently working their way into the highest echelons of the Dwendalian Empire.\n\nYou are a Grinner. Your goals are to spread freedom and inspire hope—or, in time, revolution—in the hearts of the oppressed.\n\nAll members of the Golden Grin have learned a handful of folk songs in their travels, and use those songs to send secret codes and alert fellow Grinners to danger. Choose a favorite song or roll on the Favorite Code-Songs table.",
          "skillProficiencies": [
            "deception",
            "performance"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "A set of fine clothes, a disguise kit, a musical instrument of your choice, a gold-plated ring depicting a smiling face, and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Gruul Anarch",
      "descriptions": [
        {
          "source": "GGR",
          "description": "The entire world of Ravnica is a sprawling metropolis, but you are a native of the wild areas that still exist—the abandoned districts, the rubblebelts, the overgrown parks, and the crumbling ruins. You are part of a savage society that clings desperately to the Old Ways—attuned to nature, full of primal rage, and given short shrift by a world consumed with continuing civilization's march of progress.",
          "skillProficiencies": [
            "animal handling",
            "athletics"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "languages": [
            "choose"
          ],
          "equipment": [
            "A Gruul insignia, a hunting trap, an herbalism kit, the skull of a boar, a beast-hide cloak, a set of traveler's clothes, and a belt pouch containing 10 gp (Azorius 1-zino coins)"
          ]
        }
      ]
    },
    {
      "name": "Guard",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "Your feet ache when you remember the countless hours you spent at your post in the tower. You were trained to keep one eye looking outside the wall, watching for marauders sweeping from the nearby forest, and your other eye looking inside the wall, searching for cutpurses and troublemakers.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Alert",
              "source": "XPHB",
              "description": "You gain the following benefits. Initiative Proficiency: When you roll Initiative, you can add your Proficiency to the roll. Initiative Swap: Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition."
            }
          ],
          "skillProficiencies": [
            "athletics",
            "perception"
          ],
          "equipment": [
            "Choose A or B: (A) Spear, Light Crossbow, 20 Bolt, Gaming Set (same as above), Hooded Lantern, Manacles, Quiver, Traveler's Clothes, 12 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Guide",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "You came of age outdoors, far from settled lands. Your home was anywhere you chose to spread your bedroll. There are wonders in the wilderness—strange monsters, pristine forests and streams, overgrown ruins of great halls once trod by giants—and you learned to fend for yourself as you explored them. From time to time, you guided friendly nature priests who instructed you in the fundamentals of channeling the magic of the wild.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Magic Initiate",
              "source": "XPHB",
              "description": "You gain the following benefits. Two Cantrips: You learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat). Level 1 Spell: Choose a level 1 spell from the same list you selected for this feat's cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have. Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list. Repeatable: You can take this feat more than once, but you must choose a different spell list each time."
            }
          ],
          "skillProficiencies": [
            "stealth",
            "survival"
          ],
          "toolProficiencies": [
            "cartographer's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Shortbow, Arrow, Cartographer's Tools, Bedroll, Quiver, Tent, Traveler's Clothes, 3 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Guild Artisan",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You are a member of an artisan's guild, skilled in a particular field and closely associated with other artisans. You are a well-established part of the mercantile world, freed by talent and wealth from the constraints of a feudal social order. You learned your skills as an apprentice to a master artisan, under the sponsorship of your guild, until you became a master in your own right.",
          "skillProficiencies": [
            "insight",
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A set of artisan's tools (one of your choice), a letter of introduction from your guild, a set of traveler's clothes, and a belt pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Harborfolk",
      "descriptions": [
        {
          "source": "ALElementalEvil",
          "description": "You are one of the hundreds of small-time fishermen and women who haul the bounty of Mulmaster's freshwater harbor to the city's markets each morning. You have spent countless days rowing in the waters in and around Mulmaster and know them and the other fisherfolk, dockworkers, and port inhabitants better than anyone. Though you have left that life behind, you still visit once in a while.",
          "skillProficiencies": [
            "athletics",
            "sleight of hand"
          ],
          "toolProficiencies": [
            "vehicles (water)"
          ],
          "equipment": [
            "Fishing tackle, dice set, playing card set, or Three-Dragon Ante set, a set of common clothes, rowboat, and a belt pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Harper",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You accepted an invitation to join the Harpers, pledging an oath to uphold the Harper code and act in service to the common good. Like all Harpers, you understand the value of teamwork as well as when it's best to go it alone. Harper veterans have taught you the order's secrets—magical melodies, special watchwords, and legerdemain—and have entrusted you to use such knowledge to surveil and undermine the forces of evil.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Harper Agent",
              "source": "FRHoF",
              "description": "You gain the following benefits. Thieves' Cant: You know Thieves' Cant. Instrument Training: You gain proficiency with a Musical Instrument of your choice. Distracting Melody: When you take the Help action to assist an ally's attack roll, the enemy you're distracting can be within 30 feet of you, rather than within 5 feet of you, provided the enemy can see or hear you."
            }
          ],
          "skillProficiencies": [
            "performance",
            "sleight of hand"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "equipment": [
            "Choose A or B: (A) Disguise Kit, Bedroll, Costume, Grappling Hook, Rope, Traveler's Clothes, 14 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Haunted One",
      "descriptions": [
        {
          "source": "VRGR",
          "description": "You are haunted by something so terrible that you dare not speak of it. You've tried to bury it and run away from it, to no avail. Whatever this thing is that haunts you can't be slain with a sword or banished with a spell. It might come to you as a shadow on the wall, a bloodcurdling nightmare, a memory that refuses to die, or a demonic whisper in the dark. The burden has taken its toll, isolating you from most people and making you question your sanity. You must find a way to overcome it before it destroys you.",
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "Monster hunter's pack (containing a chest, a crowbar, a hammer, three wooden stakes, a holy symbol, a Holy Water (flask), a Manacles, a steel mirror, a Oil (flask), a tinderbox, and 3 Torch), a set of common clothes, one trinket of special significance (choose one or roll on the Horror Trinket table), and 1 sp"
          ]
        }
      ]
    },
    {
      "name": "Hermit",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You lived in seclusion–either in a sheltered community such as a monastery, or entirely alone–for a formative part of your life. In your time apart from the clamor of society, you found quiet, solitude, and perhaps some of the answers you were looking for.",
          "skillProficiencies": [
            "medicine",
            "religion"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A Map or Scroll Case stuffed full of notes from your studies or prayers, a winter blanket, a set of common clothes, an herbalism kit, and 5 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You spent your early years secluded in a hut or monastery located well beyond the outskirts of the nearest settlement. In those days, your only companions were the creatures of the forest and those who would occasionally visit to bring news of the outside world and supplies. The solitude allowed you to spend many hours pondering the mysteries of creation.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Healer",
              "source": "XPHB",
              "description": "You gain the following benefits. Battle Medic: If you have a Healer's Kit, you can expend one use of it and tend to a creature within 5 feet of yourself as a Utilize action. That creature can expend one of its Hit Point Dice, and you then roll that die. The creature regains a number of Hit Points equal to the roll plus your Proficiency. Healing Rerolls: Whenever you roll a die to determine the number of Hit Points you restore with a spell or with this feat's Battle Medic benefit, you can reroll the die if it rolls a 1, and you must use the new roll."
            }
          ],
          "skillProficiencies": [
            "medicine",
            "religion"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "equipment": [
            "Choose A or B: (A) Quarterstaff, Herbalism Kit, Bedroll, Book (philosophy), Lamp, Oil (3 flasks), Traveler's Clothes, 16 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Hillsfar Merchant",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "Before becoming an adventurer, you were a successful merchant operating out Hillsfar, the City of Trade. Your family operated warehouses, organized caravans, managed stores, or owned a ship and has trade contacts throughout the Moonsea region, as well as up and down the length of the Sword Coast. Perhaps they import ore, uncut gems, untreated furs, or grain into the City of Trade, or they export fine cloth, faceted gems, fine furs, or Dragon's Breath, a brandy-like liquor. Regardless, you've largely given that life up for some reason and have chosen to seek adventure instead. Nevertheless, the training you received then, and perhaps the contacts you made, serve you well as an adventurer.",
          "skillProficiencies": [
            "insight",
            "persuasion"
          ],
          "toolProficiencies": [
            "vehicles (land)",
            "vehicles (water)"
          ],
          "equipment": [
            "A set of fine clothes, a signet ring, a letter of introduction from your family's trading house, and a purse containing 25 gp"
          ]
        }
      ]
    },
    {
      "name": "Hillsfar Smuggler",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "Hillsfar is the City of Trade. However, the Great Law of Trade only protects \"legitimate\" trade, trade that passes through the city's sole gate, which the Red Plumes monitor and tax. And the Great Law of Humanity banishes non-humans from the city altogether. The two Great Laws create great demand and great risk for smugglers, who shepherd illicit goods and non-humans into and out of the city by secret routes. The Rogues Guild tightly controls all of this activity, taking its cut from sanctioned jobs and exacting punishment for independent jobs.\n\nPerhaps you trafficked Dragon's Breath (a brandy-like liquor) to avoid tariffs or contraband to avoid seizure, or maybe you are a human who sympathizes with the non-humans and worked as part of the network of secret routes and safe houses that helps them pass through Hillsfar. Either way, you have contacts in the smuggling community who can help you slip into and out of the city unnoticed, for a price.",
          "skillProficiencies": [
            "perception",
            "stealth"
          ],
          "toolProficiencies": [
            "forgery kit"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A forgery kit, a set of common clothes, a belt pouch, and 5 gp"
          ]
        }
      ]
    },
    {
      "name": "House Agent",
      "descriptions": [
        {
          "source": "EFA",
          "description": "You are connected to one of the dragonmarked houses, but you haven't (yet) manifested a dragonmark. You might be a member of the family by birth or an employee of the house with no familial connection. You've earned your living by doing the business of the house, serving as the hands, feet, and eyes of house leadership in the world. You might have many old friends, mentors, and rivals in the house you serve, plus allies or enemies in other houses.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Lucky",
              "source": "XPHB",
              "description": "You gain the following benefits. Luck Points: You have a number of Luck Points equal to your Proficiency and can spend the points on the benefits below. You regain your expended Luck Points when you finish a Long Rest. Advantage: When you roll a d20 for a D20 Test, you can spend 1 Luck Point to give yourself Advantage on the roll. Disadvantage: When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose Disadvantage on that roll."
            }
          ],
          "skillProficiencies": [
            "investigation",
            "persuasion"
          ],
          "equipment": [
            "Choose A or B: (A) Artisan's Tools (same as above), Fine Clothes, 20 GP; or (B) 50 GP"
          ]
        },
        {
          "source": "ERLW",
          "description": "You have sworn fealty to a dragonmarked house. If you have a dragonmark, you're likely a member of one of the house's influential families; otherwise you're an outsider who hopes to make your fortune through the house. Your main task is to serve as the eyes of your house, but you could be called on at any time to act as its hand. Such missions can be perilous but lucrative.",
          "skillProficiencies": [
            "investigation",
            "persuasion"
          ],
          "toolProficiencies": [
            "alchemist's supplies",
            "tinker's tools",
            "vehicles (land)",
            "brewer's supplies",
            "cook's utensils",
            "alchemist's supplies",
            "herbalism kit",
            "tinker's tools",
            "thieves' tools",
            "vehicles (water)",
            "vehicles (air)",
            "navigator's tools",
            "thieves' tools",
            "disguise kit",
            "disguise kit",
            "calligrapher's supplies",
            "forgery kit",
            "thieves' tools",
            "poisoner's kit",
            "vehicles (land)",
            "herbalism kit"
          ],
          "equipment": [
            "A set of fine clothes, house signet ring, identification papers, and a purse containing 20 gp."
          ]
        }
      ]
    },
    {
      "name": "House Cannith Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "As a scion of House Cannith, you carry a proud legacy. Cannith creates wonders of the modern world, and you're expected to contribute to the ongoing success of the house through invention, scholarship, business, or diplomacy. The only thing that can stand in your way is the deep rift within your own house. The sooner the three barons sort out which of them is the true head of the house (and you, no doubt, have your preference), the sooner House Cannith can claim its rightful position of leadership among all the dragonmarked houses.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Making",
              "source": "EFA",
              "description": "You gain the following benefits. Artisan's Intuition: When you make an Intelligence (Arcana) check or an ability check using Artisan's Tools, you can roll 1d4 and add the number rolled to the ability check. Spellsmith: You know the Mending cantrip. You also always have the Magic Weapon spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Making Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "investigation",
            "sleight of hand"
          ],
          "equipment": [
            "Choose A or B: (A) Artisan's Tools (same as above), Crowbar, Fine Clothes, 2 Pouch, 17 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Deneith Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "As an heir of House Deneith, you've been trained for combat—not to seek it out, but not to shy from it either. You've learned the importance of duty, honor, and the laws used to govern society when duty and honor fail. As you established your name in the house, you might have worked as a bodyguard for some minor dignitary, as a mercenary, or as a marshal hunting fugitives. Now you're prepared to claim your rightful standing in the mightiest of the dragonmarked houses.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Sentinel",
              "source": "EFA",
              "description": "You gain the following benefits. Sentinel's Intuition: When you make a Wisdom (Insight or Perception) check, you can roll 1d4 and add the number rolled to the ability check. Guardian's Shield: You always have the Shield spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). Vigilant Guardian: When a creature you can see within 5 feet of you is hit by an attack roll, you can take a Reaction to swap places with that creature, and you are hit by the attack instead. You can use this feature a number of times equal to your Proficiency and regain all expended uses when you finish a Long Rest. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Sentinel Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "insight",
            "perception"
          ],
          "equipment": [
            "Choose A or B: (A) Spear, Shortbow, Arrow, Gaming Set (same as above), Fine Clothes, Healer's Kit, Quiver, 1 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Ghallanda Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "Thanks to your connections to House Ghallanda, you grew up accustomed to creature comforts, lively conversation, good drink, and delicious food. You might be a charming and witty scion of the house who loves nothing more than a pleasant evening beside a warm hearth. Or you could be a schemer who exploits bonds of trust and friendship to bend others to your will. You might pursue an adventuring career to master the cuisines of other cultures and ages, expand your network of useful contacts, or earn enough money to open your own inn.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Hospitality",
              "source": "EFA",
              "description": "You gain the following benefits. Ever Hospitable: When you make a Charisma (Persuasion) check or an ability check using Brewer's Supplies or Cook's Utensils, you can roll 1d4 and add the number rolled to the ability check. Innkeeper's Magic: You always have the Purify Food and Drink and Unseen Servant spells prepared. You can cast each spell once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast these spells using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). When you reach character level 3, you also always have the Calm Emotions spell prepared and can cast it the same way Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Hospitality Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "insight",
            "persuasion"
          ],
          "toolProficiencies": [
            "cook's utensils"
          ],
          "equipment": [
            "Choose A or B: (A) Cook's Utensils, Fine Clothes, Iron Pot, Lamp, Oil (5 flasks), Perfume, 26 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Jorasco Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "House Jorasco teaches that illness and injury stalk the living like ghosts, robbing people of health and longevity. You've been taught ways to combat these scourges, both magically and medically. You're trained to use those skills in the service of others—and to ascertain that you are always appropriately compensated for this service, ensuring the health and longevity of House Jorasco. You might be a kindly healer with no stomach for combat or a dispassionate specialist who knows exactly how to incapacitate or kill an enemy with precise strikes.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Healing",
              "source": "EFA",
              "description": "You gain the following benefits. Medical Intuition: When you make a Wisdom (Medicine) check or an ability check using a Herbalism Kit, you can roll 1d4 and add the number rolled to the ability check. Healing Touch: You always have the Cure Wounds spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). When you reach character level 3, you also always have the Lesser Restoration spell prepared and can cast it the same way. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Healing Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "medicine",
            "stealth"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "equipment": [
            "Choose A or B: (A) Herbalism Kit, Fine Clothes, Healer's Kit, 25 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Kundarak Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "As an heir of House Kundarak, you take great pride in your family and its work of safeguarding the valuables of Khorvaire. Your house has always been a leader among the clans of the Mror Holds. Though it has never held the crown, it has a reputation for professionalism, honor, and order. You might strive to uphold that reputation, you might place your own sense of honor over your family's, or you could rebel against the house's expectations and fl out the demands of honor.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Warding",
              "source": "EFA",
              "description": "You gain the following benefits. Warder's Intuition: When you make an Intelligence (Investigation) check or an ability check using Thieves' Tools, you can roll 1d4 and add the number rolled to the ability check. Wards and Seals: You always have the Alarm and Mage Armor spells prepared. You can cast each spell once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast these spells using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). When you reach character level 3, you also always have the Arcane Lock spell prepared and can cast it the same way. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Warding Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "arcana",
            "investigation"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "Choose A or B: (A) Thieves' Tools, Fine Clothes, 10 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Lyrandar Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "As an heir of House Lyrandar, the wind is your ally, the sea and sky your dominion. Despite the devastation of the Last War, your house is on the ascendancy, buoyed by its mastery of the new airship technology. You might have spent your early career on the sea as a sailor or navigator; as a shipwright; or as a member of the Raincallers' Guild, manipulating the weather and assisting with irrigation and similar public works. Or you might have been among the fi rst in your house to take to the skies as part of an airship crew. Service to the house might call you to hunt pirates in the Lhazaar Sea, to explore ancient ruins in search of magical technology to bind elemental forces, or to salvage a wrecked airship in the Mournland.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Storm",
              "source": "EFA",
              "description": "You gain the following benefits. Windwright's Intuition: When you make a Dexterity (Acrobatics) check or an ability check using Navigator's Tools, you can roll 1d4 and add the number rolled to the ability check. Storm's Boon: You have Resistance to Lightning damage. Storm Magic: You know the Thunderclap cantrip. When you reach character level 3, you also always have the Gust of Wind spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Storm Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "nature"
          ],
          "toolProficiencies": [
            "navigator's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Navigator's Tools, Fine Clothes, 10 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Medani Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "As a member of House Medani, your life revolves around subterfuge—not engaging in it, but preventing others from doing so. You see the world around you as an intricate web of schemes, plots, and counterplots. Assessing the range of possibilities, you use instinct to predict threats to your clients and defend against them well before those threats can turn into danger. Defending against an assassin's blade is a job any Deneith sellsword or Tharashk enforcer can do—making sure no one ever draws that blade is the Medani way.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Detection",
              "source": "EFA",
              "description": "You gain the following benefits. Deductive Intuition: When you make an Intelligence (Investigation) or Wisdom (Insight) check, you can roll 1d4 and add the number rolled to the ability check. Magical Detection: You always have the Detect Magic and Detect Poison and Disease spells prepared. You can cast each spell once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast these spells using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). When you reach character level 3, you also always have the See Invisibility spell prepared and can cast it the same way. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Detection Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "insight",
            "investigation"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "equipment": [
            "Choose A or B: (A) Disguise Kit, Fine Clothes, 10 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Orien Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "Before the Last War, Orien's influence covered Khorvaire, and its trade roads and lightning rails were the lifeblood of a vibrant kingdom. But the war cut those arteries, leaving Galifar dead and House Orien bloodied. While the house's couriers and shippers still keep goods moving on both sides of the continent, finding a way to reestablish routes across the Mournland remains the house's top priority. In the meantime, Orien adventurers can serve their house by investigating missing couriers, recovering goods stolen from caravans, and troubleshooting disruptions to the lightning rail.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Passage",
              "source": "EFA",
              "description": "You gain the following benefits. Courier's Speed: Your Speed increases by 5 feet. Intuitive Motion: When you make a Strength (Athletics) or Dexterity (Acrobatics) check, you can roll 1d4 and add the number rolled to the ability check. Magical Passage: You always have the Misty Step spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Passage Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "athletics"
          ],
          "toolProficiencies": [
            "cartographer's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Cartographer's Tools, Fine Clothes, Map, Map or Scroll Case, 18 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Phiarlan Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "Though you have seen wealth, fame, and beauty as a child of House Phiarlan, you consider knowledge (and the power it brings) the greatest treasure of all. You might pursue that power as an artist or performer, always alert for secrets even as you regale the world with story, song, acrobatics, or art. Or you might foster ties to the secretive espionage arm of your house: the Serpentine Table.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Shadow",
              "source": "EFA",
              "description": "You gain the following benefits. Cunning Intuition: When you make a Dexterity (Stealth) or Charisma (Performance) check, you can roll 1d4 and add the number rolled to the ability check. Shape Shadows: You know the Minor Illusion cantrip. You also always have the Invisibility spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Shadow Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "deception",
            "stealth"
          ],
          "toolProficiencies": [
            "disguise kit"
          ],
          "equipment": [
            "Choose A or B: (A) Disguise Kit, Fine Clothes, 10 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Sivis Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "For nearly thirty centuries, your family has worked to maintain order. Communication is the cord that binds civilization together, and your ancestors settled the disputes of sovereigns and helped the dragonmarked houses find a place in the world. Few people realize the influence House Sivis has had on the shape of the modern age—just as few know how often a royal adviser holds more power than the actual ruler. While the other dragonmarked houses fight for fame and recognition, House Sivis plays a long game of subtle influence behind the scenes, keeping order amid the chaos of unending intrigue.",
          "abilityBonuses": [
            {
              "from": [
                "int",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "int",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Scribing",
              "source": "EFA",
              "description": "You gain the following benefits. Gifted Scribe: When you make an Intelligence (History) check or an ability check using Calligrapher's Supplies, you can roll 1d4 and add the number rolled to the ability check. Scribe's Insight: You know the Message cantrip. You also always have the Comprehend Languages spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). When you reach character level 3, you also always have the Magic Mouth spell prepared and can cast it the same way. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Scribing Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "history",
            "perception"
          ],
          "toolProficiencies": [
            "calligrapher's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) Calligrapher's Supplies, Fine Clothes, Ink, 5 Ink Pen, Paper (30 sheets), Parchment (9 sheets), 8 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Tharashk Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "Heirs of other houses lead lives of luxury, but in House Tharashk you learned self-reliance from an early age. What your young house lacks in resources, it makes up for in spirit and determination. Tharashk has a destiny to fulfill, and you have a part in it. Whether in combat or in social interaction, you have learned to play the role of the hunter: study your enemies, exploit their weaknesses, and do whatever it takes to achieve victory.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Finding",
              "source": "EFA",
              "description": "You gain the following benefits. Hunter's Intuition: When you make a Wisdom (Perception or Survival) check, you can roll 1d4 and add the number rolled to the ability check. Finder's Magic: You always have the Hunter's Mark spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). When you reach character level 3, you also always have the Locate Object spell prepared and can cast it the same way. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Finding Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "perception",
            "survival"
          ],
          "equipment": [
            "Choose A or B: (A) Gaming Set (same as above), Climber's Kit, Fine Clothes, Hunting Trap, Manacles, 2 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Thuranni Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "Given House Thuranni's short history and focus on espionage, its leaders expect you to further the interests of the house at every opportunity. During the house's formative years as an independent entity, every move you make has been watched closely. This isn't to say that every Thuranni heir must actively spy at the behest of house elders. But even the house's most insular artists and artisans must keep up with current political events and pass on or collect information when asked.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Shadow",
              "source": "EFA",
              "description": "You gain the following benefits. Cunning Intuition: When you make a Dexterity (Stealth) or Charisma (Performance) check, you can roll 1d4 and add the number rolled to the ability check. Shape Shadows: You know the Minor Illusion cantrip. You also always have the Invisibility spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast it using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Shadow Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "performance",
            "stealth"
          ],
          "equipment": [
            "Choose A or B: (A) Musical Instrument (same as above), Costume, Fine Clothes, 13 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "House Vadalis Heir",
      "descriptions": [
        {
          "source": "EFA",
          "description": "You have grown up with respect for both family and nature. You understand the culture of the Five Nations, but you don't get drawn into the games of ambition and status that others play. You know the beauty and power inherent in life, the mysteries of birth and death, and the miracles that happen in between. Your insights into the natural world allow you to see through the lies and deception of city folk—and never let on how much of their subterfuge you recognize.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Mark of Handling",
              "source": "EFA",
              "description": "You gain the following benefits. Wild Intuition: When you make an Intelligence (Nature) or Wisdom (Animal Handling) check, you can roll 1d4 and add the number rolled to the ability check. Primal Connection: You always have the Animal Friendship and Speak with Animals spells prepared. You can cast each spell once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast these spells using any spell slots you have. Intelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose when you select this feat). Monstrous Connections: When you reach character level 3, you can target a Monstrosity when you cast Animal Friendship or Speak with Animals if the creature's Intelligence score is 3 or lower. Spells of the Mark: If you have the Spellcasting or Pact Magic class feature, the spells on the Mark of Handling Spells table are added to that feature's spell list."
            }
          ],
          "skillProficiencies": [
            "animal handling",
            "nature"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "equipment": [
            "Choose A or B: (A) Herbalism Kit, Fine Clothes, Net, 29 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Ice Fisher",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You come from a proud line of ice fishers out of Ten-Towns in Icewind Dale. Catching knucklehead trout isn't the most glorious trade in the North, but it's an honest living. You've trained your senses for the slightest tug on the line, wrestled big trout out of ice-covered lakes, and gutted enough knucklehead trout to feed your village many times over. These experiences have toughened your body and mind for a life of adventuring.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "con"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "con"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Alert",
              "source": "XPHB",
              "description": "You gain the following benefits. Initiative Proficiency: When you roll Initiative, you can add your Proficiency to the roll. Initiative Swap: Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition."
            }
          ],
          "skillProficiencies": [
            "animal handling",
            "athletics"
          ],
          "toolProficiencies": [
            "woodcarver's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Woodcarver's Tools, Basket, Block and Tackle, Chain, Hunting Trap, Net, Pole, Rations (3 days' worth), Traveler's Clothes, 32 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Inheritor",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "You are the heir to something of great value—not mere coin or wealth, but an object that has been entrusted to you and you alone. Your inheritance might have come directly to you from a member of your family, by right of birth, or it could have been left to you by a friend, a mentor, a teacher, or someone else important in your life. The revelation of your inheritance changed your life, and might have set you on the path to adventure, but it could also come with many dangers, including those who covet your gift and want to take it from you—by force, if need be.",
          "skillProficiencies": [
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "Your inheritance, a set of traveler's clothes, the tool you choose for this background's tool proficiency (gaming set or musical instrument), and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Initiate",
      "descriptions": [
        {
          "source": "PSA",
          "description": "You are an initiate, on the path to completing the trials of the five gods in the hope of earning a glorified death in the final Trial of Zeal. Some combination of your natural aptitude, your crop's needs, and your teachers' assessment while you were an acolyte led you to focus your training in one particular area of specialization—hand-to-hand combat, long-range combat, or spellcasting. But only a well-rounded initiate can be called truly worthy of the afterlife.\n\nIf you are a hand-to-hand specialist, consider the barbarian, fighter, monk, paladin, or rogue classes. As a long-range combat specialist, you might be a fighter, a ranger, or a rogue. If you are a spellcasting specialist, you might be a bard, sorcerer, or wizard. And beyond this initial choice, you might consider multiclassing or using feats to round out your skills in all three areas.",
          "skillProficiencies": [
            "athletics",
            "intimidation"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "equipment": [
            "A simple puzzle box, a scroll containing the basic teachings of the five gods, a gaming set, a set of common clothes, and a belt pouch containing 15 gp. If you have completed any trials before the start of the campaign, you also have any cartouches you have earned"
          ]
        }
      ]
    },
    {
      "name": "Inquisitive",
      "descriptions": [
        {
          "source": "EFA",
          "description": "You have honed your talents of investigation and deduction—fueled by a boundless curiosity—to explore mysteries, find missing people, recover stolen goods, unearth corruption and conspiracies, and solve crimes. As an inquisitive, you might have pursued freelance work, signed on with an inquisitive agency (perhaps one licensed by a dragonmarked house such as Medani or Tharashk), reported for a broadsheet, or worked for a police force.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Alert",
              "source": "XPHB",
              "description": "You gain the following benefits. Initiative Proficiency: When you roll Initiative, you can add your Proficiency to the roll. Initiative Swap: Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition."
            }
          ],
          "skillProficiencies": [
            "insight",
            "investigation"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "Choose A or B: (A) Thieves' Tools, Bullseye Lantern, Crowbar, Oil (10 flasks), Traveler's Clothes, 10 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Inquisitor",
      "descriptions": [
        {
          "source": "PSI",
          "description": "Historically, inquisitors were cathar detectives who investigated crimes both mundane and supernatural. They were known for traveling to remote parishes plagued by unexplained murders, and for exposing werewolves living among normal humans. During Avacyn's absence, when the archangel was trapped within the demonic prison known as the Helvault, the inquisitors led a series of brutal forays into Kessig and the Gavony Moorland. They executed suspected lycanthropes with little or no proof, and punished accused heretics in unsanctioned trials. With Avacyn's madness, this savage form of inquisition has become the norm, and inquisitors who still pry into dark mysteries have become a minority.",
          "skillProficiencies": [
            "investigation",
            "religion"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "A holy symbol, a set of traveler's clothes, and a belt pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Investigator",
      "descriptions": [
        {
          "source": "VRGR",
          "description": "You relentlessly seek the truth. Perhaps you're motivated by belief in the law and a sense of universal justice, or maybe that very law has failed you and you seek to make things right. You could have witnessed something remarkable or terrible, and now you must know more about this hidden truth. Or maybe you're a detective for hire, uncovering secrets for well-paying clients. Whether the mysteries you're embroiled in are local crimes or realm-spanning conspiracies, you're driven by a personal need to hunt down even the most elusive clues and reveal what others would keep hidden in the shadows.",
          "toolProficiencies": [
            "disguise kit",
            "thieves' tools"
          ],
          "equipment": [
            "A magnifying glass, evidence from a past case (choose one or roll for a trinket from the Horror Trinket later in this chapter), a Common Clothes, and 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Iron Route Bandit",
      "descriptions": [
        {
          "source": "ALCurseOfStrahd",
          "description": "The Iron Route, once the primary trade route between Phlan and Zhentil Keep, used to be a site of extensive banditry until the Phlan's recent occupation. Your time as an erstwhile bandit has given you plenty of experience in the saddle and a knack for acquiring and appraising other people's mounts, pets, and vehicles among other things. This particular set of skills has become very lucrative for you by working for the underground as a horse thief for a local guild of thieves and other shadowy organizations.",
          "skillProficiencies": [
            "animal handling",
            "stealth"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "equipment": [
            "A set of dark common clothes, pack saddle, burglar's pack, and a belt pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Izzet Engineer",
      "descriptions": [
        {
          "source": "GGR",
          "description": "Armed with an inventive intellect, a love of magical technology, and an unquenchable energy, you are an enthusiastic participant in the research work of the Izzet League. Though you're likely to begin your career as a mere attendant, you can aspire to become a skilled mage or alchemist, a laboratory supervisor, or even a flamethrower-wielding scorchbringer tasked with defending Izzet laboratories. The Izzet are obsessive, brilliant, inspired, and an unpredictable force of chaos in Ravnica, and you epitomize all of those qualities.",
          "skillProficiencies": [
            "arcana",
            "investigation"
          ],
          "languages": [
            "choose"
          ],
          "equipment": [
            "An Izzet insignia, one set of artisan's tools, the charred and twisted remains of a failed experiment, a hammer, a block and tackle, a set of common clothes, and a belt pouch containing 5 gp (Azorius 1-zino coins)"
          ]
        }
      ]
    },
    {
      "name": "Knight of Solamnia",
      "descriptions": [
        {
          "source": "DSotDQ",
          "description": "You have trained to be a valorous warrior known as a Knight of Solamnia. Strict rules guide your every action, and you work to uphold them as you strive to defend the weak and oppose evil. Your honor is as important to you as your life.",
          "feats": [
            {
              "name": "Squire of Solamnia",
              "source": "DSotDQ",
              "description": "Your training in the ways of the Knights of Solamnia grants you these benefits:"
            }
          ],
          "skillProficiencies": [
            "athletics",
            "survival"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "An insignia of rank, a playing card set, a set of common clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Knight of the Gauntlet",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "Not all who answer the call of a higher power are content to pore over scripture in a stuffy temple apse. You chose the path of the holy warrior by joining the Order of the Gauntlet. As a knight of the Gauntlet, you exercise righteous scorn for the forces of evil, unswerving camaraderie for your siblings in arms, and heartfelt compassion for the survivors of war. With weapon and holy symbol in hand, you've sworn not to rest until the light of justice has vanquished the shadow of chaos across Faerûn.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Tyro of the Gauntlet",
              "source": "FRHoF",
              "description": "You gain the following benefits. Stand as One: When an ally within 5 feet of you is subjected to an effect that would push or pull it, you can take a Reaction to prevent that ally from being pushed or pulled. To receive this benefit, the ally can't have the Incapacitated condition. Vigilant: When you take the Ready action, the next attack roll made against you has Disadvantage before the start of your next turn."
            }
          ],
          "skillProficiencies": [
            "athletics",
            "medicine"
          ],
          "toolProficiencies": [
            "smith's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Spear, Smith's Tools, Bullseye Lantern, Holy Symbol, Manacles, Oil (5 flasks), Tinderbox, Traveler's Clothes, 9 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Knight of the Order",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "You belong to an order of knights who have sworn oaths to achieve a certain goal. The nature of this goal depends on the order you serve, but in your eyes it is without question a vital and honorable endeavor. Faerûn has a wide variety of knightly orders, all of which have a similar outlook concerning their actions and responsibilities.\n\nThough the term \"knight\" conjures ideas of mounted, heavily armored warriors of noble blood, most knightly orders in Faerûn don't restrict their membership to such individuals. The goals and philosophies of the order are more important than the gear and fighting style of its members, and so most of these orders aren't limited to fighting types, but are open to all sorts of folk who are willing to battle and die for the order's cause.\n\nThe \"Knightly Orders of Faerûn\" sidebar details several of the orders that are active at present and is designed to help inform your decision about which group you owe allegiance to.\n\nMany who rightfully call themselves \"knight\" earn that title as part of an order in service to a deity, such as Kelemvor's Eternal Order or Mystra's Knights of the Mystic Fire. Other knightly orders serve a government, royal family, or are the elite military of a feudal state, such as the brutal Warlock Knights of Vaasa. Other knighthoods are secular and nongovernmental organizations of warriors who follow a particular philosophy, or consider themselves a kind of extended family, similar to an order of monks. Although there are organizations, such as the Knights of the Shield, that use the trappings of knighthood without necessarily being warriors, most folk of Faerûn who hear the word \"knight\" think of a mounted warrior in armor beholden to a code. Below are a few knightly organizations.\n\nThe Knights of the Unicorn began as a fad of romantically minded sons and daughters of patriar families in Baldur's Gate. On a lark, they took the unicorn goddess Lurue as their mascot and went on various adventures for fun. The reality of the dangers they faced eventually sank in, as did Lurue's tenets. Over time the small group grew and spread, gaining a following in places as far as Cormyr. The Knights of the Unicorn are chivalric adventurers who follow romantic ideals: life is to be relished and lived with laughter, quests should be taken on a dare, impossible dreams should be pursued for the sheer wonder of their completion, and everyone should be praised for their strengths and comforted in their weaknesses.\n\nLong ago, the Knights of Myth Drannor were a famous adventuring band, and Dove Falconhand, one of the famous Seven Sisters, was one of them. The band took its name to honor the great but fallen city, just as the new Knights of Myth Drannor do today. With the city once again in ruins, Dove Falconhand decided to reform the group with the primary goal of building alliances and friendship between the civilized races of the world and goodly people in order to combat evil. The Knights of Myth Drannor once again ride the roads of the Dalelands, and they've begun to spread to the lands beyond. Their members, each accepted by Dove herself, are above all valiant and honest.\n\nThe Knights of the Silver Chalice was formed by edict of the demigod Siamorphe in Waterdeep a century ago. Siamorphe's ethos is the nobility's right and responsibility to rule, and the demigod is incarnated as a different noble mortal in each generation. By the decree of the Siamorphe at that time, the Knights of the Silver Chalice took it upon themselves to put a proper heir on the throne of Tethyr and reestablish order in that kingdom. Since then they have grown to be the most popular knighthood in Tethyr, a nation that has hosted many knighthoods in fealty to the crown.",
          "skillProficiencies": [
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "One set of traveler's clothes, a signet, banner, or seal representing your place or rank in the order, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Lords' Alliance Vassal",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You've pledged your loyalty to a member-city of the Lords' Alliance. As an Alliance agent, you must uphold the tenets of the Alliance and seek to increase safety and prosperity along the Sword Coast. You're sworn to bring honor and glory to your lord's house, whether that means securing trade roads for a merchant-lord of Waterdeep or vanquishing monsters upriver of Daggerford. You've trained in the arts of swordplay and statecraft and are as deft with a blade as you are with a quill.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Lords' Alliance Agent",
              "source": "FRHoF",
              "description": "You gain the following benefits. Inspiring Strike: Once per turn when you score a Critical Hit against a creature, you can choose an ally within 30 feet of yourself who can see or hear you and who lacks Heroic Inspiration. That ally gains Heroic Inspiration. Reassert Honor: When an enemy you can see deals damage to an ally of yours that is within 5 feet of you, you have Advantage on your next attack roll against that enemy before the end of your next turn."
            }
          ],
          "skillProficiencies": [
            "insight",
            "persuasion"
          ],
          "toolProficiencies": [
            "calligrapher's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) 2 Javelin, Calligrapher's Supplies, Fine Clothes, Ink, 5 Ink Pens, Parchment (9 sheets), 13 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Lorehold Student",
      "descriptions": [
        {
          "source": "SCC",
          "description": "You have spent your youth preparing to be a student of Lorehold College, reading every book on the college's recommended reading list for prospective students. Your academic passions are in the broad field of history. You might dream of using magic to contact great historical figures or your own ancestors or of recreating the mighty magic of a distant age.",
          "feats": [
            {
              "name": "Strixhaven Initiate",
              "source": "SCC",
              "description": "You have studied some magical theory and have learned a few spells associated with Strixhaven University. Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table. You can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "history",
            "religion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), an ink pen, a hammer, a hooded lantern, a tinderbox, a tome of history, a school uniform, and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Lorwyn Expert",
      "descriptions": [
        {
          "source": "LFL",
          "description": "You hail from Lorwyn, a land of eternal sunshine, or you have studied the place with great intensity. You consider the majestic creature Eirdu the living embodiment of the sun, and you love embarking on whimsical adventures. You hold your loved ones close, even if only emotionally, for you've seen some venture into Shadowmoor or beyond and become faded versions of themselves. You're nevertheless courageous and always long for new experiences.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Child of the Sun",
              "source": "LFL",
              "description": "You gain the following benefits. Eyes of Eirdu: You and allies within 10 feet of you have Advantage on saving throws made to avoid or end the Blinded condition. Faerie Fire: You learn the Faerie Fire spell. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have. When you cast Faerie Fire without a spell slot using this benefit, taking damage can't break your Concentration on the spell."
            }
          ],
          "skillProficiencies": [
            "athletics",
            "nature"
          ],
          "toolProficiencies": [
            "cartographer's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Quarterstaff, Cartographer's Tools, Backpack, Basket, Parchment (4 sheets), Rope, Traveler's Clothes, 29 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Lyceum Scholar",
      "descriptions": [
        {
          "source": "TDCSR",
          "description": "You most likely came up through money or hailed from a family with social prestige if you were able to afford tuition at the Alabaster Lyceum in Emon. But whatever your origin, your interests and pursuits brought you to the hallowed halls of Tal'Dorei's highest place of learning, where you soaked in every lesson you could, hoping to better make your mark on the world. (Or at least you pretended to. Even at the Lyceum, every class has its slackers.) Eventually, though, the call to adventure pulled you from your studies, and you now face the challenge of keeping up with your education even as the tides of destiny threaten to sweep you away.\n\nYou might have come to the Lyceum to better research and understand the history and lore of Exandria and the lands you call home. Perhaps you sought a future here as a professor—or you might hope to do so still. You could also have been drawn by the promise of prosperity in politics, learning the inner workings of government and alliances to better position yourself as a future writer of history. Or perhaps your knack for the arcane inspired you to attend the Lyceum to refine your spellcraft, following in the footsteps of some of the finest wizards to ever practice the arts of magic.\n\nWhen you choose this background, you could be either an active student seeking adventures for your own research, or a graduated alumnus. With a little modification, you could easily be a professor as well.",
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A set of fine clothes, a student uniform, a writing kit (pouch with a quill, Ink (1-ounce bottle), Parchment (one sheet) and a penknife), and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Mage of High Sorcery",
      "descriptions": [
        {
          "source": "DSotDQ",
          "description": "Your talent for magic came to the attention of the Mages of High Sorcery, an organization of spellcasters that studies magic and prevents its misuse. You've trained among the Mages, but whether you'll face the dangerous test required to become a full member of the group remains to be determined. Your passion for studying magic has likely already predisposed you toward one of the organization's three orders: the benevolent Order of the White Robes, the balance-pursuing Order of the Red Robes, or the ruthless Order of the Black Robes.\n\nIn the world of Krynn, many refer to the Mages of High Sorcery as the Wizards of High Sorcery. The organization accepts more than wizards, though, with sorcerers, warlocks, and other spellcasters included among their ranks.",
          "feats": [
            {
              "name": "Initiate of High Sorcery",
              "source": "DSotDQ",
              "description": "You've received training from magic-users affiliated with the Mages of High Sorcery. Choose one of the three moons of Krynn to influence your magic: the black moon, Nuitari; the red moon, Lunitari; or the white moon, Solinari. You learn one cantrip of your choice from the wizard spell list and two 1st-level spells based on the moon you choose, as specified in the Lunar Spells table. You can cast each of the chosen 1st-level spells without a spell slot, and you must finish a long rest before you can cast them in this way again. You can also cast the spells using any spell slots you have. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "arcana",
            "history"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), an ink pen, a set of common clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Marine",
      "descriptions": [
        {
          "source": "GoS",
          "description": "You were trained for battle on sandy beaches and rocky shores. You have launched midnight raids from swift ships whose names evoke terror in the hearts of your adversaries. The water is your second home, the rain your shelter, and the crashing waves your battle cry.",
          "skillProficiencies": [
            "athletics",
            "survival"
          ],
          "toolProficiencies": [
            "vehicles (water)",
            "vehicles (land)"
          ],
          "equipment": [
            "A dagger that belonged to a fallen comrade, a folded flag emblazoned with the symbol of your ship or company, a set of traveler's clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Mercenary Veteran",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "As a sell-sword who fought battles for coin, you're well acquainted with risking life and limb for a chance at a share of treasure. Now, you look forward to fighting foes and reaping even greater rewards as an adventurer. Your experience makes you familiar with the ins and outs of mercenary life, and you likely have harrowing stories of events on the battlefield. You might have served with a large outfit such as the Zhentarim or the soldiers of Mintarn, or a smaller band of sell-swords, maybe even more than one. (See the \"Mercenaries of the North\" sidebar for a collection of possibilities.)\n\nNow you're looking for something else, perhaps greater reward for the risks you take, or the freedom to choose your own activities. For whatever reason, you're leaving behind the life of a soldier for hire, but your skills are undeniably suited for battle, so now you fight on in a different way.\n\nCountless mercenary companies operate up and down the Sword Coast and throughout the North. Most are small-scale operations that employ a dozen to a hundred folk who offer security services, hunt monsters and brigands, or go to war in exchange for gold. Some organizations, such as the Zhentarim, Flaming Fist, and the nation of Mintarn have hundreds or thousands of members and can provide private armies to those with enough funds. A few organizations operating in the North are described below.\n\nThe cold and mysterious Lurkwood serves as the home of numerous groups of goblinoids that have banded together into one tribe called the Chill. Unlike most of their kind, the Chill refrains from raiding the people of the North and maintains relatively good relations so that they can hire themselves out as warriors. Few city-states in the North are willing to field an army alongside the Chill, but several are happy to quietly pay the Chill to battle the Uthgardt, orcs, trolls of the Evermoors, and other threats to civilization.\n\nConsisting solely of elves, Silent Rain is a legendary mercenary company operating out of Evereska. Caring little for gold or fame, Silent Rain agrees only to jobs that either promote elven causes or involve destroying orcs, gnolls, and the like. Prospective employers must leave written word (in Elvish) near Evereska, and the Silent Rain sends a representative if interested.\n\nFounded in Sundabar nearly two centuries ago, the Bloodaxes were originally a group of dwarves outcast from their clans for crimes against the teachings of Moradin Soulforger. They began hiring out as mercenaries to whoever in the North would pay them. Since then the mercenary company has broadened its membership to other races, but every member is an exile, criminal, or misfit of some sort looking for a fresh start and a new family among the bold Bloodaxes.",
          "skillProficiencies": [
            "athletics",
            "persuasion"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "equipment": [
            "A uniform of your company (traveler's clothes in quality), an insignia of your rank, a gaming set of your choice, and a pouch containing the remainder of your last wages (10 gp)."
          ]
        }
      ]
    },
    {
      "name": "Merchant",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "You were apprenticed to a trader, caravan master, or shopkeeper, learning the fundamentals of commerce. You traveled broadly, and you earned a living by buying and selling the raw materials artisans need to practice their craft or finished works from such crafters. You might have transported goods from one place to another (by ship, wagon, or caravan) or bought them from traveling traders and sold them in your own shop.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Lucky",
              "source": "XPHB",
              "description": "You gain the following benefits. Luck Points: You have a number of Luck Points equal to your Proficiency and can spend the points on the benefits below. You regain your expended Luck Points when you finish a Long Rest. Advantage: When you roll a d20 for a D20 Test, you can spend 1 Luck Point to give yourself Advantage on the roll. Disadvantage: When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose Disadvantage on that roll."
            }
          ],
          "skillProficiencies": [
            "animal handling",
            "persuasion"
          ],
          "toolProficiencies": [
            "navigator's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Navigator's Tools, Pouch, Traveler's Clothes, 22 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Moonwell Pilgrim",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "Like many who hail from the Moonshae Isles, you grew up revering the blessed land, its unique gods, and the mysterious shrines called the moonwells. As a moonwell pilgrim, you undertook a quest to visit and commune with every moonwell on (or off) the map. Along your idyllic journeys, you collected a repertoire of Moonshavian folk songs, painted landscapes of enchanting vistas, and even learned how to wield a bit of primal magic.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Magic Initiate",
              "source": "XPHB",
              "description": "You gain the following benefits. Two Cantrips: You learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat). Level 1 Spell: Choose a level 1 spell from the same list you selected for this feat's cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have. Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list. Repeatable: You can take this feat more than once, but you must choose a different spell list each time."
            }
          ],
          "skillProficiencies": [
            "nature",
            "performance"
          ],
          "toolProficiencies": [
            "painter's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) Quarterstaff, Painter's Supplies, Bedroll, Bell, Pouch, Robe, String, Traveler's Clothes, Waterskin, 38 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Mulhorandi Tomb Raider",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You grew up in a land of living god-kings, and as a child you were told countless stories of ancient empires and buried cities. In these tales, Mulhorand was a land overflowing with forgotten riches—priceless treasures awaiting anyone cunning and brave enough to seek them out. You've taken it upon yourself to explore your homeland's crypts, tombs, and pyramids to reclaim your people's relics.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "int"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Lucky",
              "source": "XPHB",
              "description": "You gain the following benefits. Luck Points: You have a number of Luck Points equal to your Proficiency and can spend the points on the benefits below. You regain your expended Luck Points when you finish a Long Rest. Advantage: When you roll a d20 for a D20 Test, you can spend 1 Luck Point to give yourself Advantage on the roll. Disadvantage: When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose Disadvantage on that roll."
            }
          ],
          "skillProficiencies": [
            "investigation",
            "religion"
          ],
          "toolProficiencies": [
            "mason's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Light Hammer, Mason's Tools, Backpack, Bedroll, Crowbar, Ladder, Pole, 2 Pouch, Rope, String, Tinderbox, 5 Torch, Traveler's Clothes, Waterskin 26 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Mulmaster Aristocrat",
      "descriptions": [
        {
          "source": "ALElementalEvil",
          "description": "From your hilltop home, you have looked down (literally and perhaps figuratively) on the unwashed masses of Mulmaster for your entire life. Your fur-trimmed robes and training in the visual and performing arts mark you as wealthy and perhaps well-born; you are a member of the City of Danger's aristocracy. None of your immediate family members sits on the Council of Blades or is even a Zor or Zora...yet. Nevertheless, you are one of Mulmaster's elite, and whether you personally covet a higher standing or not, you are at home in the dance halls where the aristocracy gathers to plot, to scheme, to do business, to discuss the arts, and, above all, to see, and to be seen.",
          "skillProficiencies": [
            "deception",
            "performance"
          ],
          "equipment": [
            "One set of artisan's tools or musical instrument, a set of fine clothes, and a purse containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Mythalkeeper",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "Mythals are sources of great magical power that can alter the Weave or even the very nature of reality. Most were constructed in antiquity, and many have since been damaged or gone dormant. As a mythalkeeper from the Dalelands, your first experience with a mythal was likely in the ruins of Myth Drannor. You roam Faerûn in search of other ruined places of power, hoping to learn more about the history and powers of mythals—or even restore a malfunctioning one.",
          "abilityBonuses": [
            {
              "from": [
                "int",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "int",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Crafter",
              "source": "XPHB",
              "description": "You gain the following benefits. Tool Proficiency: You gain proficiency with three different Artisan's Tools of your choice from the Fast Crafting table. Discount: Whenever you buy a nonmagical item, you receive a 20 percent discount on it. Fast Crafting: When you finish a Long Rest, you can craft one piece of gear from the Fast Crafting table, provided you have the Artisan's Tools associated with that item and have proficiency with those tools. The item lasts until you finish another Long Rest, at which point the item falls apart."
            }
          ],
          "skillProficiencies": [
            "arcana",
            "history"
          ],
          "toolProficiencies": [
            "jeweler's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Quarterstaff, Jeweler's Tools, Perfume, Pouch, Robe, Shovel, String, Waterskin, 16 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Noble",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You understand wealth, power, and privilege. You carry a noble title, and your family owns land, collects taxes, and wields significant political influence. You might be a pampered aristocrat unfamiliar with work or discomfort, a former merchant just elevated to the nobility, or a disinherited scoundrel with a disproportionate sense of entitlement. Or you could be an honest, hard-working landowner who cares deeply about the people who live and work on your land, keenly aware of your responsibility to them.\n\nWork with your DM to come up with an appropriate title and determine how much authority that title carries. A noble title doesn't stand on its own—it's connected to an entire family, and whatever title you hold, you will pass it down to your own children. Not only do you need to determine your noble title, but you should also work with the DM to describe your family and their influence on you.\n\nIs your family old and established, or was your title only recently bestowed? How much influence do they wield, and over what area? What kind of reputation does your family have among the other aristocrats of the region? How do the common people regard them?\n\nWhat's your position in the family? Are you the heir to the head of the family? Have you already inherited the title? How do you feel about that responsibility? Or are you so far down the line of inheritance that no one cares what you do, as long as you don't embarrass the family? How does the head of your family feel about your adventuring career? Are you in your family's good graces, or shunned by the rest of your family?\n\nDoes your family have a coat of arms? An insignia you might wear on a signet ring? Particular colors you wear all the time? An animal you regard as a symbol of your line or even a spiritual member of the family?\n\nThese details help establish your family and your title as features of the world of the campaign.",
          "skillProficiencies": [
            "history",
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You were raised in a castle, surrounded by wealth, power, and privilege. Your family of minor aristocrats ensured that you received a first-class education, some of which you appreciated and some of which you resented. Your time in the castle, especially the many hours you spent observing your family at court, also taught you a great deal about leadership.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Skilled",
              "source": "XPHB",
              "description": "You gain proficiency in any combination of three Skill List; Skills or tools of your choice. Repeatable: You can take this feat more than once."
            }
          ],
          "skillProficiencies": [
            "history",
            "persuasion"
          ],
          "equipment": [
            "Choose A or B: (A) Gaming Set (same as above), Fine Clothes, Perfume, 29 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Orzhov Representative",
      "descriptions": [
        {
          "source": "GGR",
          "description": "The prospect of immense wealth is the promise of membership in the Orzhov Syndicate. All of the guild's endeavors channel wealth from Ravnican society into the ranks of the Orzhov—and concentrates the spoils at the top of the hierarchy. As a functionary in that system, your best hope is to claim as much as possible of the money that passes through your hands on its way up, so that you can work your way into a more prominent position.\n\nRegardless of your past and the wealth of your family, your initial status with the guild is near the bottom, until you have proven your value.",
          "skillProficiencies": [
            "intimidation",
            "religion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "An Orzhov insignia, a foot-long chain made of ten gold coins, vestments, a set of fine clothes, and a belt pouch containing 1 pp (an Orzhov-minted 10-zino coin)"
          ]
        }
      ]
    },
    {
      "name": "Outlander",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You grew up in the wilds, far from civilization and the comforts of town and technology. You've witnessed the migration of herds larger than forests, survived weather more extreme than any city-dweller could comprehend, and enjoyed the solitude of being the only thinking creature for miles in any direction. The wilds are in your blood, whether you were a nomad, an explorer, a recluse, a hunter-gatherer, or even a marauder. Even in places where you don't know the specific features of the terrain, you know the ways of the wild.",
          "skillProficiencies": [
            "athletics",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A staff, a hunting trap, a trophy from an animal you killed, a set of traveler's clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Phlan Insurgent",
      "descriptions": [
        {
          "source": "ALCurseOfStrahd",
          "description": "The taking of Phlan by Vorgansharax is a clear memory in your mind. You were going about your everyday business when the green dragon's forces spilled out of the sewers and assailed your home. Many of Phlan's citizens, young and old alike, were captured, killed, or offered as tribute to the Maimed Virulence. You, yourself were one of those captured. But, either with the help of adventurers or through your own wits and sheer determination, you escaped.\n\nRather than flee the region, you've chosen to stay and fight. Finding refuge outside the town and the deadly thicket surrounding it, you strike out against the Tears of the Virulence and their monstrous allies. You've learned to survive in dire and desperate circumstances, with supplies running low and the arrival of reinforcements uncertain. You've grown accustomed to acting under the cover of night, dealing what blows you can to avenge the friends and family you lost within the currently occupied Phlan. You will drive Vorgansharax out, or you die trying.",
          "skillProficiencies": [
            "stealth",
            "survival"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "equipment": [
            "A bag of caltrops (bag of 20), a small trinket that connects you to the life you once had before the occupation of Phlan, a healer's kit, a set of dark common clothes that includes a cloak and hood, and a belt pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Phlan Refugee",
      "descriptions": [
        {
          "source": "ALElementalEvil",
          "description": "Gone are the happier days of walking into the Laughing Goblin Inn after a hard day's labor. Everything has changed, and you are lucky to be alive. Back in Phlan you could count yourself among those street-wise folks who knew when to pay a bribe and who to work with to make a living. Your ability to listen to the winds of change have saved you before, and this time they allowed you to be one of the lucky few who escaped Phlan with something more than just the shirt on your back.",
          "skillProficiencies": [
            "insight",
            "athletics"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A set of artisan's tools (one of your choice), a token of the life you once knew, a set of traveler's clothes, and a belt pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Plaintiff",
      "descriptions": [
        {
          "source": "AI",
          "description": "Sure, accidents happen. But they seem to happen an awful lot when Acquisitions Incorporated operatives are on the scene. Naturally, nothing ever happens when there are no witnesses left behind. But sometimes one casualty is left a little less than dead, just waiting to discover what a lucky break that accident actually was.\n\nYou were a victim of a legal incident that was ostensibly the fault of Acquisitions Incorporated. At least that's what the local magistrate said. But before a final ruling could be handed down, Acquisitions Incorporated offered you a job! Don't know how to swing a sword? They promised to teach you! Think you have what it takes to sling spells? They've got masters who'll have you throwing fire in no time!\n\nWith the promise of untold treasures and realms of magic and mystery just a dungeon away, you left your old life behind. Now a world of adventure is yours. Just initial here and sign here and here. Absolve Acq Inc of all former claims, and acknowledge you understand past outcomes don't guarantee future results.",
          "skillProficiencies": [
            "medicine",
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "One set of artisan's tools, fine clothes, 20 gp"
          ]
        }
      ]
    },
    {
      "name": "Planar Philosopher",
      "descriptions": [
        {
          "source": "SatO",
          "description": "You subscribe to a philosophy that seeks to understand the nature of the planes or some hidden truth of the multiverse. You draw strength from your conviction and, perhaps, a network of like-minded thinkers, such as the factions of Sigil (summarized below). In your travels, you explore the depths of your understanding and spread your philosophy wherever you go.",
          "feats": [
            {
              "name": "Scion of the Outer Planes",
              "source": "SatO",
              "description": "Your connection to an Outer Plane infuses you with the energy there. Choose a type of plane listed in the Planar Infusion table. Your choice gives you resistance to a damage type and the ability to cast a cantrip, as specified in the table. You can cast this cantrip without material components, and your spellcasting ability for it is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "arcana"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A portal key (such as a bag of golden tea leaves or the tooth of a planar beast), a manifesto of your guiding philosophy, a set of common clothes in your faction's style, and a pouch containing 10 gp worth of coins from different worlds and planes"
          ]
        }
      ]
    },
    {
      "name": "Prismari Student",
      "descriptions": [
        {
          "source": "SCC",
          "description": "You are an artist, and you have been preparing to hone your craft according to the traditions of Prismari College. Whatever your medium—sculpture, dance, paint, music, drama, architecture, or any other field—you have grand visions of bringing your art to life in a fusion of magic and creativity.",
          "feats": [
            {
              "name": "Strixhaven Initiate",
              "source": "SCC",
              "description": "You have studied some magical theory and have learned a few spells associated with Strixhaven University. Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table. You can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "performance"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), an ink pen, a set of artisan's tools or a musical instrument (one of your choice), a school uniform, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Purple Dragon Squire",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You've pledged your life to the safety of Cormyr and sought admission to that realm's order of elite warriors: the Purple Dragon Knights. But before you have the chance to join the ranks officially, you must first serve as a knight's squire. You've found a liege willing to take you on and teach you the order's ways. Will you uphold the Purple Dragon Knights' ideals of glory, honor, and strength and prove yourself worthy of knighthood?",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Purple Dragon Rook",
              "source": "FRHoF",
              "description": "You gain the following benefits. Entreat: You gain proficiency in one of the following skills: Insight, Performance, or Persuasion. Rallying Cry: When you roll Initiative and don't have the Incapacitated condition, you can choose a number of creatures equal to your Proficiency that you can see within 30 feet of yourself. Those creatures gain Heroic Inspiration. Once you use this benefit, you can't do so again until you finish a Long Rest."
            }
          ],
          "skillProficiencies": [
            "animal handling",
            "insight"
          ],
          "toolProficiencies": [
            "navigator's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Spear, Navigator's Tools, Fine Clothes, 9 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Quandrix Student",
      "descriptions": [
        {
          "source": "SCC",
          "description": "In preparation to become a student of Quandrix College, you have spent years working through the college's math problems for prospective students. Your interests concentrate on the mathematical principles and patterns found in the natural world. You might lean more toward mathematics or physics, or you delve into more abstract studies of metaphysics, arcana, or logic.",
          "feats": [
            {
              "name": "Strixhaven Initiate",
              "source": "SCC",
              "description": "You have studied some magical theory and have learned a few spells associated with Strixhaven University. Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table. You can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "arcana",
            "nature"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), an ink pen, an abacus, a book of arcane theory, a school uniform, and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Rakdos Cultist",
      "descriptions": [
        {
          "source": "GGR",
          "description": "You're an entertainer at heart, a performer with a flair for the dramatic and a love of the spotlight. You've spent years honing your craft, mastering a demanding set of skills so you can perform them with panache and make them look easy. The wild applause, the screams of the crowds, the mayhem and terror spreading into the streets—this is what you live for.\n\nYou're also a member of a cult devoted to an ancient demon who delights in violence and chaos. It just so happens that Rakdos loves a good show, and your highest aspiration is to please the Defiler, the Lord of Riots, with your own performance.",
          "skillProficiencies": [
            "acrobatics",
            "performance"
          ],
          "languages": [
            "choose"
          ],
          "equipment": [
            "A Rakdos insignia, a musical instrument (one of your choice), a costume clothes, a hooded lantern made of wrought iron, a 10-foot length of chain with sharply spiked links, a tinderbox, 10 torch, a set of common clothes, a belt pouch containing 10 gp (a mix of Azorius and Boros 1-zino coins), and a bottle of sweet, red juice"
          ]
        }
      ]
    },
    {
      "name": "Rashemi Wanderer",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You spent years wandering the highlands of Rashemen, a dangerous windswept heath that's dotted with ancient obelisks enchanted to imprison Fiends and home to dragons, gnolls, and other deadly creatures. Friendships are hard to find in such an isolated land, and you've learned to keep strangers at a distance.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Tough",
              "source": "XPHB",
              "description": "Your Hit Points maximum increases by an amount equal to twice your character level when you gain this feat. Whenever you gain a character level thereafter, your Hit Points maximum increases by an additional 2 Hit Points."
            }
          ],
          "skillProficiencies": [
            "intimidation",
            "perception"
          ],
          "toolProficiencies": [
            "cartographer's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Cartographer's Tools, Backpack, Bedroll, Hooded Lantern, Oil (3 flasks), Rope, Tinderbox, Traveler's Clothes, Waterskin, 23 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Reformed Cultist",
      "descriptions": [
        {
          "source": "TDCSR",
          "description": "Two pantheons have battled over the fate of Exandria since the world's founding—the Prime Deities and the Betrayer Gods. During the Calamity, the Prime Deities allied themselves with the mortal races of Exandria, their original creations, to protect their flawed world and its multifarious forms of life. The Betrayers sought to wipe the slate clean.\n\nAt the end of that devastating war, the Prime Deities established a Divine Gate that would prevent all gods, good or evil, from directly affecting the world, but which would leave the gods' mortal followers and supernal servants to enact their will. And so the corrupting whispers of the Betrayer Gods have ensnared the minds of power-hungry mortals for centuries, promising them a sliver of the gods' great power in exchange for dedicating their souls to occult lore.\n\nYou once belonged to such a cult of the Betrayer Gods. Perhaps this faith only briefly tempted your rebellious, youthful spirit. Perhaps the cult gave you love and family when you had none, asking only your adherence to their prophet in exchange. Or maybe you were raised from birth to pay homage to gods of selfish cruelty—until one fateful day the veil was lifted, so that nothing stood between you and the horrifying truth.\n\nHowever it happened, you were freed from the shackles of this poisonous sect. Yet you know that this group does not forgive betrayers. As long as you live, you will be hunted—and if the members of the cult think you dead, their hunt will begin again the second they learn they're wrong.",
          "skillProficiencies": [
            "deception",
            "religion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "Vestments and a holy symbol of your previous cult, a set of common clothes, a belt pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Rewarded",
      "descriptions": [
        {
          "source": "BMT",
          "description": "You were living a difficult life before your destiny suddenly changed through a miraculous turn of good fortune. Perhaps a benevolent deity gave you precisely what you most desired. You might have stumbled across a Deck of Many Things and drawn a card with a potent, positive effect. Or maybe you inherited a modest fortune from a distant relative you didn't know you had.\n\nRegardless, you left the daily miseries of your old life behind in favor of a life of adventure and excitement. Your old debts have been paid, responsibilities you thought inescapable are behind you, or you suddenly possess rare and unusual skills unknown to ordinary folk.",
          "feats": [
            {
              "name": "Lucky",
              "source": "PHB",
              "description": "You have inexplicable luck that seems to kick in at just the right moment. You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw. You can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker's roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled. You regain your expended luck points when you finish a long rest."
            },
            {
              "name": "Magic Initiate",
              "source": "PHB",
              "description": "Choose a class: bard, cleric, druid, sorcerer, warlock, or wizard. You learn two cantrips of your choice from that class's spell list. In addition, choose one 1st-level spell to learn from that same list. Using this feat, you can cast the spell once at its lowest level, and you must finish a long rest before you can cast it in this way again. Your spellcasting ability for these spells depends on the class you chose: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard."
            },
            {
              "name": "Skilled",
              "source": "PHB",
              "description": "You gain proficiency in any combination of three skills or tools of your choice."
            }
          ],
          "skillProficiencies": [
            "insight",
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A bottle of black ink, an ink pen, five sheets of paper, a gaming set (matching your chosen proficiency), a signet ring, a set of fine clothes, and a pouch containing 18 gp"
          ]
        }
      ]
    },
    {
      "name": "Rival Intern",
      "descriptions": [
        {
          "source": "AI",
          "description": "You were an intern at a rival of Acquisitions Incorporated, and you gained a healthy respect for not just the job and the franchising opportunities, but for the ruthless and efficient way Acquisitions Incorporated goes about its business. Why deal with the rest, when you can work for the best?\n\nPerhaps the rival did not treat you as well as you were hoping, or you washed out of that organization. Maybe you hope to leverage the knowledge you gained there for an advantage at Acquisitions Incorporated. Either way, you're now bringing your talents to the company, ready to put your skills to use.",
          "skillProficiencies": [
            "history",
            "investigation"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "One set of artisan's tools, a ledger from your previous employer containing a small piece of useful information, a set of fine clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Ruined",
      "descriptions": [
        {
          "source": "BMT",
          "description": "Everything was going so well! You had a life of luxury, love, and comfort when you suddenly lost it all. Perhaps you were framed for crimes you didn't commit and lost your reputation, fortune, and career. Maybe a rampaging dragon or another monster wiped out everything you had in a single calamitous afternoon. Or you might have sought out a Deck of Many Things, hoping to make your successful life even more glorious—only to draw a destructive card that changed your destiny forever.\n\nYour desperation has driven you to the career of adventurer. You don't seek out dark dungeons and their monstrous inhabitants for excitement and glory; you do it because every other path is closed to you. But you have risen high on fortune's wheel once before, and with luck and fortitude, you could do so again.",
          "feats": [
            {
              "name": "Alert",
              "source": "PHB",
              "description": "Always on the lookout for danger, you gain the following benefits:"
            },
            {
              "name": "Skilled",
              "source": "PHB",
              "description": "You gain proficiency in any combination of three skills or tools of your choice."
            },
            {
              "name": "Tough",
              "source": "PHB",
              "description": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points."
            }
          ],
          "skillProficiencies": [
            "stealth",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A cracked hourglass, a set of rusty manacles, a half-empty bottle, a hunting trap, a gaming set (matching your chosen proficiency), a set of traveler's clothes, and a pouch containing 13 gp"
          ]
        }
      ]
    },
    {
      "name": "Rune Carver",
      "descriptions": [
        {
          "source": "BGG",
          "description": "What we call rune magic is the palest imitation of Annam's creative work. He shaped worlds from the primal elements; we struggle to bind the merest scraps of elemental power into the mystic shapes of our runes.\n\nYou've dedicated your life to studying runecraft. Whether you were taught by a master rune carver or learned by poring over ancient engravings, you can tap into the supernatural power held within runes.\n\nThe art of runecraft was initially created by giants, but over time, the practice has been adopted by many peoples. As such, though Giant runes are the most commonly used, many rune carvers incorporate symbols from their native languages into the craft.",
          "feats": [
            {
              "name": "Rune Shaper",
              "source": "BGG",
              "description": "You've studied the magic of Giant runes, granting you the following benefits:"
            }
          ],
          "skillProficiencies": [
            "history",
            "perception"
          ],
          "languages": [
            "giant"
          ],
          "equipment": [
            "A set of artisan's tools (one of your choice), a small knife, a whetstone, a set of common clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Sage",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You spent years learning the lore of the multiverse. You scoured manuscripts, studied scrolls, and listened to the greatest experts on the subjects that interest you. Your efforts have made you a master in your fields of study.",
          "skillProficiencies": [
            "arcana",
            "history"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), a quill, a small knife, a letter from a dead colleague posing a question you have not yet been able to answer, a set of common clothes, and a belt pouch containing 10 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You spent your formative years traveling between manors and monasteries, performing various odd jobs and services in exchange for access to their libraries. You whiled away many a long evening studying books and scrolls, learning the lore of the multiverse—even the rudiments of magic—and your mind yearns for more.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Magic Initiate",
              "source": "XPHB",
              "description": "You gain the following benefits. Two Cantrips: You learn two cantrips of your choice from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat). Level 1 Spell: Choose a level 1 spell from the same list you selected for this feat's cantrips. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have. Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list. Repeatable: You can take this feat more than once, but you must choose a different spell list each time."
            }
          ],
          "skillProficiencies": [
            "arcana",
            "history"
          ],
          "toolProficiencies": [
            "calligrapher's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) Quarterstaff, Calligrapher's Supplies, Book (history), Parchment (8 sheets), Robe, 8 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Sailor",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You sailed on a seagoing vessel for years. In that time, you faced down mighty storms, monsters of the deep, and those who wanted to sink your craft to the bottomless depths. Your first love is the distant line of the horizon, but the time has come to try your hand at something new.\n\nDiscuss the nature of the ship you previously sailed with your Dungeon Master. Was it a merchant ship, a naval vessel, a ship of discovery, or a pirate ship? How famous (or infamous) is it? Is it widely traveled? Is it still sailing, or is it missing and presumed lost with all hands?\n\nWhat were your duties on board–boatswain, captain, navigator, cook, or some other position? Who were the captain and first mate? Did you leave your ship on good terms with your fellows, or on the run?",
          "skillProficiencies": [
            "athletics",
            "perception"
          ],
          "toolProficiencies": [
            "navigator's tools",
            "vehicles (water)"
          ],
          "equipment": [
            "A belaying pin (club), silk rope (50 feet), a lucky charm such as a rabbit foot or a small stone with a hole in the center (or you may roll for a random trinket on the Trinkets table in chapter 5), a set of common clothes, and a belt pouch containing 10 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You lived as a seafarer, wind at your back and decks swaying beneath your feet. You've perched on barstools in more ports of call than you can remember, faced mighty storms, and swapped stories with folk who live beneath the waves.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Tavern Brawler",
              "source": "XPHB",
              "description": "You gain the following benefits. Enhanced Unarmed Strike: When you hit with your Unarmed Strike and deal damage, you can deal Bludgeoning damage equal to 1d4 plus your Strength modifier instead of the normal damage of an Unarmed Strike. Damage Rerolls: Whenever you roll a damage die for your Unarmed Strike, you can reroll the die if it rolls a 1, and you must use the new roll. Improvised Weaponry: You have proficiency with improvised weapons. Push: When you hit a creature with an Unarmed Strike as part of the Attack action on your turn, you can deal damage to the target and also push it 5 feet away from you. You can use this benefit only once per turn."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "perception"
          ],
          "toolProficiencies": [
            "navigator's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Navigator's Tools, Rope, Traveler's Clothes, 20 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Scribe",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "You spent formative years in a scriptorium, a monastery dedicated to the preservation of knowledge, or a government agency, where you learned to write with a clear hand and produce finely written texts. Perhaps you scribed government documents or copied tomes of literature. You might have some skill as a writer of poetry, narrative, or scholarly research. Above all, you have a careful attention to detail, helping you avoid introducing mistakes to the documents you copy and create.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Skilled",
              "source": "XPHB",
              "description": "You gain proficiency in any combination of three Skill List; Skills or tools of your choice. Repeatable: You can take this feat more than once."
            }
          ],
          "skillProficiencies": [
            "investigation",
            "perception"
          ],
          "toolProficiencies": [
            "calligrapher's supplies"
          ],
          "equipment": [
            "Choose A or B: (A) Calligrapher's Supplies, Fine Clothes, Lamp, Oil (3 flasks), Parchment (12 sheets), 23 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Secret Identity",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "Even though you are a non-human, despite Hillfar's Great Law of Humanity, you continue to live in the City of Trade. You do so by maintaining a secret identity, forging documents, and wearing a disguise. Few, if any, know you aren't human. If you're a halfling or gnome, you pass as a little person or a child. If you're a half-elf, half-orc, or genasi, you disguise your non-human features. Other races use a combination of disguise and concealing clothing to hide. Your reasons for doing so are your own. Perhaps you're a dissident or the agent of a foreign power. Maybe you have a relationship with someone you cannot bear to leave. Regardless, this way of life has taken a heavy toll on you.",
          "skillProficiencies": [
            "deception",
            "stealth"
          ],
          "toolProficiencies": [
            "disguise kit",
            "forgery kit"
          ],
          "equipment": [
            "A disguise kit, a forgery kit, a set of common clothes, a belt pouch, 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Selesnya Initiate",
      "descriptions": [
        {
          "source": "GGR",
          "description": "You are a member of a blessed community, built on the ideals of harmony. Here, nature and civilization coexist peacefully, living and growing in accordance with the will of the Worldsoul, Mat'Selesnya. As a member of the Selesnya Conclave, you are surrounded by people and other creatures who share your worldview and your longing for deeper spiritual communion with the world, and you have a fervent desire to share the joy you have experienced with Ravnica. Along with the rest of the conclave, you are committed to resisting the ambitions of the other guilds—with military force if necessary.",
          "skillProficiencies": [
            "nature",
            "persuasion"
          ],
          "languages": [
            "choose"
          ],
          "equipment": [
            "A Selesnya insignia, a healer's kit, robes, a set of common clothes, and a belt pouch containing 5 gp (Azorius 1-zino coins)"
          ]
        }
      ]
    },
    {
      "name": "Shade Fanatic",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "You grew up at a time when the wizards of Netheril were at war with the elves of Cormanthor. You recall sitting cross-legged hearing the stories of the glorious Thultanthar, also called the Shade Enclave and the City of Shade, and aspired to study there and maybe even did, for a time. Your dreams came crashing down a few years ago when Thultanthar fell from the sky upon Myth Drannor. You know that there was a Netherese Garrison stationed near Hillsfar and have heard rumors that its downfall came from traitors within the ranks. You remain loyal to Netheril and seek other Shade loyalists and fanatics in the Cormanthor forest and the areas surrounding Hillsfar.",
          "skillProficiencies": [
            "deception",
            "intimidation"
          ],
          "toolProficiencies": [
            "forgery kit"
          ],
          "languages": [
            "other"
          ],
          "equipment": [
            "A forgery kit, a transparent cylinder of shadow that has no opening, a signet ring, a set of fine clothes, and 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Shadowmasters Exile",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You trained your whole life to become a member of the Shadowmasters, the mysterious thieves' guild that controls the realm of Thesk from behind the scenes. Stealth and quick reflexes were just the start of your Shadowmaster education; you also needed to hone your ruthlessness to ensure the safety of the guild's secrets. But one wrong move led to your expulsion from the order. Now you must walk your own path.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Savage Attacker",
              "source": "XPHB",
              "description": "You've trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "stealth"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "Choose A or B: (A) 2 Daggers, Thieves' Tools, Caltrops, Costume, Grappling Hook, Iron Spikes, Mirror, 2 Pouch, Rope, Traveler's Clothes, 3 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Shadowmoor Expert",
      "descriptions": [
        {
          "source": "LFL",
          "description": "You are from Shadowmoor or have studied it for years. It's a gloomy, chaotic place perpetually lit by pale moonlight. You might survive Shadowmoor's merciless conditions thanks to your wit and cunning, or you might keep threats at bay with your brawn and bravery. Regardless of where you tread, you keenly understand that friendship is a rare commodity. You believe that knowing who to trust and who to keep at arm's length isn't just practical—it's often a matter of life or death.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Shadowmoor Hexer",
              "source": "LFL",
              "description": "You gain the following benefits. Hex: You always have the Hex spell prepared. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have. Curse Magic: When a creature that you've cursed with Hex hits you with an attack roll, the creature takes Psychic damage equal to your Proficiency. A creature takes this damage only once per turn."
            }
          ],
          "skillProficiencies": [
            "acrobatics",
            "deception"
          ],
          "toolProficiencies": [
            "glassblower's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Glassblower's Tools, Backpack, Hunting Trap, Lamp, Oil (3 flasks), Traveler's Clothes, Waterskin, 8 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Shipwright",
      "descriptions": [
        {
          "source": "GoS",
          "description": "You have sailed into war on the decks of great ships, patching their hulls with soup bowls and prayers. You once helped build a fishing vessel that single-handedly saved a town from starvation. You have seen a majestic prow in your dreams that you have not been able to replicate in wood. Since childhood, you have loved the water and have been captivated by the many vessels that travel on it.",
          "skillProficiencies": [
            "history",
            "perception"
          ],
          "toolProficiencies": [
            "carpenter's tools",
            "vehicles (water)"
          ],
          "equipment": [
            "A set of well-loved carpenter's tools, a blank book, Ink (1-ounce bottle), an ink pen, a set of traveler's clothes, and a leather pouch with 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Silverquill Student",
      "descriptions": [
        {
          "source": "SCC",
          "description": "You have spent years practicing your writing and oration in the hope of becoming a student of Silverquill College. Your studies focus on language, literature, and the power of words, both magical and otherwise. The metaphorical power of words to illuminate or conceal is joined with the literal ability of magic to do the same in your academic pursuits.",
          "feats": [
            {
              "name": "Strixhaven Initiate",
              "source": "SCC",
              "description": "You have studied some magical theory and have learned a few spells associated with Strixhaven University. Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table. You can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "intimidation",
            "persuasion"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), an ink pen, a book of poetry, a school uniform, and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Simic Scientist",
      "descriptions": [
        {
          "source": "GGR",
          "description": "Imagine a perfect world: one in which nature and civilization exist in harmony, adapted to each other; one in which life is shaped to match its environment and the environment is shaped to match life. That's the world you have been trying to grow in the laboratories of the Simic Combine. Nature is all about adaptation, evolution, and balance—but for it to keep up with the pace of advancing civilization, nature needs some help from biomancers and terraformers. If, along the way, you happen to create super-soldiers and mutant monsters that can bolster the combine's defenses against the schemes and ambitions of the other guilds, so much the better.",
          "skillProficiencies": [
            "arcana",
            "medicine"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A Simic insignia, a set of common clothes, a book of research notes, an ink pen, a Ink (1-ounce bottle), a oil (flask) (made from blubber), a acid (vial) (derived from digestive juices), a vial of fish scales, a vial of seaweed, a vial of jellyfish stingers, a glass bottle of unidentified slime, and a belt pouch containing 10 gp (Azorius 1-zino coins)"
          ]
        }
      ]
    },
    {
      "name": "Smuggler",
      "descriptions": [
        {
          "source": "GoS",
          "description": "On a rickety barge, you carried a hundred longswords in fish barrels right past the dock master's oblivious lackeys. You have paddled a riverboat filled with stolen elven wine under the gaze of the moon and sold it for twice its value in the morning. In your more charitable times, you have transported innocents out of war zones or helped guide herd animals to safety on the banks of a burning river.",
          "skillProficiencies": [
            "athletics",
            "deception"
          ],
          "toolProficiencies": [
            "vehicles (water)"
          ],
          "equipment": [
            "A fancy leather vest or a pair of leather boots, a set of common clothes, and a leather pouch with 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Soldier",
      "descriptions": [
        {
          "source": "PHB",
          "description": "War has been your life for as long as you care to remember. You trained as a youth, studied the use of weapons and armor, learned basic survival techniques, including how to stay alive on the battlefield. You might have been part of a standing national army or a mercenary company, or perhaps a member of a local militia who rose to prominence during a recent war.\n\nWhen you choose this background, work with your DM to determine which military organization you were a part of, how far through its ranks you progressed, and what kind of experiences you had during your military career. Was it a standing army, a town guard, or a village militia? Or it might have been a noble's or merchant's private army, or a mercenary company.",
          "skillProficiencies": [
            "athletics",
            "intimidation"
          ],
          "toolProficiencies": [
            "vehicles (land)"
          ],
          "equipment": [
            "An insignia of rank, a trophy taken from a fallen enemy (a dagger, broken blade, or piece of a banner), a bone dice set or playing card set, a set of common clothes, and a belt pouch containing 10 gp"
          ]
        },
        {
          "source": "XPHB",
          "description": "You began training for war as soon as you reached adulthood and carry precious few memories of life before you took up arms. Battle is in your blood. Sometimes you catch yourself reflexively performing the basic fighting exercises you learned first. Eventually, you put that training to use on the battlefield, protecting the realm by waging war.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "con"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "con"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Savage Attacker",
              "source": "XPHB",
              "description": "You've trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target."
            }
          ],
          "skillProficiencies": [
            "athletics",
            "intimidation"
          ],
          "equipment": [
            "Choose A or B: (A) Spear, Shortbow, Arrow, Gaming Set (same as above), Healer's Kit, Quiver, Traveler's Clothes, 14 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Spellfire Initiate",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "You bear the gift of spellfire: a rare form of magic that channels the raw power of the Weave. Wielding spellfire takes a heavy toll on the body. You've trained both mind and body to efficiently wield this sacred power.",
          "abilityBonuses": [
            {
              "from": [
                "con",
                "int",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "con",
                "int",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Spellfire Spark",
              "source": "FRHoF",
              "description": "You gain the following benefits. Magic Absorption: Once per turn, when you take damage from a spell or magical effect, you reduce the total damage taken by 1d4. You can't use this benefit if you have the Incapacitated condition. Spellfire Flame: You learn the Sacred Flame cantrip. Intelligence, Wisdom, or Charisma is your spellcasting ability for this spell (choose when you select this feat). You can also cast this cantrip as a Bonus Action a number of times equal to your Proficiency, and you regain all expended uses when you finish a Long Rest."
            }
          ],
          "skillProficiencies": [
            "arcana",
            "perception"
          ],
          "equipment": [
            "Choose A or B: (A) Gaming Set (same as above), Arcane Focus (Crystal or Wand), 2 Pouch, Traveler's Clothes, 36 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Stojanow Prisoner",
      "descriptions": [
        {
          "source": "ALCurseOfStrahd",
          "description": "Those words still haunt your dreams at night. When everyone was fleeing Phlan, you choose to stay. Whether out of an emotional attachment, or pursuit of riches, you made the decision that would affect the rest of your life.\n\nFood became scarcer for those without connections. You became a beggar and to stay alive you bartered information to any interested party with food or gold to spare. You were good at what you did, and thought you were invincible. That changed when you were captured by the Tears of Virulence, the soldiers of Vorgansharax, the Maimed Virulence, for selling secrets to those bent on overthrowing the dragon. They locked you in the cells of Stojanow Gate. The first weeks you hoped to stay alive. As the weeks turned into months, and the interrogations continued you began to pray for death.",
          "skillProficiencies": [
            "deception",
            "perception"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "A small knife, a set of common clothes, a trinket from the life you stayed behind to defend, a belt pouch with 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Ticklebelly Nomad",
      "descriptions": [
        {
          "source": "ALCurseOfStrahd",
          "description": "You were born into a nomadic tribe that called the Ticklebelly Hills home. You migrated from location to location, living off the land with your tribe. The tribe would seasonally travel south into the Grass Sea and the Giant's Cairn, north into the Dragonspine Mountains, and even occasionally east across the Stojanow River to the borders of the Quivering forest.\n\nIn your migrations, your people have come to know the stone giant tribes that populate the Giant's Cairn. The dragon cultists came to the hills one day—magic-users wearing purple and riding horrid beasts, black-clad warriors wearing wicked masks, and even soldiers from the nearby town of Phlan. Then the dragon called Vorgansharax arrived and laired in the hills, causing horrid thickets to grow and animals to act unusually. The cultists began raiding nomad camps for victims to offer to the wyrm. Eventually, the dragon moved on to attack Phlan, but life was never again the same for the nomads of the Ticklebelly Hills.",
          "skillProficiencies": [
            "animal handling",
            "nature"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "languages": [
            "giant"
          ],
          "equipment": [
            "Herbalism kit, a small article of jewelry that is distinct to your tribe, a hunting trap, a set of common clothes, and a belt pouch containing 5 gp"
          ]
        }
      ]
    },
    {
      "name": "Trade Sheriff",
      "descriptions": [
        {
          "source": "ALRageOfDemons",
          "description": "You are one of the many people that make sure the trade routes are clear at ALL times. You assure that the Great Law of Trade is followed at all costs. You work by yourself or in groups to quell bandits and brigands who might stop trade routes from going through. You investigate potential ambushes and possible rumors as to someone wanting to rob or stop caravans. You are as much an investigator as you are law enforcement. You are able to go into a town/village around the Hillsfar area and find a contact that is willing to give you information from rumor to fact. This sometimes comes at a cost of a minor bribe of 1-9 silver pieces.",
          "skillProficiencies": [
            "investigation",
            "persuasion"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "languages": [
            "elvish"
          ],
          "equipment": [
            "Thieves' tools, a gray cloak, Sheriff's insignia (badge) a set of fine clothes, and 17 gp"
          ]
        }
      ]
    },
    {
      "name": "Urban Bounty Hunter",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "Before you became an adventurer, your life was already full of conflict and excitement, because you made a living tracking down people for pay. Unlike some people who collect bounties, though, you aren't a savage who follows quarry into or through the wilderness. You're involved in a lucrative trade, in the place where you live, that routinely tests your skills and survival instincts. What's more, you aren't alone, as a bounty hunter in the wild would be: you routinely interact with both the criminal subculture and other bounty hunters, maintaining contacts in both areas to help you succeed.\n\nYou might be a cunning thief-catcher, prowling the rooftops to catch one of the myriad burglars of the city. Perhaps you are someone who has your ear to the street, aware of the doings of thieves' guilds and street gangs. You might be a \"velvet mask\" bounty hunter, one who blends in with high society and noble circles in order to catch the criminals that prey on the rich, whether pickpockets or con artists. The community where you plied your trade might have been one of Faerûn's great metropolises, such as Waterdeep or Baldur's Gate, or a less populous location, perhaps Luskan or Yartar—any place that's large enough to have a steady supply of potential quarries.\n\nAs a member of an adventuring party, you might find it more difficult to pursue a personal agenda that doesn't fit with the group's objectives—but on the other hand, you can take down much more formidable targets with the help of your companions.",
          "equipment": [
            "A set of clothes appropriate to your duties and a pouch containing 20 gp"
          ]
        }
      ]
    },
    {
      "name": "Urchin",
      "descriptions": [
        {
          "source": "PHB",
          "description": "You grew up on the streets alone, orphaned, and poor. You had no one to watch over you or to provide for you, so you learned to provide for yourself. You fought fiercely over food and kept a constant watch out for other desperate souls who might steal from you. You slept on rooftops and in alleyways, exposed to the elements, and endured sickness without the advantage of medicine or a place to recuperate. You've survived despite all odds, and did so through cunning, strength, speed, or some combination of each.\n\nYou begin your adventuring career with enough money to live modestly but securely for at least ten days. How did you come by that money? What allowed you to break free of your desperate circumstances and embark on a better life?",
          "skillProficiencies": [
            "sleight of hand",
            "stealth"
          ],
          "toolProficiencies": [
            "disguise kit",
            "thieves' tools"
          ],
          "equipment": [
            "A small knife, a map of the city you grew up in, a pet mouse, a token to remember your parents by, a set of common clothes, and a belt pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Uthgardt Tribe Member",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "Though you might have only recently arrived in civilized lands, you are no stranger to the values of cooperation and group effort when striving for supremacy. You learned these principles, and much more, as a member of an Uthgardt tribe.\n\nYour people have always tried to hold to the old ways. Tradition and taboo have kept the Uthgardt strong while the kingdoms of others have collapsed into chaos and ruin. But for the last few generations, some bands among the tribes were tempted to settle, make peace, trade, and even to build towns. Perhaps this is why Uthgar chose to raise up the totems among the people as living embodiments of his power. Perhaps they needed a reminder of who they were and from whence they came. The Chosen of Uthgar led bands back to the old ways, and most of your people abandoned the soft ways of civilization.\n\nYou might have grown up in one of the tribes that had decided to settle down, and now that they have abandoned that path, you find yourself adrift. Or you might come from a segment of the Uthgardt that adheres to tradition, but you seek to bring glory to your tribe by achieving great things as a formidable adventurer.\n\nSee the \"Uthgardt Lands\" section of chapter 2 for details on each tribe's territory and its activities that will help you choose your affiliation.\n\nThough this section details the Uthgardt specifically, either it or the outlander background from the Player's Handbook can be used for a character whose origin lies with one of the other barbarian tribes in Faerûn.\n\nYou might be a fair-haired barbarian of the Reghed, dwelling in the shadow of the Reghed Glacier in the far North near Icewind Dale. You might also be of the nomadic Rashemi, noted for their savage berserkers and their masked witches. Perhaps you hail from one of the wood elf tribes in the Chondalwood, or the magic-hating human tribes of the sweltering jungles of Chult.",
          "skillProficiencies": [
            "athletics",
            "survival"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A hunting trap, a totemic token or set of tattoos marking your loyalty to Uthgar and your tribal totem, a set of traveler's clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Vampire Devotee",
      "descriptions": [
        {
          "source": "ABH",
          "description": "You were in service to a vampire or a small group of vampires lairing together. The Undead drank your blood more times than you can count. You might have served willingly, perhaps with aspirations of one day becoming a vampire yourself. Or you might have been magically charmed and retain only a few muddled memories of your time as a vampire familiar. In either case, your time in the vampire den is over.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "con",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Vampire's Plaything",
              "source": "ABH",
              "description": "You gain the following benefits. Decanting: When you finish a Long Rest, you can create one Potion of Healing or an Antitoxin, as long as you have an empty vial or flask. These liquids evaporate when you finish another Long Rest. Timely Retreat: You can take a Bonus Action to take the Dash action or the Disengage action. You can use this benefit a number of times equal to your Proficiency, and you recover all expended uses when you finish a Long Rest. Vampiric Connection: The DM determines the fate of your former vampire master. While you and your former vampire master are on the same plane of existence, the vampire can communicate with you telepathically, and you can choose to allow the vampire to perceive through your senses."
            }
          ],
          "skillProficiencies": [
            "persuasion",
            "stealth"
          ],
          "toolProficiencies": [
            "cook's utensils"
          ],
          "equipment": [
            "Choose A or B: (A) Cook's Utensils, Fine Clothes, 2 Glass Bottle, Healer's Kit, Perfume, Lamp, Oil (3 flasks), Waterskin, 19 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Vampire Survivor",
      "descriptions": [
        {
          "source": "ABH",
          "description": "You witnessed or survived a vampire attack. You might have been directly involved in this confrontation, or perhaps you were frozen in terror by what you saw. Regardless, you remain vigilant for monster attacks and pride yourself on being ready for anything. No vampire will catch you or your allies by surprise again.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "con",
                "wis"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "con",
                "wis"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Vampire Hunter",
              "source": "ABH",
              "description": "You gain the following benefits. Adroit Escape: You have Advantage on checks to escape from nonmagical restraints or the Grappled condition. Vitality Ward: When you take Necrotic damage, you can take a Reaction to mitigate the damage. Roll a number of d6s equal to your Proficiency, and add them together. Reduce the Necrotic damage you take by this total. Once you use this benefit, you can't use it again until you finish a Short Rest or Long Rest."
            }
          ],
          "skillProficiencies": [
            "insight",
            "religion"
          ],
          "toolProficiencies": [
            "woodcarver's tools"
          ],
          "equipment": [
            "Choose A or B: (A) Woodcarver's Tools, Crowbar, Hooded Lantern, Holy Symbol (reliquary), Holy Water, Mirror, Oil (3 flasks), Tinderbox, Traveler's Clothes, Waterskin, 4 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Variant City Watch (Investigator)",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "Rarer than watch or patrol members are a community's investigators, who are responsible for solving crimes after the fact. Though such folk are seldom found in rural areas, nearly every settlement of decent size has at least one or two watch members who have the skill to investigate crime scenes and track down criminals. If your prior experience is as an investigator, you have proficiency in Investigation rather than Athletics.",
          "skillProficiencies": [
            "insight",
            "investigation"
          ],
          "languages": [
            "2 of your choice"
          ],
          "equipment": [
            "A uniform in the style of your unit and indicative of your rank, a horn with which to summon help, a set of manacles, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Vizier",
      "descriptions": [
        {
          "source": "PSA",
          "description": "You are a vizier, a servant of your god. You perform tasks that are essential to facilitating the initiates' journey, so the gods reward you with entry into the afterlife with the God-Pharaoh's blessing. You hope to achieve the most honored status in the afterlife by being the best possible servant to your god.\n\nAs a vizier, you can have any class, but you are especially likely to be a cleric, a druid (particularly if you serve Rhonas), or a paladin.",
          "skillProficiencies": [
            "history",
            "religion"
          ],
          "equipment": [
            "A set of artisan's tools or a musical instrument (one of your choice), a scroll of your god's teachings, a vizier's cartouche, a set of fine clothes, and a pouch containing 25 gp"
          ]
        }
      ]
    },
    {
      "name": "Volstrucker Agent",
      "descriptions": [
        {
          "source": "EGW",
          "description": "The Volstrucker are a clandestine organization of arcane assassins and enforcers in the service of the Cerberus Assembly. Their operatives bear no official title, but are referred to in hushed tones as \"scourgers\" by residents of large Dwendalian cities such as Zadash and Rexxentrum.\n\nYou are a Volstrucker agent. Your duty is to silence dissidents who would undermine the will of King Dwendal—and more importantly, the will of the Assembly.\n\nHappy people aren't selected to join the Volstrucker. The Cerberus Assembly preys upon talented individuals who have been broken by tragedy—in some cases, tragedy that the Volstrucker has arranged for. A slightly broken mind is more easily reshaped and reeducated. Choose the tragedy that set you on this path, or roll on the Tragedies table.",
          "skillProficiencies": [
            "deception",
            "stealth"
          ],
          "toolProficiencies": [
            "poisoner's kit"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A set of common clothes, a black cloak with a hood, a poisoner's kit, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Waterdhavian Noble",
      "descriptions": [
        {
          "source": "SCAG",
          "description": "You are a scion of one of the great noble families of Waterdeep. Human families who jealously guard their privilege and place in the City of Splendors, Waterdhavian nobles have a reputation across Faerûn for being eccentric, spoiled, venal, and, above all else, rich.\n\nWhether you are a shining example of the reason for this reputation or one who proves the rule by being an exception, people expect things of you when they know your surname and what it means. Your reasons for taking up adventuring likely involve your family in some way: Are you the family rebel, who prefers delving in filthy dungeons to sipping zzar at a ball? Or have you taken up sword or spell on your family's behalf, ensuring that they have someone of renown to see to their legacy?\n\nWork with your DM to come up with the family you are part of—there are around seventy-five lineages in Waterdeep, each with its own financial interests, specialties, and schemes. You might be part of the main line of your family, possibly in line to become its leader one day. Or you might be one of any number of cousins, with less prestige but also less responsibility.",
          "skillProficiencies": [
            "history",
            "persuasion"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A set of fine clothes, a signet ring or brooch, a scroll of pedigree, a skin of fine zzar or wine, and a purse containing 20 gp"
          ]
        }
      ]
    },
    {
      "name": "Wayfarer",
      "descriptions": [
        {
          "source": "XPHB",
          "description": "You grew up on the streets surrounded by similarly ill-fated castoffs, a few of them friends and a few of them rivals. You slept where you could and did odd jobs for food. At times, when the hunger became unbearable, you resorted to theft. Still, you never lost your pride and never abandoned hope. Fate is not yet finished with you.",
          "abilityBonuses": [
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "dex",
                "wis",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Lucky",
              "source": "XPHB",
              "description": "You gain the following benefits. Luck Points: You have a number of Luck Points equal to your Proficiency and can spend the points on the benefits below. You regain your expended Luck Points when you finish a Long Rest. Advantage: When you roll a d20 for a D20 Test, you can spend 1 Luck Point to give yourself Advantage on the roll. Disadvantage: When a creature rolls a d20 for an attack roll against you, you can spend 1 Luck Point to impose Disadvantage on that roll."
            }
          ],
          "skillProficiencies": [
            "insight",
            "stealth"
          ],
          "toolProficiencies": [
            "thieves' tools"
          ],
          "equipment": [
            "Choose A or B: (A) Dagger, Thieves' Tools, Gaming Set (any), Bedroll, Pouch, Traveler's Clothes, 16 GP; or (B) 50 GP"
          ]
        }
      ]
    },
    {
      "name": "Whitestone Rifle Corps",
      "descriptions": [
        {
          "source": "TDCSR",
          "description": "You trained with the elite forces charged with the defense and protection of the isolated city-state of Whitestone, with much of that training focused on how to care for, protect, and safeguard the firearms that are the weapons of the Whitestone Rifle Corps. You are also entrusted with a solemn duty—to never let the secrets of your liege-lord's deadly creations fall into the wrong hands.\n\nYou might have come to Whitestone to prove yourself worthy of wielding the secretive and highly coveted firearms created there, and to seek instruction from warriors who have mastered those weapons. Or you might have grown up in Whitestone, perhaps even remembering the brutal days when Lord and Lady Briarwood ruled your homeland—a reign that began some thirty years ago and lasted for six harrowing years.\n\nAlternatively, you or your parents might have come to Whitestone as refugees fleeing the destruction of the Chroma Conclave's attack on Tal'Dorei. If so, your life in the city-state might have been a relatively peaceful one, dwelling among the engineers, artisans, and merchants seeking to capitalize upon Whitestone's reputation as an up-and-coming center of trade, culture, and invention.\n\nWhen you choose this background, decide whether you were a member of the Rifle Corps, the Pale Guard, or the Grey Hunters. The \"Whitestone\" section in chapter 3 has more information about the Pale Guard, as well as the armaments and militia in the city-state. See below for more information on the Grey Hunters.",
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "Your choice of a musket or a pistol, a set of common clothes, and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Wildspacer",
      "descriptions": [
        {
          "source": "AAG",
          "description": "You were raised in the void of Wildspace—home to asteroid miners, moon farmers, and other hardy folk. Perhaps you grew up in a far-flung settlement such as the Rock of Bral (described in chapter 3), or you spent your early years on the crew of a spelljamming ship, performing helpful chores such as swabbing the deck, loading and offloading cargo, and scraping barnacles off the hull.\n\nWhatever your history, life in Wildspace has toughened you so well that you are as brave as a Space Hamster when it comes to facing the terrors and other challenges of the airless night.",
          "feats": [
            {
              "name": "Tough",
              "source": "PHB",
              "description": "Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points."
            }
          ],
          "skillProficiencies": [
            "athletics",
            "survival"
          ],
          "toolProficiencies": [
            "navigator's tools",
            "vehicles (space)"
          ],
          "equipment": [
            "A belaying pin (club), a set of traveler's clothes, a grappling hook, Hempen Rope (50 feet), and a pouch containing 10 gp"
          ]
        }
      ]
    },
    {
      "name": "Witchlight Hand",
      "descriptions": [
        {
          "source": "WBtW",
          "description": "You crept into the Witchlight Carnival as a child or youth and never looked back, earning a place among those who work behind the scenes to keep the carnival in business. As a hand, you work hard and party hard. The carnival has borne you to many fantastic worlds, circling back around to your home world once every eight years, but you know almost nothing about these worlds because you spend all your time in the carnival. You know the other hands well, but the carnival's owners—Mister Witch and Mister Light—remain mysterious to you even after all these years.\n\nMaybe you joined the carnival to escape a dismal life at home, or maybe you were enchanted by the idea of visiting new places or the dream of becoming one of the carnival's star attractions. Now that you're older, carnival life has lost some of its appeal. The daily routine has grown tedious, the cyclical nature of the carnival's journey monotonous. The carnival no longer fills your heart with a sense of wonder. Perhaps greater adventures await you beyond the carnival's gates.",
          "skillProficiencies": [
            "performance",
            "sleight of hand"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A disguise kit or a musical instrument of your choice, a deck of cards, a carnival uniform or costume clothes, one trinket (determined by rolling on the Feywild Trinket), and a pouch containing 8 gp"
          ]
        }
      ]
    },
    {
      "name": "Witherbloom Student",
      "descriptions": [
        {
          "source": "SCC",
          "description": "You filled your childhood with rudimentary alchemical experiments, all in the hope of becoming a student of Witherbloom College. The life sciences are the focus of your reading, which include biology and necromancy. Brewing strange concoctions with medicinal properties, exploring the anatomies of monsters, and cataloging swamp flora are the kinds of studies you might pursue at Witherbloom College.",
          "feats": [
            {
              "name": "Strixhaven Initiate",
              "source": "SCC",
              "description": "You have studied some magical theory and have learned a few spells associated with Strixhaven University. Choose one of Strixhaven's colleges: Lorehold, Prismari, Quandrix, Silverquill, or Witherbloom. You learn two cantrips and one 1st-level spell based on the college you choose, as specified in the Strixhaven Spells table. You can cast the chosen 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Your spellcasting ability for this feat's spells is Intelligence, Wisdom, or Charisma (choose when you select this feat)."
            }
          ],
          "skillProficiencies": [
            "nature",
            "survival"
          ],
          "toolProficiencies": [
            "herbalism kit"
          ],
          "languages": [
            "1 of your choice"
          ],
          "equipment": [
            "A Ink (1-ounce bottle), an ink pen, a book about plant identification, an iron pot, an herbalism kit, a school uniform, and a pouch containing 15 gp"
          ]
        }
      ]
    },
    {
      "name": "Zhentarim Mercenary",
      "descriptions": [
        {
          "source": "FRHoF",
          "description": "Maybe you needed the money. Maybe you longed for a family, no matter how dubious. Or maybe you're just good at getting the job done by any means necessary. Whatever your reason, you enlisted with the Zhentarim, the most notorious mercenary guild in the Realms. Though the Zhentarim's leaders insist the organization is more like a family than a shadowy syndicate, few families exhibit as much dishonesty, nepotism, and corruption as this one. You've honed your cunning, reflexes, and blade to climb the guild's ranks.",
          "abilityBonuses": [
            {
              "from": [
                "str",
                "dex",
                "cha"
              ],
              "count": 2,
              "weights": [
                2,
                1
              ]
            },
            {
              "from": [
                "str",
                "dex",
                "cha"
              ],
              "count": 1,
              "weights": [
                1,
                1,
                1
              ]
            }
          ],
          "feats": [
            {
              "name": "Zhentarim Ruffian",
              "source": "FRHoF",
              "description": "You gain the following benefits. Exploit Opening: When you roll damage for an Opportunity Attack, you can roll the damage dice twice and use either roll against the target. Family First: If you have Heroic Inspiration when you roll Initiative, you can expend it to give yourself and your allies Advantage on that Initiative roll."
            }
          ],
          "skillProficiencies": [
            "intimidation",
            "perception"
          ],
          "toolProficiencies": [
            "forgery kit"
          ],
          "equipment": [
            "Choose A or B: (A) Club, Dagger, Forgery Kit, Fine Clothes, Hooded Lantern, Oil (3 flasks), 2 Pouch, String, Tinderbox, 11 GP; or (B) 50 GP"
          ]
        }
      ]
    }
  ]
}
