{
  "detail": {
    "name": "Barbarian",
    "source": "XPHB",
    "description": "Barbarians are mighty warriors who are powered by primal forces of the multiverse that manifest as a Rage. More than a mere emotion—and not limited to anger—this Rage is an incarnation of a predator's ferocity, a storm's fury, and a sea's turmoil.\n\nSome Barbarians personify their Rage as a fierce spirit or revered forebear. Others see it as a connection to the pain and anguish of the world, as an impersonal tangle of wild magic, or as an expression of their own deepest self. For every Barbarian, their Rage is a power that fuels not just battle prowess, but also uncanny reflexes and heightened senses.\n\nBarbarians often serve as protectors and leaders in their communities. They charge headlong into danger so those under their protection don't have to. Their courage in the face of danger makes Barbarians perfectly suited for adventure.",
    "primaryAbility": "Strength",
    "complexity": "Average",
    "hd": {
      "number": 1,
      "faces": 12
    },
    "proficiency": [
      "str",
      "con"
    ],
    "startingProficiencies": {
      "armor": [
        "light",
        "medium",
        "shield"
      ],
      "weapons": [
        "simple",
        "martial"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "animal handling",
              "athletics",
              "intimidation",
              "nature",
              "perception",
              "survival"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Path of the Berserker",
      "Path of the Wild Heart",
      "Path of the World Tree",
      "Path of the Zealot"
    ],
    "features": [
      {
        "name": "Rage",
        "level": 1,
        "entries": [
          "You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.",
          "You can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.",
          "While active, your Rage follows the rules below.",
          "Each time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes."
        ]
      },
      {
        "name": "Unarmored Defense",
        "level": 1,
        "entries": [
          "While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit."
        ]
      },
      {
        "name": "Weapon Mastery",
        "level": 1,
        "entries": [
          "Your training with weapons allows you to use the weapon mastery properties of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxe and Handaxe. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.",
          "When you reach certain Barbarian levels, you gain the ability to use the weapon mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table."
        ]
      },
      {
        "name": "Danger Sense",
        "level": 2,
        "entries": [
          "You gain an uncanny sense of when things aren't as they should be, giving you an edge when you dodge perils. You have Advantage on Dexterity saving throws unless you have the Incapacitated condition."
        ]
      },
      {
        "name": "Reckless Attack",
        "level": 2,
        "entries": [
          "You can throw aside all concern for defense to attack with increased ferocity. When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time."
        ]
      },
      {
        "name": "Barbarian Subclass",
        "level": 3,
        "entries": [
          "You gain a Barbarian subclass of your choice. A subclass is a specialization that grants you features at certain Barbarian levels. For the rest of your career, you gain each of your subclass's features that are of your Barbarian level or lower."
        ]
      },
      {
        "name": "Primal Knowledge",
        "level": 3,
        "entries": [
          "You gain proficiency in another skill of your choice from the skill list available to Barbarians at level 1.",
          "In addition, while your Rage is active, you can channel primal power when you attempt certain tasks; whenever you make an ability check using one of the following skills, you can make it as a Strength check even if it normally uses a different ability: Acrobatics, Intimidation, Perception, Stealth, or Survival. When you use this ability, your Strength represents primal power coursing through you, honing your agility, bearing, and senses."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16."
        ]
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "entries": [
          "You can attack twice instead of once whenever you take the Attack action on your turn."
        ]
      },
      {
        "name": "Fast Movement",
        "level": 5,
        "entries": [
          "Your speed increases by 10 feet while you aren't wearing Heavy armor."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Barbarian subclass."
        ]
      },
      {
        "name": "Feral Instinct",
        "level": 7,
        "entries": [
          "Your instincts are so honed that you have Advantage on Initiative rolls."
        ]
      },
      {
        "name": "Instinctive Pounce",
        "level": 7,
        "entries": [
          "As part of the Bonus Action you take to enter your Rage, you can move up to half your Speed."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Brutal Strike",
        "level": 9,
        "entries": [
          "If you use Reckless Attack, you can forgo any Advantage on one Strength-based attack roll of your choice on your turn. The chosen attack roll mustn't have Disadvantage. If the chosen attack roll hits, the target takes an extra 1d10 damage of the same type dealt by the weapon or Unarmed Strike, and you can cause one Brutal Strike effect of your choice. You have the following effect options."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 10,
        "entries": [
          "You gain a feature from your Barbarian subclass."
        ]
      },
      {
        "name": "Relentless Rage",
        "level": 11,
        "entries": [
          "Your Rage can keep you fighting despite grievous wounds. If you drop to 0 Hit Points while your Rage is active and don't die outright, you can make a 10 Constitution saving throw. If you succeed, your Hit Points instead change to a number equal to twice your Barbarian level.",
          "Each time you use this feature after the first, the DC increases by 5. When you finish a Short Rest or Long Rest, the DC resets to 10."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Improved Brutal Strike",
        "level": 13,
        "entries": [
          "You have honed new ways to attack furiously. The following effects are now among your Brutal Strike options."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 14,
        "entries": [
          "You gain a feature from your Barbarian subclass."
        ]
      },
      {
        "name": "Persistent Rage",
        "level": 15,
        "entries": [
          "When you roll Initiative, you can regain all expended uses of Rage. After you regain uses of Rage in this way, you can't do so again until you finish a Long Rest.",
          "In addition, your Rage is so fierce that it now lasts for 10 minutes without you needing to do anything to extend it from round to round. Your Rage ends early if you have the Unconscious condition (not just the Incapacitated condition) or don Heavy armor."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Improved Brutal Strike",
        "level": 17,
        "entries": [
          "The extra damage of your Brutal Strike increases to 2d10. In addition, you can use two different Brutal Strike effects whenever you use your Brutal Strike feature."
        ]
      },
      {
        "name": "Indomitable Might",
        "level": 18,
        "entries": [
          "If your total for a Strength check or Strength saving throw is less than your Strength score, you can use that score in place of the total."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Irresistible Offense is recommended."
        ]
      },
      {
        "name": "Primal Champion",
        "level": 20,
        "entries": [
          "You embody primal power. Your Strength and Constitution scores increase by 4, to a maximum of 25."
        ]
      }
    ]
  },
  "subclasses": {
    "path of the berserker": {
      "name": "Path of the Berserker",
      "source": "XPHB",
      "className": "Barbarian",
      "description": "Channel Rage into Violent Fury\n\nBarbarians who walk the Path of the Berserker direct their Rage primarily toward violence. Their path is one of untrammeled fury, and they thrill in the chaos of battle as they allow their Rage to seize and empower them.",
      "features": [
        {
          "name": "Frenzy",
          "level": 3,
          "entries": [
            "If you use Reckless Attack while your Rage is active, you deal extra damage to the first target you hit on your turn with a Strength-based attack. To determine the extra damage, roll a number of d6s equal to your Rage Damage bonus, and add them together. The damage has the same type as the weapon or Unarmed Strike used for the attack."
          ]
        },
        {
          "name": "Mindless Rage",
          "level": 6,
          "entries": [
            "You have Immunity to the Charmed and Frightened conditions while your Rage is active. If you're Charmed or Frightened when you enter your Rage, the condition ends on you."
          ]
        },
        {
          "name": "Retaliation",
          "level": 10,
          "entries": [
            "When you take damage from a creature that is within 5 feet of you, you can take a Reaction to make one melee attack against that creature, using a weapon or an Unarmed Strike."
          ]
        },
        {
          "name": "Intimidating Presence",
          "level": 14,
          "entries": [
            "As a Bonus Action, you can strike terror into others with your menacing presence and primal power. When you do so, each creature of your choice in a 30-foot Emanation [Area of Effect] originating from you must make a Wisdom saving throw (8 plus your Strength modifier and Proficiency). On a failed save, a creature has the Frightened condition for 1 minute. At the end of each of the Frightened creature's turns, the creature repeats the save, ending the effect on itself on a success.",
            "Once you use this feature, you can't use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it."
          ]
        }
      ]
    },
    "path of the wild heart": {
      "name": "Path of the Wild Heart",
      "source": "XPHB",
      "className": "Barbarian",
      "description": "Walk in Community with the Animal World\n\nBarbarians who follow the Path of the Wild Heart view themselves as kin to animals. These Barbarians learn magical means to communicate with animals, and their Rage heightens their connection to animals as it fills them with supernatural might.",
      "features": [
        {
          "name": "Animal Speaker",
          "level": 3,
          "entries": [
            "You can cast the Beast Sense and Speak with Animals spells but only as Rituals. Wisdom is your spellcasting ability for them."
          ]
        },
        {
          "name": "Rage of the Wilds",
          "level": 3,
          "entries": [
            "Your Rage taps into the primal power of animals. Whenever you activate your Rage, you gain one of the following options of your choice."
          ]
        },
        {
          "name": "Aspect of the Wilds",
          "level": 6,
          "entries": [
            "You gain one of the following options of your choice. Whenever you finish a Long Rest, you can change your choice."
          ]
        },
        {
          "name": "Nature Speaker",
          "level": 10,
          "entries": [
            "You can cast the Commune with Nature spell but only as a Ritual. Wisdom is your spellcasting ability for it."
          ]
        },
        {
          "name": "Power of the Wilds",
          "level": 14,
          "entries": [
            "Whenever you activate your Rage, you gain one of the following options of your choice."
          ]
        }
      ]
    },
    "path of the world tree": {
      "name": "Path of the World Tree",
      "source": "XPHB",
      "className": "Barbarian",
      "description": "Trace the Roots and Branches of the Multiverse\n\nBarbarians who follow the Path of the World Tree connect with the cosmic tree Yggdrasil through their Rage. This tree grows among the Outer Planes, connecting them to each other and the Material Plane. These Barbarians draw on the tree's magic for vitality and as a means of dimensional travel.",
      "features": [
        {
          "name": "Vitality of the Tree",
          "level": 3,
          "entries": [
            "Your Rage taps into the life force of the World Tree. You gain the following benefits."
          ]
        },
        {
          "name": "Branches of the Tree",
          "level": 6,
          "entries": [
            "Whenever a creature you can see starts its turn within 30 feet of you while your Rage is active, you can take a Reaction to summon spectral branches of the World Tree around it. The target must succeed on a Strength saving throw (8 plus your Strength modifier and Proficiency) or be teleported to an unoccupied space you can see within 5 feet of yourself or in the nearest unoccupied space you can see. After the target teleports, you can reduce its Speed to 0 until the end of the current turn."
          ]
        },
        {
          "name": "Battering Roots",
          "level": 10,
          "entries": [
            "During your turn, your reach is 10 feet greater with any Melee weapon that has the Heavy or Versatile property, as tendrils of the World Tree extend from you. When you hit with such a weapon on your turn, you can activate the Push or Topple mastery property in addition to a different mastery property you're using with that weapon."
          ]
        },
        {
          "name": "Travel Along the Tree",
          "level": 14,
          "entries": [
            "When you activate your Rage and as a Bonus Action while your Rage is active, you can teleport up to 60 feet to an unoccupied space you can see.",
            "In addition, once per Rage, you can increase the range of that teleport to 150 feet. When you do so, you can also bring up to six willing creatures who are within 10 feet of you. Each creature teleports to an unoccupied space of your choice within 10 feet of your destination space."
          ]
        }
      ]
    },
    "path of the zealot": {
      "name": "Path of the Zealot",
      "source": "XPHB",
      "className": "Barbarian",
      "description": "Rage in Ecstatic Union with a God\n\nBarbarians who walk the Path of the Zealot receive boons from a god or pantheon. These Barbarians experience their Rage as an ecstatic episode of divine union that infuses them with power. They are often allies to the priests and other followers of their god or pantheon.",
      "features": [
        {
          "name": "Divine Fury",
          "level": 3,
          "entries": [
            "You can channel divine power into your strikes. On each of your turns while your Rage is active, the first creature you hit with a weapon or an Unarmed Strike takes extra damage equal to 1d6 plus half your Barbarian level (round down). The extra damage is Necrotic or Radiant; you choose the type each time you deal the damage."
          ]
        },
        {
          "name": "Warrior of the Gods",
          "level": 3,
          "entries": [
            "A divine entity helps ensure you can continue the fight. You have a pool of four d12s that you can spend to heal yourself. As a Bonus Action, you can expend dice from the pool, roll them, and regain a number of Hit Points equal to the roll's total.",
            "Your pool regains all expended dice when you finish a Long Rest.",
            "The pool's maximum number of dice increases by one when you reach Barbarian levels 6 (5 dice), 12 (6 dice), and 17 (7 dice)."
          ]
        },
        {
          "name": "Fanatical Focus",
          "level": 6,
          "entries": [
            "Once per active Rage, if you fail a saving throw, you can reroll it with a bonus equal to your Rage Damage bonus, and you must use the new roll."
          ]
        },
        {
          "name": "Zealous Presence",
          "level": 10,
          "entries": [
            "As a Bonus Action, you unleash a battle cry infused with divine energy. Up to ten other creatures of your choice within 60 feet of you gain Advantage on attack rolls and saving throws until the start of your next turn.",
            "Once you use this feature, you can't use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Rage of the Gods",
          "level": 14,
          "entries": [
            "When you activate your Rage, you can assume the form of a divine warrior. This form lasts for 1 minute or until you drop to 0 Hit Points. Once you use this feature, you can't do so again until you finish a Long Rest.",
            "While in this form, you gain the benefits below."
          ]
        }
      ]
    }
  }
}
