{
  "detail": {
    "name": "Cleric",
    "source": "XPHB",
    "description": "Clerics draw power from the realms of the gods and harness it to work miracles. Blessed by a deity, a pantheon, or another immortal entity, a Cleric can reach out to the divine magic of the Outer Planes—where gods dwell—and channel it to bolster people and battle foes.\n\nBecause their power is a divine gift, Clerics typically associate themselves with temples dedicated to the deity or other immortal force that unlocked their magic. Harnessing divine magic doesn't rely on specific training, yet Clerics might learn prayers and rites that help them draw on power from the Outer Planes.\n\nNot every member of a temple or shrine is a Cleric. Some priests are called to a simple life of temple service, carrying out their devotion through prayer and rituals, not through magic. Many mortals claim to speak for the gods, but few can marshal the power of those gods the way a Cleric can.",
    "primaryAbility": "Wisdom",
    "complexity": "Average",
    "hd": {
      "number": 1,
      "faces": 8
    },
    "proficiency": [
      "wis",
      "cha"
    ],
    "startingProficiencies": {
      "armor": [
        "light",
        "medium",
        "shield"
      ],
      "weapons": [
        "simple"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "history",
              "insight",
              "medicine",
              "persuasion",
              "religion"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Life Domain",
      "Light Domain",
      "Trickery Domain",
      "War Domain"
    ],
    "features": [
      {
        "name": "Divine Order",
        "level": 1,
        "entries": [
          "You have dedicated yourself to one of the following sacred roles of your choice."
        ]
      },
      {
        "name": "Protector",
        "level": 1,
        "entries": [
          "Trained for battle, you gain proficiency with Martial weapons and training with Heavy armor."
        ]
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "entries": [
          "You have learned to cast spells through prayer and meditation. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Cleric spells, which appear on the Cleric spell list later in the class's description."
        ]
      },
      {
        "name": "Thaumaturge",
        "level": 1,
        "entries": [
          "You know one extra cantrip from the Cleric spell list. In addition, your mystical connection to the divine gives you a bonus to your Intelligence (Arcana or Religion) checks. The bonus equals your Wisdom modifier (minimum of +1)."
        ]
      },
      {
        "name": "Channel Divinity",
        "level": 2,
        "entries": [
          "You can channel divine energy directly from the Outer Planes to fuel magical effects. You start with two such effects: Divine Spark and Turn Undead, each of which is described below. Each time you use this class's Channel Divinity, choose which Channel Divinity effect from this class to create. You gain additional effect options at higher Cleric levels.",
          "You can use this class's Channel Divinity twice. You regain one of its expended uses when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest. You gain additional uses when you reach certain Cleric levels, as shown in the Channel Divinity column of the Cleric Features table.",
          "If a Channel Divinity effect requires a saving throw, the DC equals the spell save DC from this class's Spellcasting feature."
        ]
      },
      {
        "name": "Divine Spark",
        "level": 2,
        "entries": [
          "As a Magic action, you point your Holy Symbol at another creature you can see within 30 feet of yourself and focus divine energy at it. Roll 1d8 and add your Wisdom modifier. You either restore Hit Points to the creature equal to that total or force the creature to make a Constitution saving throw. On a failed save, the creature takes Necrotic or Radiant damage (your choice) equal to that total. On a successful save, the creature takes half as much damage (round down).",
          "You roll an additional d8 when you reach Cleric levels 7 (2d8), 13 (3d8), and 18 (4d8)."
        ]
      },
      {
        "name": "Turn Undead",
        "level": 2,
        "entries": [
          "As a Magic action, you present your Holy Symbol and censure Undead creatures. Each Undead of your choice within 30 feet of you must make a Wisdom saving throw. If the creature fails its save, it has the Frightened and Incapacitated conditions for 1 minute. For that duration, it tries to move as far from you as it can on its turns. This effect ends early on the creature if it takes any damage, if you have the Incapacitated condition, or if you die."
        ]
      },
      {
        "name": "Cleric Subclass",
        "level": 3,
        "entries": [
          "You gain a Cleric subclass of your choice. A subclass is a specialization that grants you features at certain Cleric levels. For the rest of your career, you gain each of your subclass's features that are of your Cleric level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Cleric levels 8, 12, and 16."
        ]
      },
      {
        "name": "Sear Undead",
        "level": 5,
        "entries": [
          "Whenever you use Turn Undead, you can roll a number of d8s equal to your Wisdom modifier (minimum of 1d8) and add the rolls together. Each Undead that fails its saving throw against that use of Turn Undead takes Radiant damage equal to the roll's total. This damage doesn't end the turn effect."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Cleric Subclass."
        ]
      },
      {
        "name": "Blessed Strikes",
        "level": 7,
        "entries": [
          "Divine power infuses you in battle. You gain one of the following options of your choice (if you get either option from a Cleric subclass in an older book, use only the option you choose for this feature)."
        ]
      },
      {
        "name": "Divine Strike",
        "level": 7,
        "entries": [
          "Once on each of your turns when you hit a creature with an attack roll using a weapon, you can cause the target to take an extra 1d8 Necrotic or Radiant damage (your choice)."
        ]
      },
      {
        "name": "Potent Spellcasting",
        "level": 7,
        "entries": [
          "Add your Wisdom modifier to the damage you deal with any Cleric cantrip."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Divine Intervention",
        "level": 10,
        "entries": [
          "You can call on your deity or pantheon to intervene on your behalf. As a Magic action, choose any Cleric spell of level 5 or lower that doesn't require a Reaction to cast. As part of the same action, you cast that spell without expending a spell slot or needing Material components. You can't use this feature again until you finish a Long Rest."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Improved Blessed Strikes",
        "level": 14,
        "entries": [
          "The option you chose for Blessed Strikes grows more powerful."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 17,
        "entries": [
          "You gain a feature from your Cleric Subclass."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Fate is recommended."
        ]
      },
      {
        "name": "Greater Divine Intervention",
        "level": 20,
        "entries": [
          "You can call on even more powerful divine intervention. When you use your Divine Intervention feature, you can choose Wish when you select a spell. If you do so, you can't use Divine Intervention again until you finish 2d4 Long Rests."
        ]
      }
    ]
  },
  "subclasses": {
    "life domain": {
      "name": "Life Domain",
      "source": "XPHB",
      "className": "Cleric",
      "description": "Soothe the Hurts of the World\n\nThe Life Domain focuses on the positive energy that helps sustain all life in the multiverse. Clerics who tap into this domain are masters of healing, using that life force to cure many hurts.\n\nExistence itself relies on the positive energy associated with this domain, so a Cleric of almost any religious tradition might choose it. This domain is particularly associated with agricultural deities, gods of healing or endurance, and gods of home and community. Religious orders of healing also seek the magic of this domain.",
      "features": [
        {
          "name": "Disciple of Life",
          "level": 3,
          "entries": [
            "When a spell you cast with a spell slot restores Hit Points to a creature, that creature regains additional Hit Points on the turn you cast the spell. The additional Hit Points equal 2 plus the spell slot's level."
          ]
        },
        {
          "name": "Life Domain Spells",
          "level": 3,
          "entries": [
            "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Life Domain Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Preserve Life",
          "level": 3,
          "entries": [
            "As a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to evoke healing energy that can restore a number of Hit Points equal to five times your Cleric level. Choose Bloodied creatures within 30 feet of yourself (which can include you), and divide those Hit Points among them. This feature can restore a creature to no more than half its Hit Points maximum."
          ]
        },
        {
          "name": "Blessed Healer",
          "level": 6,
          "entries": [
            "The healing spells you cast on others heal you as well. Immediately after you cast a spell with a spell slot that restores Hit Points to one creature other than you, you regain Hit Points equal to 2 plus the spell slot's level."
          ]
        },
        {
          "name": "Supreme Healing",
          "level": 17,
          "entries": [
            "When you would normally roll one or more dice to restore Hit Points to a creature with a spell or Channel Divinity, don't roll those dice for the healing; instead use the highest number possible for each die. For example, instead of restoring 2d6 Hit Points to a creature with a spell, you restore 12."
          ]
        }
      ]
    },
    "light domain": {
      "name": "Light Domain",
      "source": "XPHB",
      "className": "Cleric",
      "description": "Bring Light to Banish Darkness\n\nThe Light Domain emphasizes the divine power to bring about blazing fire and revelation. Clerics who wield this power are enlightened souls infused with radiance and the power of their deities' discerning vision, charged with chasing away lies and burning away darkness.\n\nThe Light Domain is associated with gods of truth, vigilance, beauty, insight, and renewal. Some of these gods are identified with the sun or as charioteers who guide the sun across the sky. Others are sentinels who pierce deception. Some are deities of beauty and artistry who teach that art is a vehicle for the soul's improvement.",
      "features": [
        {
          "name": "Light Domain Spells",
          "level": 3,
          "entries": [
            "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Light Domain Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Radiance of the Dawn",
          "level": 3,
          "entries": [
            "As a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to emit a flash of light in a 30-foot Emanation [Area of Effect] originating from yourself. Any magical Darkness—such as that created by the Darkness spell—in that area is dispelled. Additionally, each creature of your choice in that area must make a Constitution saving throw, taking Radiant damage equal to 2d10 plus your Cleric level on a failed save or half as much damage on a successful one."
          ]
        },
        {
          "name": "Warding Flare",
          "level": 3,
          "entries": [
            "When a creature that you can see within 30 feet of yourself makes an attack roll, you can take a Reaction to impose Disadvantage on the attack roll, causing light to flare before it hits or misses.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Improved Warding Flare",
          "level": 6,
          "entries": [
            "You regain all expended uses of your Warding Flare when you finish a Short Rest or Long Rest.",
            "In addition, whenever you use Warding Flare, you can give the target of the triggering attack a number of Temporary Hit Points equal to 2d6 plus your Wisdom modifier."
          ]
        },
        {
          "name": "Corona of Light",
          "level": 17,
          "entries": [
            "As a Magic action, you cause yourself to emit an aura of sunlight that lasts for 1 minute or until you dismiss it (no action required). You emit Bright Light in a 60-foot radius and Dim Light for an additional 30 feet. Your enemies in the Bright Light have Disadvantage on saving throws against your Radiance of the Dawn and any spell that deals Fire or Radiant damage.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
          ]
        }
      ]
    },
    "trickery domain": {
      "name": "Trickery Domain",
      "source": "XPHB",
      "className": "Cleric",
      "description": "Make Mischief and Challenge Authority\n\nThe Trickery Domain offers magic of deception, illusion, and stealth. Clerics who wield this magic are a disruptive force in the world, puncturing pride, mocking tyrants, freeing captives, and flouting hollow traditions. They prefer subterfuge and pranks to direct confrontation.\n\nGods of trickery are mischief-makers and instigators who stand as a constant challenge to the accepted order among both gods and mortals. They embody the forces of change and social upheaval, and they're patrons of thieves, scoundrels, gamblers, rebels, and liberators. Religious orders that operate in secret, especially those that seek to undermine oppressive governments or hierarchies, also draw on the power of the Trickery Domain.",
      "features": [
        {
          "name": "Blessing of the Trickster",
          "level": 3,
          "entries": [
            "As a Magic action, you can choose yourself or a willing creature within 30 feet of yourself to have Advantage on Dexterity (Stealth) checks. This blessing lasts until you finish a Long Rest or you use this feature again."
          ]
        },
        {
          "name": "Invoke Duplicity",
          "level": 3,
          "entries": [
            "As a Bonus Action, you can expend one use of your Channel Divinity to create a perfect visual illusion of yourself in an unoccupied space you can see within 30 feet of yourself. The illusion is intangible and doesn't occupy its space. It lasts for 1 minute, but it ends early if you dismiss it (no action required) or have the Incapacitated condition. The illusion is animated and mimics your expressions and gestures. While it persists, you gain the following benefits."
          ]
        },
        {
          "name": "Trickery Domain Spells",
          "level": 3,
          "entries": [
            "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the Trickery Domain Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Trickster's Transposition",
          "level": 6,
          "entries": [
            "Whenever you take the Bonus Action to create or move the illusion of your Invoke Duplicity, you can teleport, swapping places with the illusion."
          ]
        },
        {
          "name": "Improved Duplicity",
          "level": 17,
          "entries": [
            "The illusion of your Invoke Duplicity has grown more powerful in the following ways."
          ]
        }
      ]
    },
    "war domain": {
      "name": "War Domain",
      "source": "XPHB",
      "className": "Cleric",
      "description": "Inspire Valor and Smite Foes\n\nWar has many manifestations. It can make heroes of ordinary people. It can be desperate and horrific, with acts of cruelty and cowardice eclipsing instances of excellence and courage. Clerics who tap into the magic of the War Domain excel in battle, inspiring others to fight the good fight or offering acts of violence as prayers.\n\nGods of the War Domain watch over warriors and reward them for their great deeds. They include champions of honor and chivalry as well as gods of destruction and pillage. Other war gods take a more neutral stance, promoting war in all its manifestations and supporting warriors in any circumstance.",
      "features": [
        {
          "name": "Guided Strike",
          "level": 3,
          "entries": [
            "When you or a creature within 30 feet of you misses with an attack roll, you can expend one use of your Channel Divinity and give that roll a +10 bonus, potentially causing it to hit. When you use this feature to benefit another creature's attack roll, you must take a Reaction to do so."
          ]
        },
        {
          "name": "War Domain Spells",
          "level": 3,
          "entries": [
            "Your connection to this divine domain ensures you always have certain spells ready. When you reach a Cleric level specified in the War Domain Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "War Priest",
          "level": 3,
          "entries": [
            "As a Bonus Action, you can make one attack with a weapon or an Unarmed Strike. You can use this Bonus Action a number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Short Rest or Long Rest."
          ]
        },
        {
          "name": "War God's Blessing",
          "level": 6,
          "entries": [
            "You can expend a use of your Channel Divinity to cast Shield of Faith or Spiritual Weapon rather than expending a spell slot. When you cast either spell in this way, the spell doesn't require Concentration. Instead the spell lasts for 1 minute, but it ends early if you cast that spell again, have the Incapacitated condition, or die."
          ]
        },
        {
          "name": "Avatar of Battle",
          "level": 17,
          "entries": [
            "You gain Resistance to Bludgeoning, Piercing, and Slashing damage."
          ]
        }
      ]
    }
  }
}
