{
  "detail": {
    "name": "Druid",
    "source": "XPHB",
    "description": "Druids belong to ancient orders that call on the forces of nature. Harnessing the magic of animals, plants, and the four elements, Druids heal, transform into animals, and wield elemental destruction.\n\nRevering nature above all, individual Druids gain their magic from nature, a nature deity, or both, and they typically unite with other Druids to perform rites that mark the passage of the seasons and other natural cycles.\n\nDruids are concerned with the delicate ecological balance that sustains plant and animal life and with the need for people to live in harmony with nature. Druids often guard sacred sites or watch over regions of unspoiled nature, but when a significant danger arises, Druids take a more active role as adventurers who combat the threat.",
    "primaryAbility": "Wisdom",
    "complexity": "High",
    "hd": {
      "number": 1,
      "faces": 8
    },
    "proficiency": [
      "int",
      "wis"
    ],
    "startingProficiencies": {
      "armor": [
        "light",
        "shield"
      ],
      "weapons": [
        "simple"
      ],
      "tools": [
        "Herbalism Kit"
      ],
      "toolProficiencies": [
        {
          "herbalism kit": true
        }
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "arcana",
              "animal handling",
              "insight",
              "medicine",
              "nature",
              "perception",
              "religion",
              "survival"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Circle of the Land",
      "Circle of the Moon",
      "Circle of the Sea",
      "Circle of the Stars"
    ],
    "features": [
      {
        "name": "Druidic",
        "level": 1,
        "entries": [
          "You know Druidic, the secret language of Druids. While learning this ancient tongue, you also unlocked the magic of communicating with animals; you always have the Speak with Animals spell prepared.",
          "You can use Druidic to leave hidden messages. You and others who know Druidic automatically spot such a message. Others spot the message's presence with a successful 15 Intelligence (Investigation) check but can't decipher it without magic."
        ]
      },
      {
        "name": "Magician",
        "level": 1,
        "entries": [
          "You know one extra cantrip from the Druid spell list. In addition, your mystical connection to nature gives you a bonus to your Intelligence (Arcana or Nature) checks. The bonus equals your Wisdom modifier (minimum bonus of +1)."
        ]
      },
      {
        "name": "Primal Order",
        "level": 1,
        "entries": [
          "You have dedicated yourself to one of the following sacred roles of your choice."
        ]
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "entries": [
          "You have learned to cast spells through studying the mystical forces of nature. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Druid spells, which appear on the Druid spell list later in the class's description."
        ]
      },
      {
        "name": "Warden",
        "level": 1,
        "entries": [
          "Trained for battle, you gain proficiency with Martial weapons and training with Medium armor."
        ]
      },
      {
        "name": "Wild Companion",
        "level": 2,
        "entries": [
          "You can summon a nature spirit that assumes an animal form to aid you. As a Magic action, you can expend a spell slot or a use of Wild Shape to cast the Find Familiar spell without Material components.",
          "When you cast the spell in this way, the familiar is Fey and disappears when you finish a Long Rest."
        ]
      },
      {
        "name": "Wild Shape",
        "level": 2,
        "entries": [
          "The power of nature allows you to assume the form of an animal. As a Bonus Action, you shape-shift into a Beast form that you have learned for this feature (see \"Known Forms\" below). You stay in that form for a number of hours equal to half your Druid level or until you use Wild Shape again, have the Incapacitated condition, or die. You can also leave the form early as a Bonus Action."
        ]
      },
      {
        "name": "Druid Subclass",
        "level": 3,
        "entries": [
          "You gain a Druid subclass of your choice. A subclass is a specialization that grants you features at certain Druid levels. For the rest of your career, you gain each of your subclass's features that are of your Druid level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Druid levels 8, 12, and 16."
        ]
      },
      {
        "name": "Wild Resurgence",
        "level": 5,
        "entries": [
          "Once on each of your turns, if you have no uses of Wild Shape left, you can give yourself one use by expending a spell slot (no action required).",
          "In addition, you can expend one use of Wild Shape (no action required) to give yourself a level 1 spell slot, but you can't do so again until you finish a Long Rest."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Druid Subclass."
        ]
      },
      {
        "name": "Elemental Fury",
        "level": 7,
        "entries": [
          "The might of the elements flows through you. You gain one of the following options of your choice."
        ]
      },
      {
        "name": "Potent Spellcasting",
        "level": 7,
        "entries": [
          "Add your Wisdom modifier to the damage you deal with any Druid cantrip."
        ]
      },
      {
        "name": "Primal Strike",
        "level": 7,
        "entries": [
          "Once on each of your turns when you hit a creature with an attack roll using a weapon or a Beast form's attack in Wild Shape, you can cause the target to take an extra 1d8 Cold, Fire, Lightning, or Thunder damage (choose when you hit)."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 10,
        "entries": [
          "You gain a feature from your Druid Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 14,
        "entries": [
          "You gain a feature from your Druid Subclass."
        ]
      },
      {
        "name": "Improved Elemental Fury",
        "level": 15,
        "entries": [
          "The option you chose for Elemental Fury grows more powerful, as detailed below."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Beast Spells",
        "level": 18,
        "entries": [
          "While using Wild Shape, you can cast spells in Beast form, except for any spell that has a Material component with a cost specified or that consumes its Material component."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
        ]
      },
      {
        "name": "Archdruid",
        "level": 20,
        "entries": [
          "The vitality of nature constantly blooms within you, granting you the following benefits."
        ]
      }
    ]
  },
  "subclasses": {
    "circle of the land": {
      "name": "Circle of the Land",
      "source": "XPHB",
      "className": "Druid",
      "description": "Celebrate Connection to the Natural World\n\nThe Circle of the Land comprises mystics and sages who safeguard ancient knowledge and rites. These Druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle's wisest members preside as the chief priests of their communities.",
      "features": [
        {
          "name": "Circle of the Land Spells",
          "level": 3,
          "entries": [
            "Whenever you finish a Long Rest, choose one type of land: arid, polar, temperate, or tropical. Consult the table below that corresponds to the chosen type; you have the spells listed for your Druid level and lower prepared."
          ]
        },
        {
          "name": "Land's Aid",
          "level": 3,
          "entries": [
            "As a Magic action, you can expend a use of your Wild Shape and choose a point within 60 feet of yourself. Vitality-giving flowers and life-draining thorns appear for a moment in a 10-foot-radius Sphere [Area of Effect] centered on that point. Each creature of your choice in the Sphere [Area of Effect] must make a Constitution saving throw against your spell save DC, taking 2d6 Necrotic damage on a failed save or half as much damage on a successful one. One creature of your choice in that area regains 2d6 Hit Points.",
            "The damage and healing increase by 1d6 when you reach Druid levels 10 (3d6) and 14 (4d6)."
          ]
        },
        {
          "name": "Natural Recovery",
          "level": 6,
          "entries": [
            "You can cast one of the level 1+ spells that you have prepared from your Circle Spells feature without expending a spell slot, and you must finish a Long Rest before you do so again.",
            "In addition, when you finish a Short Rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your Druid level (round up), and none of them can be level 6+. For example, if you're a level 6 Druid, you can recover up to three levels' worth of spell slots. You can recover a level 3 spell slot, a level 2 and a level 1 spell slot, or three level 1 spell slots. Once you recover spell slots with this feature, you can't do so again until you finish a Long Rest."
          ]
        },
        {
          "name": "Nature's Ward",
          "level": 10,
          "entries": [
            "You are immune to the Poisoned condition, and you have Resistance to a damage type associated with your current land choice in the Circle Spells feature, as shown in the Nature's Ward table."
          ]
        },
        {
          "name": "Nature's Sanctuary",
          "level": 14,
          "entries": [
            "As a Magic action, you can expend a use of your Wild Shape and cause spectral trees and vines to appear in a 15-foot Cube [Area of Effect] on the ground within 120 feet of yourself. They last there for 1 minute or until you have the Incapacitated condition or die. You and your allies have Cover while in that area, and your allies gain the current Resistance of your Nature's Ward while there.",
            "As a Bonus Action, you can move the Cube [Area of Effect] up to 60 feet to ground within 120 feet of yourself."
          ]
        }
      ]
    },
    "circle of the moon": {
      "name": "Circle of the Moon",
      "source": "XPHB",
      "className": "Druid",
      "description": "Adopt Animal Forms to Guard the Wilds\n\nDruids of the Circle of the Moon draw on lunar magic to transform themselves. Their order gathers under the moon to share news and perform rituals.\n\nChangeable as the moon, a Druid of this circle might prowl as a great cat one night, soar over the treetops as an eagle the next day, and then crash through undergrowth as a bear to drive off a trespassing monster. The wild is in the Druid's blood.",
      "features": [
        {
          "name": "Circle Forms",
          "level": 3,
          "entries": [
            "You can channel lunar magic when you assume a Wild Shape form, granting you the benefits below."
          ]
        },
        {
          "name": "Circle of the Moon Spells",
          "level": 3,
          "entries": [
            "When you reach a Druid level specified in the Circle of the Moon Spells table, you thereafter always have the listed spells prepared.",
            "In addition, you can cast the spells from this feature while you're in a Wild Shape form."
          ]
        },
        {
          "name": "Improved Circle Forms",
          "level": 6,
          "entries": [
            "While in a Wild Shape form, you gain the following benefits."
          ]
        },
        {
          "name": "Moonlight Step",
          "level": 10,
          "entries": [
            "You magically transport yourself, reappearing amid a burst of moonlight. As a Bonus Action, you teleport up to 30 feet to an unoccupied space you can see, and you have Advantage on the next attack roll you make before the end of this turn.",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest. You can also regain uses by expending a level 2+ spell slot for each use you want to restore (no action required)."
          ]
        },
        {
          "name": "Lunar Form",
          "level": 14,
          "entries": [
            "The power of the moon suffuses you, granting you the following benefits."
          ]
        }
      ]
    },
    "circle of the sea": {
      "name": "Circle of the Sea",
      "source": "XPHB",
      "className": "Druid",
      "description": "Become One with Tides and Storms\n\nDruids of the Circle of the Sea draw on the tempestuous forces of oceans and storms. Some view themselves as embodiments of nature's wrath, seeking vengeance against those who despoil nature. Others seek mystical unity with nature by attuning themselves to the ebb and flow of the tides, following the rush of currents and waves and listening to the inscrutable whispers and roars of the winds.",
      "features": [
        {
          "name": "Circle of the Sea Spells",
          "level": 3,
          "entries": [
            "When you reach a Druid level specified in the Circle of the Sea Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Wrath of the Sea",
          "level": 3,
          "entries": [
            "As a Bonus Action, you can expend a use of your Wild Shape to manifest a 5-foot Emanation [Area of Effect] that takes the form of ocean spray that surrounds you for 10 minutes. It ends early if you dismiss it (no action required), manifest it again, or have the Incapacitated condition.",
            "When you manifest the Emanation [Area of Effect] and as a Bonus Action on your subsequent turns, you can choose another creature you can see in the Emanation [Area of Effect]. The target must succeed on a Constitution saving throw against your spell save DC or take Cold damage and, if the creature is Large or smaller, be pushed up to 15 feet away from you. To determine this damage, roll a number of d6s equal to your Wisdom modifier (minimum of one die)."
          ]
        },
        {
          "name": "Aquatic Affinity",
          "level": 6,
          "entries": [
            "The size of the Emanation [Area of Effect] created by your Wrath of the Sea increases to 10 feet.",
            "In addition, you gain a Swim Speed equal to your Speed."
          ]
        },
        {
          "name": "Stormborn",
          "level": 10,
          "entries": [
            "Your Wrath of the Sea confers two more benefits while active, as detailed below."
          ]
        },
        {
          "name": "Oceanic Gift",
          "level": 14,
          "entries": [
            "Instead of manifesting the Emanation [Area of Effect] of Wrath of the Sea around yourself, you can manifest it around one willing creature within 60 feet of yourself. That creature gains all the benefits of the Emanation [Area of Effect] and uses your spell save DC and Wisdom modifier for it.",
            "In addition, you can manifest the Emanation [Area of Effect] around both the other creature and yourself if you expend two uses of your Wild Shape instead of one when manifesting it."
          ]
        }
      ]
    },
    "circle of the stars": {
      "name": "Circle of the Stars",
      "source": "XPHB",
      "className": "Druid",
      "description": "Harness Secrets Hidden in Constellations\n\nThe Circle of the Stars has tracked heavenly patterns since time immemorial, discovering secrets hidden amid the constellations. By understanding these secrets, the Druids of this circle seek to harness the powers of the cosmos.",
      "features": [
        {
          "name": "Star Map",
          "level": 3,
          "entries": [
            "You've created a star chart as part of your heavenly studies. It is a Tiny object, and you can use it as a Spellcasting Focus for your Druid spells. You determine its form by rolling on the Star Map table or by choosing one.",
            "While holding the map, you have the Guidance and Guiding Bolt spells prepared, and you can cast Guiding Bolt without expending a spell slot. You can cast it in that way a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.",
            "If you lose the map, you can perform a 1-hour ceremony to magically create a replacement. This ceremony can be performed during a Short Rest or Long Rest, and it destroys the previous map."
          ]
        },
        {
          "name": "Starry Form",
          "level": 3,
          "entries": [
            "As a Bonus Action, you can expend a use of your Wild Shape feature to take on a starry form rather than shape-shifting.",
            "While in your starry form, you retain your game statistics, but your body becomes luminous, your joints glimmer like stars, and glowing lines connect them as on a star chart. This form sheds Bright Light in a 10-foot radius and Dim Light for an additional 10 feet. The form lasts for 10 minutes. It ends early if you dismiss it (no action required), have the Incapacitated condition, or use this feature again.",
            "Whenever you assume your starry form, choose which of the following constellations glimmers on your body; your choice gives you certain benefits while in the form."
          ]
        },
        {
          "name": "Archer",
          "level": 3,
          "entries": [
            "A constellation of an archer appears on you. When you activate this form and as a Bonus Action on your subsequent turns while it lasts, you can make a ranged spell attack, hurling a luminous arrow that targets one creature within 60 feet of yourself. On a hit, the attack deals Radiant damage equal to 1d8 plus your Wisdom modifier."
          ]
        },
        {
          "name": "Chalice",
          "level": 3,
          "entries": [
            "A constellation of a life-giving goblet appears on you. Whenever you cast a spell using a spell slot that restores Hit Points to a creature, you or another creature within 30 feet of you can regain Hit Points equal to 1d8 plus your Wisdom modifier."
          ]
        },
        {
          "name": "Dragon",
          "level": 3,
          "entries": [
            "A constellation of a wise dragon appears on you. When you make an Intelligence or a Wisdom check or a Constitution saving throw to maintain Concentration, you can treat a roll of 9 or lower on the d20 as a 10."
          ]
        },
        {
          "name": "Cosmic Omen",
          "level": 6,
          "entries": [
            "Whenever you finish a Long Rest, you can consult your Star Map for omens and roll a die. Until you finish your next Long Rest, you gain access to a special Reaction based on whether you rolled an even or an odd number on the die:",
            "You can use this Reaction a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Twinkling Constellations",
          "level": 10,
          "entries": [
            "The constellations of your Starry Form improve. The 1d8 of the Archer and the Chalice becomes 2d8, and while the Dragon is active, you have a Fly Speed of 20 feet and can hover.",
            "Moreover, at the start of each of your turns while in your Starry Form, you can change which constellation glimmers on your body."
          ]
        },
        {
          "name": "Full of Stars",
          "level": 14,
          "entries": [
            "While in your Starry Form, you become partially incorporeal, giving you Resistance to Bludgeoning, Piercing, and Slashing damage."
          ]
        }
      ]
    }
  }
}
