{
  "detail": {
    "name": "Fighter",
    "source": "XPHB",
    "description": "Fighters rule many battlefields. Questing knights, royal champions, elite soldiers, and hardened mercenaries—as Fighters, they all share an unparalleled prowess with weapons and armor. And they are well acquainted with death, both meting it out and defying it.\n\nFighters master various weapon techniques, and a well-equipped Fighter always has the right tool at hand for any combat situation. Likewise, a Fighter is adept with every form of armor. Beyond that basic degree of familiarity, each Fighter specializes in certain styles of combat. Some concentrate on archery, some on fighting with two weapons at once, and some on augmenting their martial skills with magic. This combination of broad ability and extensive specialization makes Fighters superior combatants.",
    "primaryAbility": "Strength or Dexterity",
    "complexity": "Low",
    "hd": {
      "number": 1,
      "faces": 10
    },
    "proficiency": [
      "str",
      "con"
    ],
    "startingProficiencies": {
      "armor": [
        "light",
        "medium",
        "heavy",
        "shield"
      ],
      "weapons": [
        "simple",
        "martial"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "acrobatics",
              "animal handling",
              "athletics",
              "history",
              "insight",
              "intimidation",
              "persuasion",
              "perception",
              "survival"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Battle Master",
      "Champion",
      "Eldritch Knight",
      "Psi Warrior"
    ],
    "features": [
      {
        "name": "Fighting Style",
        "level": 1,
        "entries": [
          "You have honed your martial prowess and gain a Fighting Style feat of your choice. Defense is recommended.",
          "Whenever you gain a Fighter level, you can replace the feat you chose with a different Fighting Style feat."
        ]
      },
      {
        "name": "Second Wind",
        "level": 1,
        "entries": [
          "You have a limited well of physical and mental stamina that you can draw on. As a Bonus Action, you can use it to regain Hit Points equal to 1d10 plus your Fighter level.",
          "You can use this feature twice. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.",
          "When you reach certain Fighter levels, you gain more uses of this feature, as shown in the Second Wind column of the Fighter Features table."
        ]
      },
      {
        "name": "Weapon Mastery",
        "level": 1,
        "entries": [
          "Your training with weapons allows you to use the weapon mastery properties of three kinds of Simple or Martial weapons of your choice. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.",
          "When you reach certain Fighter levels, you gain the ability to use the weapon mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Fighter Features table."
        ]
      },
      {
        "name": "Action Surge",
        "level": 2,
        "entries": [
          "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action, except the Magic action.",
          "Once you use this feature, you can't do so again until you finish a Short Rest or Long Rest. Starting at level 17, you can use it twice before a rest but only once on a turn."
        ]
      },
      {
        "name": "Tactical Mind",
        "level": 2,
        "entries": [
          "You have a mind for tactics on and off the battlefield. When you fail an ability check, you can expend a use of your Second Wind to push yourself toward success. Rather than regaining Hit Points, you roll 1d10 and add the number rolled to the ability check, potentially turning it into a success. If the check still fails, this use of Second Wind isn't expended."
        ]
      },
      {
        "name": "Fighter Subclass",
        "level": 3,
        "entries": [
          "You gain a Fighter subclass of your choice. A subclass is a specialization that grants you features at certain Fighter levels. For the rest of your career, you gain each of your subclass's features that are of your Fighter level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Fighter levels 6, 8, 12, 14, and 16."
        ]
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "entries": [
          "You can attack twice instead of once whenever you take the Attack action on your turn."
        ]
      },
      {
        "name": "Tactical Shift",
        "level": 5,
        "entries": [
          "Whenever you activate your Second Wind with a Bonus Action, you can move up to half your Speed without provoking Opportunity Attack."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 6,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 7,
        "entries": [
          "You gain a feature from your Fighter Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Indomitable",
        "level": 9,
        "entries": [
          "If you fail a saving throw, you can reroll it with a bonus equal to your Fighter level. You must use the new roll, and you can't use this feature again until you finish a Long Rest.",
          "You can use this feature twice before a Long Rest starting at level 13 and three times before a Long Rest starting at level 17."
        ]
      },
      {
        "name": "Tactical Master",
        "level": 9,
        "entries": [
          "When you attack with a weapon whose mastery property you can use, you can replace that property with the Push, Sap, or Slow property for that attack."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 10,
        "entries": [
          "You gain a feature from your Fighter Subclass."
        ]
      },
      {
        "name": "Two Extra Attacks",
        "level": 11,
        "entries": [
          "You can attack three times instead of once whenever you take the Attack action on your turn."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Indomitable",
        "level": 13,
        "entries": [
          "If you fail a saving throw, you can reroll it with a bonus equal to your Fighter level. You must use the new roll, and you can't use this feature again until you finish a Long Rest.",
          "You can use this feature twice before a Long Rest starting at level 13 and three times before a Long Rest starting at level 17."
        ]
      },
      {
        "name": "Studied Attacks",
        "level": 13,
        "entries": [
          "You study your opponents and learn from each attack you make. If you make an attack roll against a creature and miss, you have Advantage on your next attack roll against that creature before the end of your next turn."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 14,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 15,
        "entries": [
          "You gain a feature from your Fighter Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Action Surge",
        "level": 17,
        "entries": [
          "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action, except the Magic action.",
          "Once you use this feature, you can't do so again until you finish a Short Rest or Long Rest. Starting at level 17, you can use it twice before a rest but only once on a turn."
        ]
      },
      {
        "name": "Indomitable",
        "level": 17,
        "entries": [
          "If you fail a saving throw, you can reroll it with a bonus equal to your Fighter level. You must use the new roll, and you can't use this feature again until you finish a Long Rest.",
          "You can use this feature twice before a Long Rest starting at level 13 and three times before a Long Rest starting at level 17."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 18,
        "entries": [
          "You gain a feature from your Fighter Subclass."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Combat Prowess is recommended."
        ]
      },
      {
        "name": "Three Extra Attacks",
        "level": 20,
        "entries": [
          "You can attack four times instead of once whenever you take the Attack action on your turn."
        ]
      }
    ]
  },
  "subclasses": {
    "battle master": {
      "name": "Battle Master",
      "source": "XPHB",
      "className": "Fighter",
      "description": "Master Sophisticated Battle Maneuvers\n\nBattle Masters are students of the art of battle, learning martial techniques passed down through generations. The most accomplished Battle Masters are well-rounded figures who combine their carefully honed combat skills with academic study in the fields of history, theory, and the arts.",
      "features": [
        {
          "name": "Combat Superiority",
          "level": 3,
          "entries": [
            "Your experience on the battlefield has refined your fighting techniques. You learn maneuvers that are fueled by special dice called Superiority Dice."
          ]
        },
        {
          "name": "Maneuver Options",
          "level": 3,
          "entries": [
            "The maneuvers are presented here in alphabetical order."
          ]
        },
        {
          "name": "Student of War",
          "level": 3,
          "entries": [
            "You gain proficiency with one type of Artisan's Tools of your choice, and you gain proficiency in one skill of your choice from the skills available to Fighters at level 1."
          ]
        },
        {
          "name": "Know Your Enemy",
          "level": 7,
          "entries": [
            "As a Bonus Action, you can discern certain strengths and weaknesses of a creature you can see within 30 feet of yourself; you know whether that creature has any Immunities, Resistances, or Vulnerabilities, and if the creature has any, you know what they are.",
            "Once you use this feature, you can't do so again until you finish a Long Rest. You can also restore a use of the feature by expending one Superiority Die (no action required)."
          ]
        },
        {
          "name": "Improved Combat Superiority",
          "level": 10,
          "entries": [
            "Your Superiority Die becomes a d10."
          ]
        },
        {
          "name": "Relentless",
          "level": 15,
          "entries": [
            "Once per turn, when you use a maneuver, you can roll 1d8 and use the number rolled instead of expending a Superiority Die."
          ]
        },
        {
          "name": "Ultimate Combat Superiority",
          "level": 18,
          "entries": [
            "Your Superiority Die becomes a d12."
          ]
        }
      ]
    },
    "champion": {
      "name": "Champion",
      "source": "XPHB",
      "className": "Fighter",
      "description": "Pursue Physical Excellence in Combat\n\nA Champion focuses on the development of martial prowess in a relentless pursuit of victory. Champions combine rigorous training with physical excellence to deal devastating blows, withstand peril, and garner glory. Whether in athletic contests or bloody battle, Champions strive for the crown of the victor.",
      "features": [
        {
          "name": "Improved Critical",
          "level": 3,
          "entries": [
            "Your attack rolls with weapons and Unarmed Strikes can score a Critical Hit on a roll of 19 or 20 on the d20."
          ]
        },
        {
          "name": "Remarkable Athlete",
          "level": 3,
          "entries": [
            "Thanks to your athleticism, you have Advantage on Initiative rolls and Strength (Athletics) checks.",
            "In addition, immediately after you score a Critical Hit, you can move up to half your Speed without provoking Opportunity Attack."
          ]
        },
        {
          "name": "Additional Fighting Style",
          "level": 7,
          "entries": [
            "You gain another Fighting Style feat of your choice."
          ]
        },
        {
          "name": "Heroic Warrior",
          "level": 10,
          "entries": [
            "The thrill of battle drives you toward victory. During combat, you can give yourself Heroic Inspiration whenever you start your turn without it."
          ]
        },
        {
          "name": "Superior Critical",
          "level": 15,
          "entries": [
            "Your attack rolls with weapons and Unarmed Strikes can now score a Critical Hit on a roll of 18–20 on the d20."
          ]
        },
        {
          "name": "Survivor",
          "level": 18,
          "entries": [
            "You attain the pinnacle of resilience in battle, giving you these benefits."
          ]
        }
      ]
    },
    "eldritch knight": {
      "name": "Eldritch Knight",
      "source": "XPHB",
      "className": "Fighter",
      "description": "Support Combat Skills with Arcane Magic\n\nEldritch Knights combine the martial mastery common to all Fighters with a careful study of magic. Their spells both complement and extend their combat skills, providing additional protection to shore up their armor and also allowing them to engage many foes at once with explosive magic.",
      "features": [
        {
          "name": "Spellcasting",
          "level": 3,
          "entries": [
            "You have learned to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules as an Eldritch Knight."
          ]
        },
        {
          "name": "War Bond",
          "level": 3,
          "entries": [
            "You learn a ritual that creates a magical bond between yourself and one weapon. You perform the ritual over the course of 1 hour, which can be done during a Short Rest. The weapon must be within your reach throughout the ritual, at the conclusion of which you touch the weapon and forge the bond. The bond fails if another Fighter is bonded to the weapon or if the weapon is a magic item to which someone else is attuned.",
            "Once you have bonded a weapon to yourself, you can't be disarmed of that weapon unless you have the Incapacitated condition. If it is on the same plane of existence, you can summon that weapon as a Bonus Action, causing it to teleport instantly to your hand.",
            "You can have up to two bonded weapons, but you can summon only one at a time with a Bonus Action. If you attempt to bond with a third weapon, you must break the bond with one of the other two."
          ]
        },
        {
          "name": "War Magic",
          "level": 7,
          "entries": [
            "When you take the Attack action on your turn, you can replace one of the attacks with a casting of one of your Wizard cantrips that has a casting time of an action."
          ]
        },
        {
          "name": "Eldritch Strike",
          "level": 10,
          "entries": [
            "You learn how to make your weapon strikes undercut a creature's ability to withstand your spells. When you hit a creature with an attack using a weapon, that creature has Disadvantage on the next saving throw it makes against a spell you cast before the end of your next turn."
          ]
        },
        {
          "name": "Arcane Charge",
          "level": 15,
          "entries": [
            "When you use your Action Surge, you can teleport up to 30 feet to an unoccupied space you can see. You can teleport before or after the additional action."
          ]
        },
        {
          "name": "Improved War Magic",
          "level": 18,
          "entries": [
            "When you take the Attack action on your turn, you can replace two of the attacks with a casting of one of your level 1 or level 2 Wizard spells that has a casting time of an action."
          ]
        }
      ]
    },
    "psi warrior": {
      "name": "Psi Warrior",
      "source": "XPHB",
      "className": "Fighter",
      "description": "Augment Physical Might with Psionic Power\n\nPsi Warriors awaken the power of their minds to augment their physical might. They harness this psionic power to infuse their weapon strikes, lash out with telekinetic energy, and create barriers of mental force.",
      "features": [
        {
          "name": "Psionic Power",
          "level": 3,
          "entries": [
            "You harbor a wellspring of psionic energy within yourself. It is represented by your Psionic Energy Dice, which fuel powers you have from this subclass. The Psi Warrior Energy Dice table shows the die size and number of these dice you have when you reach certain Fighter levels.",
            "Any features in this subclass that use a Psionic Energy Die use only the dice from this subclass. Some of your powers expend the Psionic Energy Die, as specified in a power's description, and you can't use a power if it requires you to use a die when all your Psionic Energy Dice are expended.",
            "You regain one of your expended Psionic Energy Dice when you finish a Short Rest, and you regain all of them when you finish a Long Rest."
          ]
        },
        {
          "name": "Protective Field",
          "level": 3,
          "entries": [
            "When you or another creature you can see within 30 feet of you takes damage, you can take a Reaction to expend one Psionic Energy Die, roll the die, and reduce the damage taken by the number rolled plus your Intelligence modifier (minimum reduction of 1), as you create a momentary shield of telekinetic force."
          ]
        },
        {
          "name": "Psionic Strike",
          "level": 3,
          "entries": [
            "You can propel your weapons with psionic force. Once on each of your turns, immediately after you hit a target within 30 feet of yourself with an attack and deal damage to it with a weapon, you can expend one Psionic Energy Die, rolling it and dealing Force damage to the target equal to the number rolled plus your Intelligence modifier."
          ]
        },
        {
          "name": "Telekinetic Movement",
          "level": 3,
          "entries": [
            "You can move an object or a creature with your mind. As a Magic action, choose one target you can see within 30 feet of yourself; the target must be a loose object that is Large or smaller or one willing creature other than you. You transport the target up to 30 feet to an unoccupied space you can see. Alternatively, if the target is a Tiny object, you can transport it to or from your hand.",
            "Once you take this action, you can't do so again until you finish a Short Rest or Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Psi-Powered Leap",
          "level": 7,
          "entries": [
            "As a Bonus Action, you gain a Fly Speed equal to twice your Speed until the end of the current turn. Once you take this Bonus Action, you can't do so again until you finish a Short Rest or Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Telekinetic Adept",
          "level": 7,
          "entries": [
            "You have mastered new ways to use your telekinetic abilities, detailed below."
          ]
        },
        {
          "name": "Telekinetic Thrust",
          "level": 7,
          "entries": [
            "When you deal damage to a target with your Psionic Strike, you can force the target to make a Strength saving throw (8 plus your Intelligence modifier and Proficiency). On a failed save, you can give the target the Prone condition or transport it up to 10 feet horizontally."
          ]
        },
        {
          "name": "Guarded Mind",
          "level": 10,
          "entries": [
            "You have Resistance to Psychic damage. Moreover, if you start your turn with the Charmed or Frightened condition, you can expend a Psionic Energy Die (no action required) and end every effect on yourself giving you those conditions."
          ]
        },
        {
          "name": "Bulwark of Force",
          "level": 15,
          "entries": [
            "You can shield yourself and others with telekinetic force. As a Bonus Action, you can choose creatures, including yourself, within 30 feet of yourself, up to a number of creatures equal to your Intelligence modifier (minimum of one creature). Each of the chosen creatures has Cover for 1 minute or until you have the Incapacitated condition.",
            "Once you use this feature, you can't do so again until you finish a Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Telekinetic Master",
          "level": 18,
          "entries": [
            "You always have the Telekinesis spell prepared. With this feature, you can cast it without a spell slot or components, and your spellcasting ability for it is Intelligence. On each of your turns while you maintain Concentration on it, including the turn when you cast it, you can make one attack with a weapon as a Bonus Action.",
            "Once you cast the spell with this feature, you can't do so in this way again until you finish a Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it."
          ]
        }
      ]
    }
  }
}
