{
  "detail": {
    "name": "Monk",
    "source": "XPHB",
    "description": "Monks use rigorous combat training and mental discipline to align themselves with the multiverse and focus their internal reservoirs of power. Different Monks conceptualize this power in various ways: as breath, energy, life force, essence, or self, for example. Whether channeled as a striking display of martial prowess or as a subtler manifestation of defense and speed, this power infuses all that a Monk does.\n\nMonks focus their internal power to create extraordinary, even supernatural, effects. They channel uncanny speed and strength into their attacks, with or without the use of weapons. In a Monk's hands, even the most basic weapons can become sophisticated implements of combat mastery.\n\nMany Monks find that a structured life of ascetic withdrawal helps them cultivate the physical and mental focus they need to harness their power. Other Monks believe that immersing themselves in the vibrant confusion of life helps to fuel their determination and discipline.\n\nMonks generally view adventures as tests of their physical and mental development. They are driven by a desire to accomplish a greater mission than merely slaying monsters and plundering treasure; they strive to turn themselves into living weapons.",
    "primaryAbility": "Dexterity and Wisdom",
    "complexity": "High",
    "hd": {
      "number": 1,
      "faces": 8
    },
    "proficiency": [
      "str",
      "dex"
    ],
    "startingProficiencies": {
      "weapons": [
        "simple",
        "Martial weapons that have the Light property"
      ],
      "weaponProficiencies": [
        {
          "simple": true,
          "all": {
            "fromFilter": "type=martial weapon|property=light"
          }
        }
      ],
      "tools": [
        "Choose one type of Artisan's Tools or Musical Instrument"
      ],
      "toolProficiencies": [
        {
          "anyArtisansTool": 1
        },
        {
          "anyMusicalInstrument": 1
        }
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "acrobatics",
              "athletics",
              "history",
              "insight",
              "religion",
              "stealth"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Warrior of Mercy",
      "Warrior of Shadow",
      "Warrior of the Elements",
      "Warrior of the Open Hand"
    ],
    "features": [
      {
        "name": "Bonus Unarmed Strike",
        "level": 1,
        "entries": [
          "You can make an Unarmed Strike as a Bonus Action."
        ]
      },
      {
        "name": "Dexterous Attacks",
        "level": 1,
        "entries": [
          "You can use your Dexterity modifier instead of your Strength modifier for the attack and damage rolls of your Unarmed Strikes and Monk weapons. In addition, when you use the Grapple or Shove option of your Unarmed Strike, you can use your Dexterity modifier instead of your Strength modifier to determine the save DC."
        ]
      },
      {
        "name": "Martial Arts",
        "level": 1,
        "entries": [
          "Your practice of martial arts gives you mastery of combat styles that use your Unarmed Strike and Monk weapons, which are the following:",
          "You gain the following benefits while you are unarmed or wielding only Monk weapons and you aren't wearing armor or wielding a Shield."
        ]
      },
      {
        "name": "Martial Arts Die",
        "level": 1,
        "entries": [
          "You can roll 1d6 in place of the normal damage of your Unarmed Strike or Monk weapons. This die changes as you gain Monk levels, as shown in the Martial Arts column of the Monk Features table."
        ]
      },
      {
        "name": "Unarmored Defense",
        "level": 1,
        "entries": [
          "While you aren't wearing armor or wielding a Shield, your base Armor Class equals 10 plus your Dexterity and Wisdom modifiers."
        ]
      },
      {
        "name": "Flurry of Blows",
        "level": 2,
        "entries": [
          "You can expend 1 Focus Point to make two Unarmed Strikes as a Bonus Action."
        ]
      },
      {
        "name": "Monk's Focus",
        "level": 2,
        "entries": [
          "Your focus and martial training allow you to harness a well of extraordinary energy within yourself. This energy is represented by Focus Points. Your Monk level determines the number of points you have, as shown in the Focus Points column of the Monk Features table.",
          "You can expend these points to enhance or fuel certain Monk features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind, each of which is detailed below.",
          "When you expend a Focus Point, it is unavailable until you finish a Short Rest or Long Rest, at the end of which you regain all your expended points.",
          "Some features that use Focus Points require your target to make a saving throw. The save DC equals 8 plus your Wisdom modifier and Proficiency."
        ]
      },
      {
        "name": "Patient Defense",
        "level": 2,
        "entries": [
          "You can take the Disengage action as a Bonus Action. Alternatively, you can expend 1 Focus Point to take both the Disengage and the Dodge actions as a Bonus Action."
        ]
      },
      {
        "name": "Step of the Wind",
        "level": 2,
        "entries": [
          "You can take the Dash action as a Bonus Action. Alternatively, you can expend 1 Focus Point to take both the Disengage and Dash actions as a Bonus Action, and your jump distance is doubled for the turn."
        ]
      },
      {
        "name": "Unarmored Movement",
        "level": 2,
        "entries": [
          "Your speed increases by 10 feet while you aren't wearing armor or wielding a Shield. This bonus increases when you reach certain Monk levels, as shown on the Monk Features table."
        ]
      },
      {
        "name": "Uncanny Metabolism",
        "level": 2,
        "entries": [
          "When you roll Initiative, you can regain all expended Focus Points. When you do so, roll your Martial Arts die, and regain a number of Hit Points equal to your Monk level plus the number rolled.",
          "Once you use this feature, you can't use it again until you finish a Long Rest."
        ]
      },
      {
        "name": "Deflect Attacks",
        "level": 3,
        "entries": [
          "When an attack roll hits you and its damage includes Bludgeoning, Piercing, or Slashing damage, you can take a Reaction to reduce the attack's total damage against you. The reduction equals 1d10 plus your Dexterity modifier and Monk level.",
          "If you reduce the damage to 0, you can expend 1 Focus Point to redirect some of the attack's force. If you do so, choose a creature you can see within 5 feet of yourself if the attack was a melee attack or a creature you can see within 60 feet of yourself that isn't behind Cover if the attack was a ranged attack. That creature must succeed on a Dexterity saving throw or take damage equal to two rolls of your Martial Arts die plus your Dexterity modifier. The damage is the same type dealt by the attack."
        ]
      },
      {
        "name": "Monk Subclass",
        "level": 3,
        "entries": [
          "You gain a Monk subclass of your choice. A subclass is a specialization that grants you features at certain Monk levels. For the rest of your career, you gain each of your subclass's features that are of your Monk level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Monk levels 8, 12, and 16."
        ]
      },
      {
        "name": "Slow Fall",
        "level": 4,
        "entries": [
          "You can take a Reaction when you fall to reduce any damage you take from the fall by an amount equal to five times your Monk level."
        ]
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "entries": [
          "You can attack twice instead of once whenever you take the Attack action on your turn."
        ]
      },
      {
        "name": "Stunning Strike",
        "level": 5,
        "entries": [
          "Once per turn when you hit a creature with a Monk weapon or an Unarmed Strike, you can expend 1 Focus Point to attempt a stunning strike. The target must make a Constitution saving throw. On a failed save, the target has the Stunned condition until the start of your next turn. On a successful save, the target's Speed is halved until the start of your next turn, and the next attack roll made against the target before then has Advantage."
        ]
      },
      {
        "name": "Empowered Strikes",
        "level": 6,
        "entries": [
          "Whenever you deal damage with your Unarmed Strike, it can deal your choice of Force damage or its normal damage type."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Monk subclass."
        ]
      },
      {
        "name": "Evasion",
        "level": 7,
        "entries": [
          "When you're subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw and only half damage if you fail.",
          "You don't benefit from this feature if you have the Incapacitated condition."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Acrobatic Movement",
        "level": 9,
        "entries": [
          "While you aren't wearing armor or wielding a Shield, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the movement."
        ]
      },
      {
        "name": "Heightened Focus",
        "level": 10,
        "entries": [
          "Your Flurry of Blows, Patient Defense, and Step of the Wind gain the following benefits."
        ]
      },
      {
        "name": "Self-Restoration",
        "level": 10,
        "entries": [
          "Through sheer force of will, you can remove one of the following conditions from yourself at the end of each of your turns: Charmed, Frightened, or Poisoned.",
          "In addition, forgoing food and drink doesn't give you levels of Exhaustion."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 11,
        "entries": [
          "You gain a feature from your Monk subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Deflect Energy",
        "level": 13,
        "entries": [
          "You can now use your Deflect Attacks feature against attacks that deal any damage type, not just Bludgeoning, Piercing, or Slashing."
        ]
      },
      {
        "name": "Disciplined Survivor",
        "level": 14,
        "entries": [
          "Your physical and mental discipline grant you proficiency in all saving throws.",
          "Additionally, whenever you make a saving throw and fail, you can expend 1 Focus Point to reroll it, and you must use the new roll."
        ]
      },
      {
        "name": "Perfect Focus",
        "level": 15,
        "entries": [
          "When you roll Initiative and don't use Uncanny Metabolism, you regain expended Focus Points until you have 4 if you have 3 or fewer."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 17,
        "entries": [
          "You gain a feature from your Monk subclass."
        ]
      },
      {
        "name": "Superior Defense",
        "level": 18,
        "entries": [
          "At the start of your turn, you can expend 3 Focus Points to bolster yourself against harm for 1 minute or until you have the Incapacitated condition. During that time, you have Resistance to all damage except Force damage."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Irresistible Offense is recommended."
        ]
      },
      {
        "name": "Body and Mind",
        "level": 20,
        "entries": [
          "You have developed your body and mind to new heights. Your Dexterity and Wisdom scores increase by 4, to a maximum of 25."
        ]
      }
    ]
  },
  "subclasses": {
    "warrior of mercy": {
      "name": "Warrior of Mercy",
      "source": "XPHB",
      "className": "Monk",
      "description": "Manipulate Forces of Life and Death\n\nWarriors of Mercy manipulate the life force of others. These Monks are wandering physicians, but they bring a swift end to their enemies. They often wear masks, presenting themselves as faceless bringers of life and death.",
      "features": [
        {
          "name": "Hand of Harm",
          "level": 3,
          "entries": [
            "Once per turn when you hit a creature with an Unarmed Strike and deal damage, you can expend 1 Focus Point to deal extra Necrotic damage equal to one roll of your Martial Arts die plus your Wisdom modifier."
          ]
        },
        {
          "name": "Hand of Healing",
          "level": 3,
          "entries": [
            "As a Magic action, you can expend 1 Focus Point to touch a creature and restore a number of Hit Points equal to a roll of your Martial Arts die plus your Wisdom modifier. When you use your Flurry of Blows, you can replace one of the Unarmed Strikes with a use of this feature without expending a Focus Point for the healing."
          ]
        },
        {
          "name": "Implements of Mercy",
          "level": 3,
          "entries": [
            "You gain proficiency in the Insight and Medicine skills and proficiency with the Herbalism Kit."
          ]
        },
        {
          "name": "Physician's Touch",
          "level": 6,
          "entries": [
            "Your Hand of Harm and Hand of Healing improve, as detailed below."
          ]
        },
        {
          "name": "Flurry of Healing and Harm",
          "level": 11,
          "entries": [
            "When you use Flurry of Blows, you can replace each of the Unarmed Strikes with a use of Hand of Healing without expending Focus Points for the healing.",
            "In addition, when you make an Unarmed Strike with Flurry of Blows and deal damage, you can use Hand of Harm with that strike without expending a Focus Point for Hand of Harm. You can still use Hand of Harm only once per turn.",
            "You can use these benefits a total number of times equal to your Wisdom modifier (minimum of once). You regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Hand of Ultimate Mercy",
          "level": 17,
          "entries": [
            "Your mastery of life energy opens the door to the ultimate mercy. As a Magic action, you can touch the corpse of a creature that died within the past 24 hours and expend 5 Focus Points. The creature then returns to life with a number of Hit Points equal to 4d10 plus your Wisdom modifier. If the creature died with any of the following conditions, the creature revives with the conditions removed: Blinded, Deafened, Paralyzed, Poisoned, and Stunned.",
            "Once you use this feature, you can't use it again until you finish a Long Rest."
          ]
        }
      ]
    },
    "warrior of shadow": {
      "name": "Warrior of Shadow",
      "source": "XPHB",
      "className": "Monk",
      "description": "Harness Shadow Power for Stealth and Subterfuge\n\nWarriors of Shadow practice stealth and subterfuge, harnessing the power of the Shadowfell. They are at home in darkness, able to draw gloom around themselves to hide, leap from shadow to shadow, and take on a wraithlike form.",
      "features": [
        {
          "name": "Shadow Arts",
          "level": 3,
          "entries": [
            "You have learned to draw on the power of the Shadowfell, gaining the following benefits."
          ]
        },
        {
          "name": "Darkness",
          "level": 3,
          "entries": [
            "You can expend 1 Focus Point to cast the Darkness spell without spell components. You can see within the spell's area when you cast it with this feature. While the spell persists, you can move its area of Darkness to a space within 60 feet of yourself at the start of each of your turns."
          ]
        },
        {
          "name": "Darkvision",
          "level": 3,
          "entries": [
            "You gain Darkvision with a range of 60 feet. If you already have Darkvision, its range increases by 60 feet."
          ]
        },
        {
          "name": "Shadowy Figments",
          "level": 3,
          "entries": [
            "You know the Minor Illusion spell. Wisdom is your spellcasting ability for it."
          ]
        },
        {
          "name": "Shadow Step",
          "level": 6,
          "entries": [
            "While entirely within Dim Light or Darkness, you can use a Bonus Action to teleport up to 60 feet to an unoccupied space you can see that is also in Dim Light or Darkness. You then have Advantage on the next melee attack you make before the end of the current turn."
          ]
        },
        {
          "name": "Improved Shadow Step",
          "level": 11,
          "entries": [
            "You can draw on your Shadowfell connection to empower your teleportation. When you use your Shadow Step, you can expend 1 Focus Point to remove the requirement that you must start and end in Dim Light or Darkness for that use of the feature. As part of this Bonus Action, you can make an Unarmed Strike immediately after you teleport."
          ]
        },
        {
          "name": "Cloak of Shadows",
          "level": 17,
          "entries": [
            "As a Magic action while entirely within Dim Light or Darkness, you can expend 3 Focus Points to shroud yourself with shadows for 1 minute, until you have the Incapacitated condition, or until you end your turn in Bright Light. While shrouded by these shadows, you gain the following benefits."
          ]
        }
      ]
    },
    "warrior of the elements": {
      "name": "Warrior of the Elements",
      "source": "XPHB",
      "className": "Monk",
      "description": "Wield Strikes and Bursts of Elemental Power\n\nWarriors of the Elements tap into the power of the Elemental Planes. Harnessing their supernatural focus, these Monks momentarily tame the energy of the Elemental Chaos to empower themselves in and out of battle.",
      "features": [
        {
          "name": "Elemental Attunement",
          "level": 3,
          "entries": [
            "At the start of your turn, you can expend 1 Focus Point to imbue yourself with elemental energy. The energy lasts for 10 minutes or until you have the Incapacitated condition. You gain the following benefits while this feature is active."
          ]
        },
        {
          "name": "Manipulate Elements",
          "level": 3,
          "entries": [
            "You know the Elementalism spell. Wisdom is your spellcasting ability for it."
          ]
        },
        {
          "name": "Elemental Burst",
          "level": 6,
          "entries": [
            "As a Magic action, you can expend 2 Focus Points to cause elemental energy to burst in a 20-foot-radius Sphere [Area of Effect] centered on a point within 120 feet of yourself. Choose a damage type: Acid, Cold, Fire, Lightning, or Thunder.",
            "Each creature in the Sphere [Area of Effect] must make a Dexterity saving throw. On a failed save, a creature takes damage of the chosen type equal to three rolls of your Martial Arts die. On a successful save, a creature takes half as much damage."
          ]
        },
        {
          "name": "Stride of the Elements",
          "level": 11,
          "entries": [
            "While your Elemental Attunement is active, you also have a Fly Speed and a Swim Speed equal to your Speed."
          ]
        },
        {
          "name": "Elemental Epitome",
          "level": 17,
          "entries": [
            "While your Elemental Attunement is active, you also gain the following benefits."
          ]
        }
      ]
    },
    "warrior of the open hand": {
      "name": "Warrior of the Open Hand",
      "source": "XPHB",
      "className": "Monk",
      "description": "Master Unarmed Combat Techniques\n\nWarriors of the Open Hand are masters of unarmed combat. They learn techniques to push and trip their opponents and manipulate their own energy to protect themselves from harm.",
      "features": [
        {
          "name": "Open Hand Technique",
          "level": 3,
          "entries": [
            "Whenever you hit a creature with an attack granted by your Flurry of Blows, you can impose one of the following effects on that target."
          ]
        },
        {
          "name": "Wholeness of Body",
          "level": 6,
          "entries": [
            "You gain the ability to heal yourself. As a Bonus Action, you can roll your Martial Arts die. You regain a number of Hit Points equal to the number rolled plus your Wisdom modifier (minimum of 1 Hit Points regained).",
            "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Fleet Step",
          "level": 11,
          "entries": [
            "When you take a Bonus Action other than Step of the Wind, you can also use Step of the Wind immediately after that Bonus Action."
          ]
        },
        {
          "name": "Quivering Palm",
          "level": 17,
          "entries": [
            "You gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an Unarmed Strike, you can expend 4 Focus Points to start these imperceptible vibrations, which last for a number of days equal to your Monk level. The vibrations are harmless unless you take an action to end them. Alternatively, when you take the Attack action on your turn, you can forgo one of the attacks to end the vibrations. To end them, you and the target must be on the same plane of existence. When you end them, the target must make a Constitution saving throw, taking 10d12 Force damage on a failed save or half as much damage on a successful one.",
            "You can have only one creature under the effect of this feature at a time. You can end the vibrations harmlessly (no action required)."
          ]
        }
      ]
    }
  }
}
