{
  "detail": {
    "name": "Paladin",
    "source": "XPHB",
    "description": "Paladins are united by their oaths to stand against the forces of annihilation and corruption. Whether sworn before a god's altar, in a sacred glade before nature spirits, or in a moment of desperation and grief with the dead as the only witnesses, a Paladin's oath is a powerful bond. It is a source of power that turns a devout warrior into a blessed champion.\n\nPaladins train to learn the skills of combat, mastering a variety of weapons and armor. Even so, their martial skills are secondary to the magical power they wield: power to heal the injured, smite their foes, and protect the helpless and those who fight at their side.\n\nAlmost by definition, the life of a Paladin is an adventuring life, for every Paladin lives on the front lines of the cosmic struggle against annihilation. Fighters are rare enough among the ranks of a world's armies, but even fewer people can claim the calling of a Paladin. When they do receive the call, these blessed folk turn from their former occupations and take up arms and magic.",
    "primaryAbility": "Strength and Charisma",
    "complexity": "Average",
    "hd": {
      "number": 1,
      "faces": 10
    },
    "proficiency": [
      "wis",
      "cha"
    ],
    "startingProficiencies": {
      "armor": [
        "light",
        "medium",
        "heavy",
        "shield"
      ],
      "weapons": [
        "simple",
        "martial"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "athletics",
              "insight",
              "intimidation",
              "medicine",
              "persuasion",
              "religion"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Oath of Devotion",
      "Oath of Glory",
      "Oath of the Ancients",
      "Oath of Vengeance"
    ],
    "features": [
      {
        "name": "Lay on Hands",
        "level": 1,
        "entries": [
          "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you finish a Long Rest. With that pool, you can restore a total number of Hit Points equal to five times your Paladin level.",
          "As a Bonus Action, you can touch a creature (which could be yourself) and draw power from the pool of healing to restore a number of Hit Points to that creature, up to the maximum amount remaining in the pool.",
          "You can also expend 5 Hit Points from the pool of healing power to remove the Poisoned condition from the creature; those points don't also restore Hit Points to the creature."
        ]
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "entries": [
          "You have learned to cast spells through prayer and meditation. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Paladin spells, which appear in the Paladin spell list later in the class's description."
        ]
      },
      {
        "name": "Weapon Mastery",
        "level": 1,
        "entries": [
          "Your training with weapons allows you to use the weapon mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Longsword and Javelin.",
          "Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the weapon mastery properties of Halberd and Flail."
        ]
      },
      {
        "name": "Fighting Style",
        "level": 2,
        "entries": [
          "You gain a Fighting Style feat of your choice. Instead of choosing one of those feats, you can choose the option below."
        ]
      },
      {
        "name": "Paladin's Smite",
        "level": 2,
        "entries": [
          "You always have the Divine Smite spell prepared. In addition, you can cast it without expending a spell slot, but you must finish a Long Rest before you can cast it in this way again."
        ]
      },
      {
        "name": "Channel Divinity",
        "level": 3,
        "entries": [
          "You can channel divine energy directly from the Outer Planes, using it to fuel magical effects. You start with one such effect: Divine Sense, which is described below. Other Paladin features give additional Channel Divinity effect options. Each time you use this class's Channel Divinity, you choose which effect from this class to create.",
          "You can use this class's Channel Divinity twice. You regain one of its expended uses when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest. You gain an additional use when you reach Paladin level 11.",
          "If a Channel Divinity effect requires a saving throw, the DC equals the spell save DC from this class's Spellcasting feature."
        ]
      },
      {
        "name": "Divine Sense",
        "level": 3,
        "entries": [
          "As a Bonus Action, you can open your awareness to detect Celestials, Fiends, and Undead. For the next 10 minutes or until you have the Incapacitated condition, you know the location of any creature of those types within 60 feet of yourself, and you know its creature type. Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the Hallow spell."
        ]
      },
      {
        "name": "Paladin Subclass",
        "level": 3,
        "entries": [
          "You gain a Paladin subclass of your choice. A subclass is a specialization that grants you features at certain Paladin levels. For the rest of your career, you gain each of your subclass's features that are of your Paladin level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Paladin levels 8, 12, and 16."
        ]
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "entries": [
          "You can attack twice instead of once whenever you take the Attack action on your turn."
        ]
      },
      {
        "name": "Faithful Steed",
        "level": 5,
        "entries": [
          "You can call on the aid of an otherworldly steed. You always have the Find Steed spell prepared.",
          "You can also cast the spell once without expending a spell slot, and you regain the ability to do so when you finish a Long Rest."
        ]
      },
      {
        "name": "Aura of Protection",
        "level": 6,
        "entries": [
          "You radiate a protective, unseeable aura in a 10-foot Emanation [Area of Effect] that originates from you. The aura is inactive while you have the Incapacitated condition.",
          "You and your allies in the aura gain a bonus to saving throws equal to your Charisma modifier (minimum bonus of +1).",
          "If another Paladin is present, a creature can benefit from only one Aura of Protection at a time; the creature chooses which aura while in them."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 7,
        "entries": [
          "You gain a feature from your Paladin Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Abjure Foes",
        "level": 9,
        "entries": [
          "As a Magic action, you can expend one use of this class's Channel Divinity to overwhelm foes with awe. As you present your Holy Symbol or weapon, you can target a number of creatures equal to your Charisma modifier (minimum of one creature) that you can see within 60 feet of yourself. Each target must succeed on a Wisdom saving throw or have the Frightened condition for 1 minute or until it takes any damage. While Frightened in this way, a target can do only one of the following on its turns: move, take an action, or take a Bonus Action."
        ]
      },
      {
        "name": "Aura of Courage",
        "level": 10,
        "entries": [
          "You and your allies have Immunity to the Frightened condition while in your Aura of Protection. If a Frightened ally enters the aura, that condition has no effect on that ally while there."
        ]
      },
      {
        "name": "Radiant Strikes",
        "level": 11,
        "entries": [
          "Your strikes now carry supernatural power. When you hit a target with an attack roll using a Melee weapon or an Unarmed Strike, the target takes an extra 1d8 Radiant damage."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Restoring Touch",
        "level": 14,
        "entries": [
          "When you use Lay On Hands on a creature, you can also remove one or more of the following conditions from the creature: Blinded, Charmed, Deafened, Frightened, Paralyzed, or Stunned. You must expend 5 Hit Points from the healing pool of Lay On Hands for each of these conditions you remove; those points don't also restore Hit Points to the creature."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 15,
        "entries": [
          "You gain a feature from your Paladin Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Aura Expansion",
        "level": 18,
        "entries": [
          "Your Aura of Protection is now a 30-foot Emanation [Area of Effect]."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Truesight is recommended."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 20,
        "entries": [
          "You gain a feature from your Paladin Subclass."
        ]
      }
    ]
  },
  "subclasses": {
    "oath of devotion": {
      "name": "Oath of Devotion",
      "source": "XPHB",
      "className": "Paladin",
      "description": "Uphold the Ideals of Justice and Order\n\nThe Oath of Devotion binds Paladins to the ideals of justice and order. These Paladins meet the archetype of the knight in shining armor. They hold themselves to the highest standards of conduct, and some—for better or worse—hold the rest of the world to the same standards.\n\nMany who swear this oath are devoted to gods of law and good and use their gods' tenets as the measure of personal devotion. Others hold angels as their ideals and incorporate images of angelic wings into their helmets or coats of arms.\n\nThese paladins share the following tenets:",
      "features": [
        {
          "name": "Oath of Devotion Spells",
          "level": 3,
          "entries": [
            "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Devotion Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Sacred Weapon",
          "level": 3,
          "entries": [
            "When you take the Attack action, you can expend one use of your Channel Divinity to imbue one Melee weapon that you are holding with positive energy. For 10 minutes or until you use this feature again, you add your Charisma modifier to attack rolls you make with that weapon (minimum bonus of +1), and each time you hit with it, you cause it to deal its normal damage type or Radiant damage.",
            "The weapon also emits Bright Light in a 20-foot radius and Dim Light 20 feet beyond that.",
            "You can end this effect early (no action required). This effect also ends if you aren't carrying the weapon."
          ]
        },
        {
          "name": "Aura of Devotion",
          "level": 7,
          "entries": [
            "You and your allies have Immunity to the Charmed condition while in your Aura of Protection. If a Charmed ally enters the aura, that condition has no effect on that ally while there."
          ]
        },
        {
          "name": "Smite of Protection",
          "level": 15,
          "entries": [
            "Your magical smite now radiates protective energy. Whenever you cast Divine Smite, you and your allies have Cover while in your Aura of Protection. The aura has this benefit until the start of your next turn."
          ]
        },
        {
          "name": "Holy Nimbus",
          "level": 20,
          "entries": [
            "As a Bonus Action, you can imbue your Aura of Protection with holy power, granting the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
          ]
        }
      ]
    },
    "oath of glory": {
      "name": "Oath of Glory",
      "source": "XPHB",
      "className": "Paladin",
      "description": "Strive for the Heights of Heroism\n\nPaladins who take the Oath of Glory believe they and their companions are destined to achieve glory through deeds of heroism. They train diligently and encourage their companions, so they're all ready when destiny calls.\n\nThese paladins share the following tenets:",
      "features": [
        {
          "name": "Inspiring Smite",
          "level": 3,
          "entries": [
            "Immediately after you cast Divine Smite, you can expend one use of your Channel Divinity and distribute Temporary Hit Points to creatures of your choice within 30 feet of yourself, which can include you. The total number of Temporary Hit Points equals 2d8 plus your Paladin level, divided among the chosen creatures however you like."
          ]
        },
        {
          "name": "Oath of Glory Spells",
          "level": 3,
          "entries": [
            "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Glory Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Peerless Athlete",
          "level": 3,
          "entries": [
            "As a Bonus Action, you can expend one use of your Channel Divinity to augment your athleticism. For 1 hour, you have Advantage on Strength (Athletics) and Dexterity (Acrobatics) checks, and the distance of your Long and High Jumps increases by 10 feet (this extra distance costs movement as normal)."
          ]
        },
        {
          "name": "Aura of Alacrity",
          "level": 7,
          "entries": [
            "Your Speed increases by 10 feet.",
            "In addition, whenever an ally enters your Aura of Protection for the first time on a turn or starts their turn there, the ally's Speed increases by 10 feet until the end of their next turn."
          ]
        },
        {
          "name": "Glorious Defense",
          "level": 15,
          "entries": [
            "You can turn defense into a sudden strike. When you or another creature you can see within 10 feet of you is hit by an attack roll, you can take a Reaction to grant a bonus to the target's AC against that attack, potentially causing it to miss. The bonus equals your Charisma modifier (minimum of +1). If the attack misses, you can make one attack with a weapon against the attacker as part of this Reaction if the attacker is within your weapon's range.",
            "You can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Living Legend",
          "level": 20,
          "entries": [
            "You can empower yourself with the legends—whether true or exaggerated—of your great deeds. As a Bonus Action, you gain the benefits below for 10 minutes. Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
          ]
        }
      ]
    },
    "oath of the ancients": {
      "name": "Oath of the Ancients",
      "source": "XPHB",
      "className": "Paladin",
      "description": "Preserve Life and Light in the World\n\nThe Oath of the Ancients is as old as the first elves. Paladins who swear this oath cherish the light; they love the beautiful and life-giving things of the world more than any principles of honor, courage, and justice. They often adorn their armor and clothing with images of growing things—leaves, antlers, or flowers—to reflect their commitment to preserving life and light.\n\nThese paladins share the following tenets:",
      "features": [
        {
          "name": "Nature's Wrath",
          "level": 3,
          "entries": [
            "As a Magic action, you can expend one use of your Channel Divinity to conjure spectral vines around nearby creatures. Each creature of your choice that you can see within 15 feet of yourself must succeed on a Strength saving throw or have the Restrained condition for 1 minute. A Restrained creature repeats the save at the end of each of its turns, ending the effect on itself on a success."
          ]
        },
        {
          "name": "Oath of the Ancients Spells",
          "level": 3,
          "entries": [
            "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of the Ancients Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Aura of Warding",
          "level": 7,
          "entries": [
            "Ancient magic lies so heavily upon you that it forms an eldritch ward, blunting energy from beyond the Material Plane; you and your allies have Resistance to Necrotic, Psychic, and Radiant damage while in your Aura of Protection."
          ]
        },
        {
          "name": "Undying Sentinel",
          "level": 15,
          "entries": [
            "When you are reduced to 0 Hit Points and not killed outright, you can drop to 1 Hit Points instead, and you regain a number of Hit Points equal to three times your Paladin level. Once you use this feature, you can't do so again until you finish a Long Rest.",
            "Additionally, you can't be aged magically, and you cease visibly aging."
          ]
        },
        {
          "name": "Elder Champion",
          "level": 20,
          "entries": [
            "As a Bonus Action, you can imbue your Aura of Protection with primal power, granting the benefits below for 1 minute or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
          ]
        }
      ]
    },
    "oath of vengeance": {
      "name": "Oath of Vengeance",
      "source": "XPHB",
      "className": "Paladin",
      "description": "Punish Evildoers at Any Cost\n\nThe Oath of Vengeance is a solemn commitment to punish those who have committed grievously evil acts. When evil armies slaughter helpless villagers, when a tyrant defies the will of the gods, when a thieves' guild grows too violent, when a dragon rampages through the countryside—at times like these, paladins arise and swear an Oath of Vengeance to set right what has gone wrong.\n\nThese paladins share the following tenets:",
      "features": [
        {
          "name": "Oath of Vengeance Spells",
          "level": 3,
          "entries": [
            "The magic of your oath ensures you always have certain spells ready; when you reach a Paladin level specified in the Oath of Vengeance Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Vow of Enmity",
          "level": 3,
          "entries": [
            "When you take the Attack action, you can expend one use of your Channel Divinity to utter a vow of enmity against a creature you can see within 30 feet of yourself. You have Advantage on attack rolls against the creature for 1 minute or until you use this feature again.",
            "If the creature drops to 0 Hit Points before the vow ends, you can transfer the vow to a different creature within 30 feet of yourself (no action required)."
          ]
        },
        {
          "name": "Relentless Avenger",
          "level": 7,
          "entries": [
            "Your supernatural focus helps you close off a foe's retreat. When you hit a creature with an Opportunity Attack, you can reduce the creature's Speed to 0 until the end of the current turn. You can then move up to half your Speed as part of the same Reaction. This movement doesn't provoke Opportunity Attack."
          ]
        },
        {
          "name": "Soul of Vengeance",
          "level": 15,
          "entries": [
            "Immediately after a creature under the effect of your Vow of Enmity hits or misses with an attack roll, you can take a Reaction to make a melee attack against that creature if it's within range."
          ]
        },
        {
          "name": "Avenging Angel",
          "level": 20,
          "entries": [
            "As a Bonus Action, you gain the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required)."
          ]
        }
      ]
    }
  }
}
