{
  "detail": {
    "name": "Ranger",
    "source": "XPHB",
    "description": "Far from bustling cities, amid the trees of trackless forests and across wide plains, Rangers keep their unending watch in the wilderness. Rangers learn to track their quarry as a predator does, moving stealthily through the wilds and hiding themselves in brush and rubble.\n\nThanks to their connection with nature, Rangers can also cast spells that harness primal powers of the wilderness. A Ranger's talents and magic are honed with deadly focus to protect the world from the ravages of monsters and tyrants.",
    "primaryAbility": "Dexterity and Wisdom",
    "complexity": "Average",
    "hd": {
      "number": 1,
      "faces": 10
    },
    "proficiency": [
      "str",
      "dex"
    ],
    "startingProficiencies": {
      "armor": [
        "light",
        "medium",
        "shield"
      ],
      "weapons": [
        "simple",
        "martial"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "animal handling",
              "athletics",
              "insight",
              "investigation",
              "nature",
              "perception",
              "stealth",
              "survival"
            ],
            "count": 3
          }
        }
      ]
    },
    "subclasses": [
      "Beast Master",
      "Fey Wanderer",
      "Gloom Stalker",
      "Hunter"
    ],
    "features": [
      {
        "name": "Favored Enemy",
        "level": 1,
        "entries": [
          "You always have the Hunter's Mark spell prepared. You can cast it twice without expending a spell slot, and you regain all expended uses of this ability when you finish a Long Rest.",
          "The number of times you can cast the spell without a spell slot increases when you reach certain Ranger levels, as shown in the Favored Enemy column of the Ranger Features table."
        ]
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "entries": [
          "You have learned to channel the magical essence of nature to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Ranger spells, which appear in the Ranger spell list later in the class's description."
        ]
      },
      {
        "name": "Weapon Mastery",
        "level": 1,
        "entries": [
          "Your training with weapons allows you to use the weapon mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Longbow and Shortsword.",
          "Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the weapon mastery properties of Scimitar and Longsword."
        ]
      },
      {
        "name": "Deft Explorer",
        "level": 2,
        "entries": [
          "Thanks to your travels, you gain the following benefits."
        ]
      },
      {
        "name": "Fighting Style",
        "level": 2,
        "entries": [
          "You gain a Fighting Style feat of your choice. Instead of choosing one of those feats, you can choose the option below."
        ]
      },
      {
        "name": "Ranger Subclass",
        "level": 3,
        "entries": [
          "You gain a Ranger subclass of your choice. A subclass is a specialization that grants you features at certain Ranger levels. For the rest of your career, you gain each of your subclass's features that are of your Ranger level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Ranger levels 8, 12, and 16."
        ]
      },
      {
        "name": "Extra Attack",
        "level": 5,
        "entries": [
          "You can attack twice instead of once whenever you take the Attack action on your turn."
        ]
      },
      {
        "name": "Roving",
        "level": 6,
        "entries": [
          "Your Speed increases by 10 feet while you aren't wearing Heavy armor. You also have a Climb Speed and a Swim Speed equal to your Speed."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 7,
        "entries": [
          "You gain a feature from your Ranger Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Expertise",
        "level": 9,
        "entries": [
          "Choose two of your skill proficiencies with which you lack Expertise. You gain Expertise in those skills."
        ]
      },
      {
        "name": "Tireless",
        "level": 10,
        "entries": [
          "Primal forces now help fuel you on your journeys, granting you the following benefits."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 11,
        "entries": [
          "You gain a feature from your Ranger Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Relentless Hunter",
        "level": 13,
        "entries": [
          "Taking damage can't break your Concentration on Hunter's Mark."
        ]
      },
      {
        "name": "Nature's Veil",
        "level": 14,
        "entries": [
          "You invoke spirits of nature to magically hide yourself. As a Bonus Action, you can give yourself the Invisible condition until the end of your next turn.",
          "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 15,
        "entries": [
          "You gain a feature from your Ranger Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Precise Hunter",
        "level": 17,
        "entries": [
          "You have Advantage on attack rolls against the creature currently marked by your Hunter's Mark."
        ]
      },
      {
        "name": "Feral Senses",
        "level": 18,
        "entries": [
          "Your connection to the forces of nature grants you Blindsight with a range of 30 feet."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
        ]
      },
      {
        "name": "Foe Slayer",
        "level": 20,
        "entries": [
          "The damage die of your Hunter's Mark is a d10 rather than a d6."
        ]
      }
    ]
  },
  "subclasses": {
    "beast master": {
      "name": "Beast Master",
      "source": "XPHB",
      "className": "Ranger",
      "description": "Bond with a Primal Beast\n\nA Beast Master forms a mystical bond with a special animal, drawing on primal magic and a deep connection to the natural world.",
      "features": [
        {
          "name": "Primal Companion",
          "level": 3,
          "entries": [
            "You magically summon a primal beast, which draws strength from your bond with nature. Choose its stat block: Beast of the Land, Beast of the Sea, or Beast of the Sky. You also determine the kind of animal it is, choosing a kind appropriate for the stat block. Whatever beast you choose, it bears primal markings indicating its supernatural origin.",
            "The beast is Friendly to you and your allies and obeys your commands. It vanishes if you die."
          ]
        },
        {
          "name": "Exceptional Training",
          "level": 7,
          "entries": [
            "When you take a Bonus Action to command your Primal Companion beast to take an action, you can also command it to take the Dash, Disengage, Dodge, or Help action using its Bonus Action.",
            "In addition, whenever it hits with an attack roll and deals damage, it can deal your choice of Force damage or its normal damage type."
          ]
        },
        {
          "name": "Bestial Fury",
          "level": 11,
          "entries": [
            "When you command your Primal Companion beast to take the Beast's Strike action, the beast can use it twice.",
            "In addition, the first time each turn it hits a creature under the effect of your Hunter's Mark spell, the beast deals extra Force damage equal to the bonus damage of that spell."
          ]
        },
        {
          "name": "Share Spells",
          "level": 15,
          "entries": [
            "When you cast a spell targeting yourself, you can also affect your Primal Companion beast with the spell if the beast is within 30 feet of you."
          ]
        }
      ]
    },
    "fey wanderer": {
      "name": "Fey Wanderer",
      "source": "XPHB",
      "className": "Ranger",
      "description": "Wield Fey Mirth and Fury\n\nA fey mystique surrounds you, thanks to the boon of an archfey or a location in the Feywild that transformed you. However you gained fey magic, you are now a Fey Wanderer. Your joyful laughter brightens the hearts of the downtrodden, and your martial prowess strikes terror in your foes, for great is the mirth of the fey and dreadful is their fury.",
      "features": [
        {
          "name": "Dreadful Strikes",
          "level": 3,
          "entries": [
            "You can augment your weapon strikes with mind-scarring magic drawn from the murky hollows of the Feywild. When you hit a creature with a weapon, you can deal an extra 1d4 Psychic damage to the target, which can take this extra damage only once per turn. The extra damage increases to 1d6 when you reach Ranger level 11."
          ]
        },
        {
          "name": "Fey Wanderer Spells",
          "level": 3,
          "entries": [
            "When you reach a Ranger level specified in the Fey Wanderer Spells table, you thereafter always have the listed spells prepared.",
            "You also possess a fey blessing. Choose it from the Feywild Gifts table or determine it randomly."
          ]
        },
        {
          "name": "Otherworldly Glamour",
          "level": 3,
          "entries": [
            "Whenever you make a Charisma check, you gain a bonus to the check equal to your Wisdom modifier (minimum of +1).",
            "You also gain proficiency in one of these skills of your choice: Deception, Performance, or Persuasion."
          ]
        },
        {
          "name": "Beguiling Twist",
          "level": 7,
          "entries": [
            "The magic of the Feywild guards your mind. You have Advantage on saving throws to avoid or end the Charmed or Frightened condition.",
            "In addition, whenever you or a creature you can see within 120 feet of you succeeds on a saving throw to avoid or end the Charmed or Frightened condition, you can take a Reaction to force a different creature you can see within 120 feet of yourself to make a Wisdom save against your spell save DC. On a failed save, the target is Charmed or Frightened (your choice) for 1 minute. The target repeats the save at the end of each of its turns, ending the effect on itself on a success."
          ]
        },
        {
          "name": "Fey Reinforcements",
          "level": 11,
          "entries": [
            "You can cast Summon Fey without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest.",
            "Whenever you start casting the spell, you can modify it so that it doesn't require Concentration. If you do so, the spell's duration becomes 1 minute for that casting."
          ]
        },
        {
          "name": "Misty Wanderer",
          "level": 15,
          "entries": [
            "You can cast Misty Step without expending a spell slot. You can do so a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.",
            "In addition, whenever you cast Misty Step, you can bring along one willing creature you can see within 5 feet of yourself. That creature teleports to an unoccupied space of your choice within 5 feet of your destination space."
          ]
        }
      ]
    },
    "gloom stalker": {
      "name": "Gloom Stalker",
      "source": "XPHB",
      "className": "Ranger",
      "description": "Draw on Shadow Magic to Fight Your Foes\n\nGloom Stalkers are at home in the darkest places, wielding magic drawn from the Shadowfell to combat enemies that lurk in darkness.",
      "features": [
        {
          "name": "Dread Ambusher",
          "level": 3,
          "entries": [
            "You have mastered the art of creating fearsome ambushes, granting you the following benefits."
          ]
        },
        {
          "name": "Gloom Stalker Spells",
          "level": 3,
          "entries": [
            "When you reach a Ranger level specified in the Gloom Stalker Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Umbral Sight",
          "level": 3,
          "entries": [
            "You gain Darkvision with a range of 60 feet. If you already have Darkvision when you gain this feature, its range increases by 60 feet.",
            "You are also adept at evading creatures that rely on Darkvision. While entirely in Darkness, you have the Invisible condition to any creature that relies on Darkvision to see you in that Darkness."
          ]
        },
        {
          "name": "Iron Mind",
          "level": 7,
          "entries": [
            "You have honed your ability to resist mind-altering powers. You gain proficiency in Wisdom saving throws. If you already have this proficiency, you instead gain proficiency in Intelligence or Charisma saving throws (your choice)."
          ]
        },
        {
          "name": "Stalker's Flurry",
          "level": 11,
          "entries": [
            "The Psychic damage of your Dreadful Strike becomes 2d8. In addition, when you use the Dreadful Strike effect of your Dread Ambusher feature, you can cause one of the following additional effects."
          ]
        },
        {
          "name": "Shadowy Dodge",
          "level": 15,
          "entries": [
            "When a creature makes an attack roll against you, you can take a Reaction to impose Disadvantage on that roll. Whether the attack hits or misses, you can then teleport up to 30 feet to an unoccupied space you can see."
          ]
        }
      ]
    },
    "hunter": {
      "name": "Hunter",
      "source": "XPHB",
      "className": "Ranger",
      "description": "Protect Nature and People from Destruction\n\nYou stalk prey in the wilds and elsewhere, using your abilities as a Hunter to protect nature and people everywhere from forces that would destroy them.",
      "features": [
        {
          "name": "Hunter's Lore",
          "level": 3,
          "entries": [
            "You can call on the forces of nature to reveal certain strengths and weaknesses of your prey. While a creature is marked by your Hunter's Mark, you know whether that creature has any Immunities, Resistances, or Vulnerabilities, and if the creature has any, you know what they are."
          ]
        },
        {
          "name": "Hunter's Prey",
          "level": 3,
          "entries": [
            "You gain one of the following feature options of your choice. Whenever you finish a Short Rest or Long Rest, you can replace the chosen option with the other one."
          ]
        },
        {
          "name": "Defensive Tactics",
          "level": 7,
          "entries": [
            "You gain one of the following feature options of your choice. Whenever you finish a Short Rest or Long Rest, you can replace the chosen option with the other one."
          ]
        },
        {
          "name": "Superior Hunter's Prey",
          "level": 11,
          "entries": [
            "Once per turn when you deal damage to a creature marked by your Hunter's Mark, you can also deal that spell's extra damage to a different creature that you can see within 30 feet of the first creature."
          ]
        },
        {
          "name": "Superior Hunter's Defense",
          "level": 15,
          "entries": [
            "When you take damage, you can take a Reaction to give yourself Resistance to that damage and any other damage of the same type until the end of the current turn."
          ]
        }
      ]
    }
  }
}
