{
  "detail": {
    "name": "Rogue",
    "source": "XPHB",
    "description": "Rogues rely on cunning, stealth, and their foes' vulnerabilities to get the upper hand in any situation. They have a knack for finding the solution to just about any problem. A few even learn magical tricks to supplement their other abilities. Many Rogues focus on stealth and deception, while others refine skills that help them in a dungeon environment, such as climbing, finding and disarming traps, and opening locks.\n\nIn combat, Rogues prioritize subtle strikes over brute strength. They would rather make one precise strike than wear an opponent down with a barrage of blows.\n\nSome Rogues began their careers as criminals, while others used their cunning to fight crime. Whatever a Rogue's relation to the law, no common criminal or officer of the law can match the subtle brilliance of the greatest Rogues.",
    "primaryAbility": "Dexterity",
    "complexity": "Low",
    "hd": {
      "number": 1,
      "faces": 8
    },
    "proficiency": [
      "dex",
      "int"
    ],
    "startingProficiencies": {
      "armor": [
        "light"
      ],
      "weapons": [
        "simple",
        "Martial weapons that have the Finesse or Light property"
      ],
      "weaponProficiencies": [
        {
          "simple": true,
          "all": {
            "fromFilter": "type=martial weapon|property=light;finesse"
          }
        }
      ],
      "tools": [
        "Thieves' Tools"
      ],
      "toolProficiencies": [
        {
          "thieves' tools": true
        }
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "acrobatics",
              "athletics",
              "deception",
              "insight",
              "intimidation",
              "investigation",
              "perception",
              "persuasion",
              "sleight of hand",
              "stealth"
            ],
            "count": 4
          }
        }
      ]
    },
    "subclasses": [
      "Arcane Trickster",
      "Assassin",
      "Soulknife",
      "Thief"
    ],
    "features": [
      {
        "name": "Expertise",
        "level": 1,
        "entries": [
          "You gain Expertise in two of your skill proficiencies of your choice. Sleight of Hand and Stealth are recommended if you have proficiency in them.",
          "At Rogue level 6, you gain Expertise in two more of your skill proficiencies of your choice."
        ]
      },
      {
        "name": "Sneak Attack",
        "level": 1,
        "entries": [
          "You know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack roll if you have Advantage on the roll and the attack uses a Finesse or a Ranged weapon. The extra damage's type is the same as the weapon's type.",
          "You don't need Advantage on the attack roll if at least one of your allies is within 5 feet of the target, the ally doesn't have the Incapacitated condition, and you don't have Disadvantage on the attack roll.",
          "The extra damage increases as you gain Rogue levels, as shown in the Sneak Attack column of the Rogue Features table."
        ]
      },
      {
        "name": "Thieves' Cant",
        "level": 1,
        "entries": [
          "You picked up various languages in the communities where you plied your roguish talents. You know Thieves' Cant and one other language of your choice, which you choose from the language tables in chapter 2."
        ]
      },
      {
        "name": "Weapon Mastery",
        "level": 1,
        "entries": [
          "Your training with weapons allows you to use the weapon mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Dagger and Shortbow.",
          "Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the weapon mastery properties of Scimitar and Shortsword."
        ]
      },
      {
        "name": "Cunning Action",
        "level": 2,
        "entries": [
          "Your quick thinking and agility allow you to move and act quickly. On your turn, you can take one of the following actions as a Bonus Action: Dash, Disengage, or Hide."
        ]
      },
      {
        "name": "Rogue Subclass",
        "level": 3,
        "entries": [
          "You gain a Rogue subclass of your choice. A subclass is a specialization that grants you features at certain Rogue levels. For the rest of your career, you gain each of your subclass's features that are of your Rogue level or lower."
        ]
      },
      {
        "name": "Steady Aim",
        "level": 3,
        "entries": [
          "As a Bonus Action, you give yourself Advantage on your next attack roll on the current turn. You can use this feature only if you haven't moved during this turn, and after you use it, your Speed is 0 until the end of the current turn."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Rogue levels 8, 10, 12, and 16."
        ]
      },
      {
        "name": "Cunning Strike",
        "level": 5,
        "entries": [
          "You've developed cunning ways to use your Sneak Attack. When you deal Sneak Attack damage, you can add one of the following Cunning Strike effects. Each effect has a die cost, which is the number of Sneak Attack damage dice you must forgo to add the effect. You remove the die before rolling, and the effect occurs immediately after the attack's damage is dealt. For example, if you add the Poison effect, remove 1d6 from the Sneak Attack's damage before rolling.",
          "If a Cunning Strike effect requires a saving throw, the DC equals 8 plus your Dexterity modifier and Proficiency."
        ]
      },
      {
        "name": "Poison (Cost: 1d6)",
        "level": 5,
        "entries": [
          "You add a toxin to your strike, forcing the target to make a Constitution saving throw. On a failed save, the target has the Poisoned condition for 1 minute. At the end of each of its turns, the Poisoned target repeats the save, ending the effect on itself on a success.",
          "To use this effect, you must have a Poisoner's Kit on your person."
        ]
      },
      {
        "name": "Trip (Cost: 1d6)",
        "level": 5,
        "entries": [
          "If the target is Large or smaller, it must succeed on a Dexterity saving throw or have the Prone condition."
        ]
      },
      {
        "name": "Uncanny Dodge",
        "level": 5,
        "entries": [
          "When an attacker that you can see hits you with an attack roll, you can take a Reaction to halve the attack's damage against you (round down)."
        ]
      },
      {
        "name": "Withdraw (Cost: 1d6)",
        "level": 5,
        "entries": [
          "Immediately after the attack, you move up to half your Speed without provoking Opportunity Attack."
        ]
      },
      {
        "name": "Expertise",
        "level": 6,
        "entries": [
          "You gain Expertise in two of your Skill Proficiencies of your choice."
        ]
      },
      {
        "name": "Evasion",
        "level": 7,
        "entries": [
          "You can nimbly dodge out of the way of certain dangers. When you're subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw and only half damage if you fail. You can't use this feature if you have the Incapacitated condition."
        ]
      },
      {
        "name": "Reliable Talent",
        "level": 7,
        "entries": [
          "Whenever you make an ability check that uses one of your skill or tool proficiencies, you can treat a d20 roll of 9 or lower as a 10."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 9,
        "entries": [
          "You gain a feature from your Rogue Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 10,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Improved Cunning Strike",
        "level": 11,
        "entries": [
          "You can use up to two Cunning Strike effects when you deal Sneak Attack damage, paying the die cost for each effect."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 13,
        "entries": [
          "You gain a feature from your Rogue Subclass."
        ]
      },
      {
        "name": "Daze (Cost: 2d6)",
        "level": 14,
        "entries": [
          "The target must succeed on a Constitution saving throw, or on its next turn, it can do only one of the following: move or take an action or a Bonus Action."
        ]
      },
      {
        "name": "Devious Strikes",
        "level": 14,
        "entries": [
          "You've practiced new ways to use your Sneak Attack deviously. The following effects are now among your Cunning Strike options."
        ]
      },
      {
        "name": "Knock Out (Cost: 6d6)",
        "level": 14,
        "entries": [
          "The target must succeed on a Constitution saving throw, or it has the Unconscious condition for 1 minute or until it takes any damage. The Unconscious target repeats the save at the end of each of its turns, ending the effect on itself on a success."
        ]
      },
      {
        "name": "Obscure (Cost: 3d6)",
        "level": 14,
        "entries": [
          "The target must succeed on a Dexterity saving throw, or it has the Blinded condition until the end of its next turn."
        ]
      },
      {
        "name": "Slippery Mind",
        "level": 15,
        "entries": [
          "Your cunning mind is exceptionally difficult to control. You gain proficiency in Wisdom and Charisma saving throws."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 17,
        "entries": [
          "You gain a feature from your Rogue Subclass."
        ]
      },
      {
        "name": "Elusive",
        "level": 18,
        "entries": [
          "You're so evasive that attackers rarely gain the upper hand against you. No attack roll can have Advantage against you unless you have the Incapacitated condition."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of the Night Spirit is recommended."
        ]
      },
      {
        "name": "Stroke of Luck",
        "level": 20,
        "entries": [
          "You have a marvelous knack for succeeding when you need to. If you fail a D20 Test, you can turn the roll into a 20.",
          "Once you use this feature, you can't use it again until you finish a Short Rest or Long Rest."
        ]
      }
    ]
  },
  "subclasses": {
    "arcane trickster": {
      "name": "Arcane Trickster",
      "source": "XPHB",
      "className": "Rogue",
      "description": "Enhance Stealth with Arcane Spells\n\nSome Rogues enhance their fine-honed skills of stealth and agility with spells, learning magical tricks to aid them in their trade. Some Arcane Tricksters use their talents as pickpockets and burglars, while others are pranksters.",
      "features": [
        {
          "name": "Mage Hand Legerdemain",
          "level": 3,
          "entries": [
            "When you cast Mage Hand, you can cast it as a Bonus Action, and you can make the spectral hand Invisible. You can control the hand as a Bonus Action, and through it, you can make Dexterity (Sleight of Hand) checks."
          ]
        },
        {
          "name": "Spellcasting",
          "level": 3,
          "entries": [
            "You have learned to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules as an Arcane Trickster."
          ]
        },
        {
          "name": "Magical Ambush",
          "level": 9,
          "entries": [
            "If you have the Invisible condition when you cast a spell on a creature, it has Disadvantage on any saving throw it makes against the spell on the same turn."
          ]
        },
        {
          "name": "Versatile Trickster",
          "level": 13,
          "entries": [
            "You gain the ability to distract targets with your Mage Hand. When you use the Trip option of your Cunning Strike on a creature, you can also use that option on another creature within 5 feet of the spectral hand."
          ]
        },
        {
          "name": "Spell Thief",
          "level": 17,
          "entries": [
            "You gain the ability to magically steal the knowledge of how to cast a spell from another spellcaster.",
            "Immediately after a creature casts a spell that targets you or includes you in its area of effect, you can take a Reaction to force the creature to make an Intelligence saving throw. The DC equals your spell save DC. On a failed save, you negate the spell's effect against you, and you steal the knowledge of the spell if it is at least level 1 and of a level you can cast (it doesn't need to be a Wizard spell). For the next 8 hours, you have the spell prepared. The creature can't cast it until the 8 hours have passed.",
            "Once you steal a spell with this feature, you can't use this feature again until you finish a Long Rest."
          ]
        }
      ]
    },
    "assassin": {
      "name": "Assassin",
      "source": "XPHB",
      "className": "Rogue",
      "description": "Practice the Grim Art of Death\n\nAn Assassin's training focuses on using stealth, poison, and disguise to eliminate foes with deadly efficiency. While some Rogues who follow this path are hired killers, spies, or bounty hunters, the capabilities of this subclass are equally useful for adventurers facing a variety of monstrous enemies.",
      "features": [
        {
          "name": "Assassin's Tools",
          "level": 3,
          "entries": [
            "You gain a Disguise Kit and a Poisoner's Kit, and you have proficiency with them."
          ]
        },
        {
          "name": "Assassinate",
          "level": 3,
          "entries": [
            "You're adept at ambushing a target, granting you the following benefits."
          ]
        },
        {
          "name": "Infiltration Expertise",
          "level": 9,
          "entries": [
            "You are expert at the following techniques that aid your infiltrations."
          ]
        },
        {
          "name": "Envenom Weapons",
          "level": 13,
          "entries": [
            "When you use the Poison option of your Cunning Strike, the target also takes 2d6 Poison damage whenever it fails the saving throw. This damage ignores Resistance to Poison damage."
          ]
        },
        {
          "name": "Death Strike",
          "level": 17,
          "entries": [
            "When you hit with your Sneak Attack on the first round of a combat, the target must succeed on a Constitution saving throw (8 plus your Dexterity modifier and Proficiency), or the attack's damage is doubled against the target."
          ]
        }
      ]
    },
    "soulknife": {
      "name": "Soulknife",
      "source": "XPHB",
      "className": "Rogue",
      "description": "Strike Foes with Psionic Blades\n\nA Soulknife strikes with the mind, cutting through barriers both physical and psychic. These Rogues discover psionic power within themselves and channel it to do their roguish work. As a Soulknife, your psionic abilities might have haunted you since childhood, revealing their full potential only as you experienced the stress of adventure. Or you might have sought out an order of psychic adepts and spent years learning how to manifest your power.",
      "features": [
        {
          "name": "Psionic Power",
          "level": 3,
          "entries": [
            "You harbor a wellspring of psionic energy within yourself. It is represented by your Psionic Energy Dice, which fuel certain powers you have from this subclass. The Soulknife Energy Dice table shows the number of these dice you have when you reach certain Rogue levels, and the table shows the die size.",
            "Any features in this subclass that use a Psionic Energy Die use only the dice from this subclass. Some of your powers expend a Psionic Energy Die, as specified in a power's description, and you can't use a power if it requires you to use a die when your Psionic Energy Dice are all expended.",
            "You regain one of your expended Psionic Energy Dice when you finish a Short Rest, and you regain all of them when you finish a Long Rest.",
            "The first time you use this power after each Long Rest, you don't expend the Psionic Energy Die. All other times you use the power, you expend the die."
          ]
        },
        {
          "name": "Psychic Blades",
          "level": 3,
          "entries": [
            "You can manifest shimmering blades of psychic energy. Whenever you take the Attack action or make an Opportunity Attack, you can manifest a Psychic Blade in your free hand and make the attack with that blade. The magic blade has the following traits:",
            "The blade vanishes immediately after it hits or misses its target, and it leaves no mark if it deals damage.",
            "After you attack with the blade on your turn, you can make a melee or ranged attack with a second psychic blade as a Bonus Action on the same turn if your other hand is free to create it. The damage die of this bonus attack is 1d4 instead of 1d6."
          ]
        },
        {
          "name": "Psi-Bolstered Knack",
          "level": 3,
          "entries": [
            "If you fail an ability check using a skill or tool with which you have proficiency, you can roll one Psionic Energy Die and add the number rolled to the check, potentially turning failure into success. The die is expended only if the roll then succeeds."
          ]
        },
        {
          "name": "Psychic Whispers",
          "level": 3,
          "entries": [
            "You can establish telepathic communication between yourself and others. As a Magic action, choose one or more creatures you can see, up to a number of creatures equal to your Proficiency, and then roll one Psionic Energy Die. For a number of hours equal to the number rolled, the chosen creatures can speak telepathically with you, and you can speak telepathically with them. To send or receive a message (no action required), you and the other creature must be within 1 mile of each other. A creature can end the telepathic connection at any time (no action required)."
          ]
        },
        {
          "name": "Homing Strikes",
          "level": 9,
          "entries": [
            "If you make an attack roll with your Psychic Blade and miss the target, you can roll one Psionic Energy Die and add the number rolled to the attack roll. If this causes the attack to hit, the die is expended."
          ]
        },
        {
          "name": "Psychic Teleportation",
          "level": 9,
          "entries": [
            "As a Bonus Action, you manifest a Psychic Blade, expend one Psionic Energy Die and roll it, and throw the blade at an unoccupied space you can see up to a number of feet away equal to 10 times the number rolled. You then teleport to that space, and the blade vanishes."
          ]
        },
        {
          "name": "Soul Blades",
          "level": 9,
          "entries": [
            "You can now use the following powers with your Psychic Blades."
          ]
        },
        {
          "name": "Psychic Veil",
          "level": 13,
          "entries": [
            "You can weave a veil of psychic static to mask yourself. As a Magic action, you gain the Invisible condition for 1 hour or until you dismiss this effect (no action required). This invisibility ends early immediately after you deal damage to a creature or you force a creature to make a saving throw.",
            "Once you use this feature, you can't do so again until you finish a Long Rest unless you expend a Psionic Energy Die (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Rend Mind",
          "level": 17,
          "entries": [
            "You can sweep your Psychic Blades through a creature's mind. When you use your Psychic Blades to deal Sneak Attack damage to a creature, you can force that target to make a Wisdom saving throw (8 plus your Dexterity modifier and Proficiency). If the save fails, the target has the Stunned condition for 1 minute. The Stunned target repeats the save at the end of each of its turns, ending the effect on itself on a success.",
            "Once you use this feature, you can't do so again until you finish a Long Rest unless you expend three Psionic Energy Dice (no action required) to restore your use of it."
          ]
        }
      ]
    },
    "thief": {
      "name": "Thief",
      "source": "XPHB",
      "className": "Rogue",
      "description": "Hunt for Treasure as a Classic Adventurer\n\nA mix of burglar, treasure hunter, and explorer, you are the epitome of an adventurer. In addition to improving your agility and stealth, you gain abilities useful for delving into ruins and getting maximum benefit from the magic items you find there.",
      "features": [
        {
          "name": "Fast Hands",
          "level": 3,
          "entries": [
            "As a Bonus Action, you can do one of the following."
          ]
        },
        {
          "name": "Second-Story Work",
          "level": 3,
          "entries": [
            "You've trained to get into especially hard-to-reach places, granting you these benefits."
          ]
        },
        {
          "name": "Supreme Sneak",
          "level": 9,
          "entries": [
            "You gain the following Cunning Strike option."
          ]
        },
        {
          "name": "Use Magic Device",
          "level": 13,
          "entries": [
            "You've learned how to maximize use of magic items, granting you the following benefits."
          ]
        },
        {
          "name": "Thief's Reflexes",
          "level": 17,
          "entries": [
            "You are adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal Initiative and your second turn at your Initiative minus 10."
          ]
        }
      ]
    }
  }
}
