{
  "detail": {
    "name": "Sorcerer",
    "source": "XPHB",
    "description": "Sorcerers wield innate magic that is stamped into their being. Some Sorcerers can't name the origin of their power, while others trace it to strange events in their personal or family history. The blessing of a dragon or a dryad at a baby's birth or the strike of lightning from a clear sky might spark a Sorcerer's gift. So too might the gift of a deity, exposure to the strange magic of another plane of existence, or a glimpse into the inner workings of reality. Whatever the origin, the result is an indelible mark on the Sorcerer, a churning magic that can be passed down through generations.\n\nSorcerers don't learn magic; the raw, roiling power of magic is part of them. The essential art of a Sorcerer is learning to harness and channel that innate magic, allowing the Sorcerer to discover new and staggering ways to unleash their power. As Sorcerers master their innate magic, they grow more attuned to its origin, developing distinct powers that reflect its source.\n\nSorcerers are rare. Some family lines produce exactly one Sorcerer in every generation, but most of the time, the talents of sorcery appear as a fluke. People who have this magical power soon discover that it doesn't like to stay quiet. A Sorcerer's magic wants to be wielded.",
    "primaryAbility": "Charisma",
    "complexity": "High",
    "hd": {
      "number": 1,
      "faces": 6
    },
    "proficiency": [
      "con",
      "cha"
    ],
    "startingProficiencies": {
      "weapons": [
        "simple"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "arcana",
              "deception",
              "insight",
              "intimidation",
              "persuasion",
              "religion"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Aberrant Sorcery",
      "Clockwork Sorcery",
      "Draconic Sorcery",
      "Wild Magic Sorcery"
    ],
    "features": [
      {
        "name": "Innate Sorcery",
        "level": 1,
        "entries": [
          "An event in your past left an indelible mark on you, infusing you with simmering magic. As a Bonus Action, you can unleash that magic for 1 minute, during which you gain the following benefits:",
          "You can use this feature twice, and you regain all expended uses of it when you finish a Long Rest."
        ]
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "entries": [
          "Drawing from your innate magic, you can cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Sorcerer spells, which appear in the Sorcerer spell list later in the class's description."
        ]
      },
      {
        "name": "Font of Magic",
        "level": 2,
        "entries": [
          "You can tap into the wellspring of magic within yourself. This wellspring is represented by Sorcery Points, which allow you to create a variety of magical effects.",
          "You have 2 Sorcery Points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer Features table. You can't have more Sorcery Points than the number shown in the table for your level. You regain all expended Sorcery Points when you finish a Long Rest.",
          "You can use your Sorcery Points to fuel the options below, along with other features, such as Metamagic, that use those points."
        ]
      },
      {
        "name": "Metamagic",
        "level": 2,
        "entries": [
          "Because your magic flows from within, you can alter your spells to suit your needs; you gain two Metamagic options of your choice from \"Metamagic Options\" later in this class's description. You use the chosen options to temporarily modify spells you cast. To use an option, you must spend the number of Sorcery Points that it costs.",
          "You can use only one Metamagic option on a spell when you cast it unless otherwise noted in one of those options.",
          "Whenever you gain a Sorcerer level, you can replace one of your Metamagic options with one you don't know. You gain two more options at Sorcerer level 10 and two more at Sorcerer level 17."
        ]
      },
      {
        "name": "Metamagic Options",
        "level": 2,
        "entries": [
          "The following options are available to your Metamagic feature. The options are presented in alphabetical order."
        ]
      },
      {
        "name": "Sorcerer Subclass",
        "level": 3,
        "entries": [
          "You gain a Sorcerer subclass of your choice. A subclass is a specialization that grants you features at certain Sorcerer levels. For the rest of your career, you gain each of your subclass's features that are of your Sorcerer level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Sorcerer levels 8, 12, and 16."
        ]
      },
      {
        "name": "Sorcerous Restoration",
        "level": 5,
        "entries": [
          "When you finish a Short Rest, you can regain expended Sorcery Points, but no more than a number equal to half your Sorcerer level (round down). Once you use this feature, you can't do so again until you finish a Long Rest."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Sorcerer subclass."
        ]
      },
      {
        "name": "Sorcery Incarnate",
        "level": 7,
        "entries": [
          "If you have no uses of Innate Sorcery left, you can use it if you spend 2 Sorcery Points when you take the Bonus Action to activate it.",
          "In addition, while your Innate Sorcery feature is active, you can use up to two of your Metamagic options on each spell you cast."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Metamagic",
        "level": 10,
        "entries": [
          "Because your magic flows from within you, you can alter your spells to suit your needs; you gain two Metamagic options of your choice from the \"Metamagic Options\" section later in this class's description.",
          "You can use only one Metamagic option on a spell when you cast it, unless otherwise noted in one of those options.",
          "Whenever you gain a Sorcerer level, you can replace one of your Metamagic options with one you don't know."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 14,
        "entries": [
          "You gain a feature from your Sorcerer subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Metamagic",
        "level": 17,
        "entries": [
          "Because your magic flows from within you, you can alter your spells to suit your needs; you gain two Metamagic options of your choice from the \"Metamagic Options\" section later in this class's description.",
          "You can use only one Metamagic option on a spell when you cast it, unless otherwise noted in one of those options.",
          "Whenever you gain a Sorcerer level, you can replace one of your Metamagic options with one you don't know."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 18,
        "entries": [
          "You gain a feature from your Sorcerer subclass."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
        ]
      },
      {
        "name": "Arcane Apotheosis",
        "level": 20,
        "entries": [
          "While your Innate Sorcery feature is active, you can use one Metamagic option on each of your turns without spending Sorcery Points on it."
        ]
      }
    ]
  },
  "subclasses": {
    "aberrant sorcery": {
      "name": "Aberrant Sorcery",
      "source": "XPHB",
      "className": "Sorcerer",
      "description": "Wield Unnatural Psionic Power\n\nAn alien influence has wrapped its tendrils around your mind, giving you psionic power. You can now touch other minds with that power and alter the world around you. Will this power shine from you as a hopeful beacon to others? Or will you be a terror to those who feel the stab of your mind?\n\nPerhaps a psychic wind from the Astral Plane carried psionic energy to you, or you were exposed to the Far Realm's warping influence. Alternatively, you were implanted with a mind flayer tadpole, but your transformation into a mind flayer never occurred; now the tadpole's psionic power is yours. However you acquired this power, your mind is aflame with it.",
      "features": [
        {
          "name": "Psionic Spells",
          "level": 3,
          "entries": [
            "When you reach a Sorcerer level specified in the Psionic Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Telepathic Speech",
          "level": 3,
          "entries": [
            "You can form a telepathic connection between your mind and the mind of another. As a Bonus Action, choose one creature you can see within 30 feet of yourself. You and the chosen creature can communicate telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile). To understand each other, you each must mentally use a language the other knows.",
            "The telepathic connection lasts for a number of minutes equal to your Sorcerer level. It ends early if you use this ability to form a connection with a different creature."
          ]
        },
        {
          "name": "Psionic Sorcery",
          "level": 6,
          "entries": [
            "When you cast any level 1+ spell from your Psionic Spells feature, you can cast it by expending a spell slot as normal or by spending a number of Sorcery Points equal to the spell's level. If you cast the spell using Sorcery Points, it requires no Verbal or Somatic components, and it requires no Material components unless they are consumed by the spell or have a cost specified in it."
          ]
        },
        {
          "name": "Psychic Defenses",
          "level": 6,
          "entries": [
            "You have Resistance to Psychic damage, and you have Advantage on saving throws to avoid or end the Charmed or Frightened condition."
          ]
        },
        {
          "name": "Revelation in Flesh",
          "level": 14,
          "entries": [
            "You can unleash the aberrant truth hidden within yourself. As a Bonus Action, you can spend 1 Sorcery Point or more to magically alter your body for 10 minutes. For each Sorcery Point you spend, you gain one of the following benefits of your choice, the effects of which last until the alteration ends."
          ]
        },
        {
          "name": "Warping Implosion",
          "level": 18,
          "entries": [
            "You can unleash a space-warping anomaly. As a Magic action, you teleport to an unoccupied space you can see within 120 feet of yourself. Immediately after you disappear, each creature within 30 feet of the space you left must make a Strength saving throw against your spell save DC. On a failed save, a creature takes 3d10 Force damage and is pulled straight toward the space you left, ending in an unoccupied space as close to your former space as possible. On a successful save, the creature takes half as much damage only.",
            "Once you use this feature, you can't do so again until you finish a Long Rest unless you spend 5 Sorcery Points (no action required) to restore your use of it."
          ]
        }
      ]
    },
    "clockwork sorcery": {
      "name": "Clockwork Sorcery",
      "source": "XPHB",
      "className": "Sorcerer",
      "description": "Channel Cosmic Forces of Order\n\nThe cosmic force of order has suffused you with magic. That power arises from Mechanus or a realm like it—a plane of existence shaped entirely by clockwork efficiency. You or someone from your lineage might have become entangled in the machinations of modrons, the orderly beings who inhabit Mechanus. Perhaps your ancestor even took part in the Great Modron March. Whatever its origin within you, the power of order can seem strange to others, but for you, it's part of a vast and glorious system.",
      "features": [
        {
          "name": "Clockwork Spells",
          "level": 3,
          "entries": [
            "When you reach a Sorcerer level specified in the Clockwork Spells table, you thereafter always have the listed spells prepared.",
            "In addition, consult the Manifestations of Order table and choose or randomly determine a way your connection to order manifests while you are casting any of your Sorcerer spells."
          ]
        },
        {
          "name": "Restore Balance",
          "level": 3,
          "entries": [
            "Your connection to the plane of absolute order allows you to equalize chaotic moments. When a creature you can see within 60 feet of yourself is about to roll a d20 with Advantage or Disadvantage, you can take a Reaction to prevent the roll from being affected by Advantage and Disadvantage.",
            "You can use this feature a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Bastion of Law",
          "level": 6,
          "entries": [
            "You can tap into the grand equation of existence to imbue a creature with a shimmering shield of order. As a Magic action, you can expend 1 to 5 Sorcery Points to create a magical ward around yourself or another creature you can see within 30 feet of yourself. The ward is represented by a number of d8s equal to the number of Sorcery Points spent to create it. When the warded creature takes damage, it can expend a number of those dice, roll them, and reduce the damage taken by the total rolled on those dice.",
            "The ward lasts until you finish a Long Rest or until you use this feature again."
          ]
        },
        {
          "name": "Trance of Order",
          "level": 14,
          "entries": [
            "You gain the ability to align your consciousness with the endless calculations of Mechanus. As a Bonus Action, you can enter this state for 1 minute. For the duration, attack rolls against you can't benefit from Advantage, and whenever you make a D20 Test, you can treat a roll of 9 or lower on the d20 as a 10.",
            "Once you use this feature, you can't use it again until you finish a Long Rest unless you spend 5 Sorcery Points (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Clockwork Cavalcade",
          "level": 18,
          "entries": [
            "You momentarily summon spirits of order to expunge disorder around you. As a Magic action, you summon the spirits in a 30-foot Cube [Area of Effect] originating from you. The spirits look like modrons or other Constructs of your choice. The spirits are intangible and invulnerable, and they create the effects below within the Cube [Area of Effect] before vanishing. Once you use this action, you can't use it again until you finish a Long Rest unless you spend 7 Sorcery Points (no action required) to restore your use of it."
          ]
        }
      ]
    },
    "draconic sorcery": {
      "name": "Draconic Sorcery",
      "source": "XPHB",
      "className": "Sorcerer",
      "description": "Breathe the Magic of Dragons\n\nYour innate magic comes from the gift of a dragon. Perhaps an ancient dragon facing death bequeathed some of its magical power to you or your ancestor. You might have absorbed magic from a site infused with dragons' power. Or perhaps you handled a treasure taken from a dragon's hoard that was steeped in draconic power. Or you might have a dragon for an ancestor.",
      "features": [
        {
          "name": "Draconic Spells",
          "level": 3,
          "entries": [
            "When you reach a Sorcerer level specified in the Draconic Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Draconic Resilience",
          "level": 3,
          "entries": [
            "The magic in your body manifests physical traits of your draconic gift. Your Hit Points maximum increases by 3, and it increases by 1 whenever you gain another Sorcerer level.",
            "Parts of you are also covered by dragon-like scales. While you aren't wearing armor, your base Armor Class equals 10 plus your Dexterity and Charisma modifiers."
          ]
        },
        {
          "name": "Elemental Affinity",
          "level": 6,
          "entries": [
            "Your draconic magic has an affinity with a damage type associated with dragons. Choose one of those types: Acid, Cold, Fire, Lightning, or Poison.",
            "You have Resistance to that damage type, and when you cast a spell that deals damage of that type, you can add your Charisma modifier to one damage roll of that spell."
          ]
        },
        {
          "name": "Dragon Wings",
          "level": 14,
          "entries": [
            "As a Bonus Action, you can cause draconic wings to appear on your back. The wings last for 1 hour or until you dismiss them (no action required). For the duration, you have a Fly Speed of 60 feet.",
            "Once you use this feature, you can't use it again until you finish a Long Rest unless you spend 3 Sorcery Points (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Dragon Companion",
          "level": 18,
          "entries": [
            "You can cast Summon Dragon without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest.",
            "Whenever you start casting the spell, you can modify it so that it doesn't require Concentration. If you do so, the spell's duration becomes 1 minute for that casting."
          ]
        }
      ]
    },
    "wild magic sorcery": {
      "name": "Wild Magic Sorcery",
      "source": "XPHB",
      "className": "Sorcerer",
      "description": "Unleash Chaotic Magic\n\nYour innate magic stems from the forces of chaos that underlie the order of creation. You or an ancestor might have endured exposure to raw magic, perhaps through a planar portal leading to Limbo or the Elemental Planes. Perhaps you were blessed by a fey being or marked by a demon. Or your magic could be a fluke with no apparent cause. Whatever its source, this magic churns within you, waiting for any outlet.",
      "features": [
        {
          "name": "Tides of Chaos",
          "level": 3,
          "entries": [
            "You can manipulate chaos itself to give yourself Advantage on one D20 Test before you roll the d20. Once you do so, you must cast a Sorcerer spell with a spell slot or finish a Long Rest before you can use this feature again.",
            "If you do cast a Sorcerer spell with a spell slot before you finish a Long Rest, you automatically roll on the Wild Magic Surge table."
          ]
        },
        {
          "name": "Wild Magic Surge",
          "level": 3,
          "entries": [
            "Your spellcasting can unleash surges of untamed magic. Once per turn, you can roll 1d20 immediately after you cast a Sorcerer spell with a spell slot. If you roll a 20, roll on the Wild Magic Surge table to create a magical effect.",
            "If the magical effect is a spell, it is too wild to be affected by your Metamagic."
          ]
        },
        {
          "name": "Bend Luck",
          "level": 6,
          "entries": [
            "You have the ability to twist fate using your wild magic. Immediately after another creature you can see rolls the d20 for a D20 Test, you can take a Reaction and spend 1 Sorcery Point to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the d20 roll."
          ]
        },
        {
          "name": "Controlled Chaos",
          "level": 14,
          "entries": [
            "You gain a modicum of control over the surges of your wild magic. Whenever you roll on the Wild Magic Surge table, you can roll twice and use either number."
          ]
        },
        {
          "name": "Tamed Surge",
          "level": 18,
          "entries": [
            "Immediately after you cast a Sorcerer spell with a spell slot, you can create an effect of your choice from the Wild Magic Surge table instead of rolling on that table. You can choose any effect in the table except for the final row, and if the chosen effect involves a roll, you must make it.",
            "Once you use this feature, you can't do so again until you finish a Long Rest."
          ]
        }
      ]
    }
  }
}
