{
  "detail": {
    "name": "Warlock",
    "source": "XPHB",
    "description": "Warlocks quest for knowledge that lies hidden in the fabric of the multiverse. They often begin their search for magical power by delving into tomes of forbidden lore, dabbling in invocations meant to attract the power of extraplanar beings, or seeking places of power where the influence of these beings can be felt. In no time, each Warlock is drawn into a binding pact with a powerful patron. Drawing on the ancient knowledge of beings such as angels, archfey, demons, devils, hags, and alien entities of the Far Realm, Warlocks piece together arcane secrets to bolster their own power.\n\nWarlocks view their patrons as resources, as means to the end of achieving magical power. Some Warlocks respect, revere, or even love their patrons; some serve their patrons grudgingly; and some seek to undermine their patrons even as they wield the power their patrons have given them.\n\nOnce a pact is made, a Warlock's thirst for knowledge and power can't be slaked with mere study. Most Warlocks spend their days pursuing greater power and deeper knowledge, which typically means some kind of adventure.",
    "primaryAbility": "Charisma",
    "complexity": "High",
    "hd": {
      "number": 1,
      "faces": 8
    },
    "proficiency": [
      "wis",
      "cha"
    ],
    "startingProficiencies": {
      "armor": [
        "light"
      ],
      "weapons": [
        "simple"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "arcana",
              "deception",
              "history",
              "intimidation",
              "investigation",
              "nature",
              "religion"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Archfey Patron",
      "Celestial Patron",
      "Fiend Patron",
      "Great Old One Patron"
    ],
    "features": [
      {
        "name": "Eldritch Invocation Options",
        "level": 1,
        "entries": [
          "Eldritch Invocation options appear in alphabetical order."
        ]
      },
      {
        "name": "Eldritch Invocations",
        "level": 1,
        "entries": [
          "You have unearthed Eldritch Invocations, pieces of forbidden knowledge that imbue you with an abiding magical ability or other lessons. You gain one invocation of your choice, such as Pact of the Tome. Invocations are described in the \"Eldritch Invocation Options\" section later in this class's description.",
          "When you gain certain Warlock levels, you gain more invocations of your choice, as shown in the Invocations column of the Warlock Features table.",
          "You can't pick the same invocation more than once unless its description says otherwise."
        ]
      },
      {
        "name": "Pact Magic",
        "level": 1,
        "entries": [
          "Through occult ceremony, you have formed a pact with a mysterious entity to gain magical powers. The entity is a voice in the shadows—its identity unclear—but its boon to you is concrete: the ability to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Warlock spells, which appear in the Warlock spell list later in the class's description.",
          "The number of spells on your list increases as you gain Warlock levels, as shown in the Prepared Spells column of the Warlock Features table. Whenever that number increases, choose additional Warlock spells until the number of spells on your list matches the number in the table. The chosen spells must be of a level no higher than what's shown in the table's Slot Level column for your level. When you reach level 6, for example, you learn a new Warlock spell, which can be of levels 1–3.",
          "If another Warlock feature gives you spells that you always have prepared, those spells don't count against the number of spells you can prepare with this feature, but those spells otherwise count as Warlock spells for you."
        ]
      },
      {
        "name": "Magical Cunning",
        "level": 2,
        "entries": [
          "You can perform an esoteric rite for 1 minute. At the end of it, you regain expended Pact Magic spell slots but no more than a number equal to half your maximum (round up). Once you use this feature, you can't do so again until you finish a Long Rest."
        ]
      },
      {
        "name": "Warlock Subclass",
        "level": 3,
        "entries": [
          "You gain a Warlock subclass of your choice. A subclass is a specialization that grants you features at certain Warlock levels. For the rest of your career, you gain each of your subclass's features that are of your Warlock level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Warlock levels 8, 12, and 16."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Warlock subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Contact Patron",
        "level": 9,
        "entries": [
          "In the past, you usually contacted your patron through intermediaries. Now you can communicate directly; you always have the Contact Other Plane spell prepared. With this feature, you can cast the spell without expending a spell slot to contact your patron, and you automatically succeed on the spell's saving throw.",
          "Once you cast the spell with this feature, you can't do so in this way again until you finish a Long Rest."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 10,
        "entries": [
          "You gain a feature from your Warlock subclass."
        ]
      },
      {
        "name": "Mystic Arcanum",
        "level": 11,
        "entries": [
          "Your patron grants you a magical secret called an arcanum. Choose one level 6 Warlock spell as this arcanum.",
          "You can cast your arcanum spell once without expending a spell slot, and you must finish a Long Rest before you can cast it in this way again.",
          "As shown in the Warlock Features table, you gain another Warlock spell of your choice that can be cast in this way when you reach Warlock levels 13 (level 7 spell), 15 (level 8 spell), and 17 (level 9 spell). You regain all uses of your Mystic Arcanum when you finish a Long Rest.",
          "Whenever you gain a Warlock level, you can replace one of your arcanum spells with another Warlock spell of the same level."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Mystic Arcanum",
        "level": 13,
        "entries": [
          "You gain a level 7 Warlock Spell of your choice."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 14,
        "entries": [
          "You gain a feature from your Warlock subclass."
        ]
      },
      {
        "name": "Mystic Arcanum",
        "level": 15,
        "entries": [
          "You gain a level 8 Warlock Spell of your choice."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Mystic Arcanum",
        "level": 17,
        "entries": [
          "You gain a level 9 Warlock Spell of your choice."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Fate is recommended."
        ]
      },
      {
        "name": "Eldritch Master",
        "level": 20,
        "entries": [
          "When you use your Magical Cunning feature, you regain all your expended Pact Magic spell slots."
        ]
      }
    ]
  },
  "subclasses": {
    "archfey patron": {
      "name": "Archfey Patron",
      "source": "XPHB",
      "className": "Warlock",
      "description": "Bargain with Whimsical Fey\n\nYour pact draws on the power of the Feywild. When you choose this subclass, you might make a deal with an archfey, such as the Prince of Frost; the Queen of Air and Darkness, ruler of the Gloaming Court; Titania of the Summer Court; or an ancient hag. Or you might call on a spectrum of Fey, weaving a web of favors and debts. Whoever they are, your patron is often inscrutable and whimsical.",
      "features": [
        {
          "name": "Archfey Spells",
          "level": 3,
          "entries": [
            "The magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Archfey Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Steps of the Fey",
          "level": 3,
          "entries": [
            "Your patron grants you the ability to move between the boundaries of the planes. You can cast Misty Step without expending a spell slot a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.",
            "In addition, whenever you cast that spell, you can choose one of the following additional effects."
          ]
        },
        {
          "name": "Misty Escape",
          "level": 6,
          "entries": [
            "You can cast Misty Step as a Reaction in response to taking damage.",
            "In addition, the following effects are now among your Steps of the Fey options."
          ]
        },
        {
          "name": "Beguiling Defenses",
          "level": 10,
          "entries": [
            "Your patron teaches you how to guard your mind and body. You are immune to the Charmed condition.",
            "In addition, immediately after a creature you can see hits you with an attack roll, you can take a Reaction to reduce the damage you take by half (round down), and you can force the attacker to make a Wisdom saving throw against your spell save DC. On a failed save, the attacker takes Psychic damage equal to the damage you take. Once you use this Reaction, you can't use it again until you finish a Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Bewitching Magic",
          "level": 14,
          "entries": [
            "Your patron grants you the ability to weave your magic with teleportation. Immediately after you cast an Enchantment or Illusion spell using an action and a spell slot, you can cast Misty Step as part of the same action and without expending a spell slot."
          ]
        }
      ]
    },
    "celestial patron": {
      "name": "Celestial Patron",
      "source": "XPHB",
      "className": "Warlock",
      "description": "Call on the Power of the Heavens\n\nYour pact draws on the Upper Planes, the realms of everlasting bliss. You might enter an agreement with an empyrean, a couatl, a sphinx, a unicorn, or another heavenly entity. Or you might call on numerous such beings as you pursue goals aligned with theirs. Your pact allows you to experience a hint of the holy light that illuminates the multiverse.",
      "features": [
        {
          "name": "Celestial Spells",
          "level": 3,
          "entries": [
            "The magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Celestial Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Healing Light",
          "level": 3,
          "entries": [
            "You gain the ability to channel celestial energy to heal wounds. You have a pool of d6s to fuel this healing. The number of dice in the pool equals 1 plus your Warlock level.",
            "As a Bonus Action, you can heal yourself or one creature you can see within 60 feet of yourself, expending dice from the pool. The maximum number of dice you can expend at once equals your Charisma modifier (minimum of one die). Roll the dice you expend, and restore a number of Hit Points equal to the roll's total. Your pool regains all expended dice when you finish a Long Rest."
          ]
        },
        {
          "name": "Radiant Soul",
          "level": 6,
          "entries": [
            "Your link to your patron allows you to serve as a conduit for radiant energy. You have Resistance to Radiant damage. Once per turn, when a spell you cast deals Radiant or Fire damage, you can add your Charisma modifier to that spell's damage against one of the spell's targets."
          ]
        },
        {
          "name": "Celestial Resilience",
          "level": 10,
          "entries": [
            "You gain Temporary Hit Points whenever you use your Magical Cunning feature or finish a Short Rest or Long Rest. These Temporary Hit Points equal your Warlock level plus your Charisma modifier. Additionally, choose up to five creatures you can see when you gain the points. Those creatures each gain Temporary Hit Points equal to half your Warlock level plus your Charisma modifier."
          ]
        },
        {
          "name": "Searing Vengeance",
          "level": 14,
          "entries": [
            "When you or an ally within 60 feet of you is about to make a Death Saving Throw, you can unleash radiant energy to save the creature. The creature regains Hit Points equal to half its Hit Points maximum and can end the Prone condition on itself. Each creature of your choice that is within 30 feet of the creature takes Radiant damage equal to 2d8 plus your Charisma modifier, and each has the Blinded condition until the end of the current turn.",
            "Once you use this feature, you can't use it again until you finish a Long Rest."
          ]
        }
      ]
    },
    "fiend patron": {
      "name": "Fiend Patron",
      "source": "XPHB",
      "className": "Warlock",
      "description": "Make a Deal with the Lower Planes\n\nYour pact draws on the Lower Planes, the realms of perdition. You might forge a bargain with a demon lord such as Demogorgon or Orcus; an archdevil such as Asmodeus; or a pit fiend, balor, yugoloth, or night hag that is especially mighty. That patron's aims are evil—the corruption or destruction of all things, ultimately including you—and your path is defined by the extent to which you strive against those aims.",
      "features": [
        {
          "name": "Dark One's Blessing",
          "level": 3,
          "entries": [
            "When you reduce an enemy to 0 Hit Points, you gain Temporary Hit Points equal to your Charisma modifier plus your Warlock level (minimum of 1 Temporary Hit Points). You also gain this benefit if someone else reduces an enemy within 10 feet of you to 0 Hit Points."
          ]
        },
        {
          "name": "Fiend Spells",
          "level": 3,
          "entries": [
            "The magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Fiend Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Dark One's Own Luck",
          "level": 6,
          "entries": [
            "You can call on your fiendish patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add 1d10 to your roll. You can do so after seeing the roll but before any of the roll's effects occur.",
            "You can use this feature a number of times equal to your Charisma modifier (minimum of once), but you can use it no more than once per roll. You regain all expended uses when you finish a Long Rest."
          ]
        },
        {
          "name": "Fiendish Resilience",
          "level": 10,
          "entries": [
            "Choose one damage type, other than Force, whenever you finish a Short Rest or Long Rest. You have Resistance to that damage type until you choose a different one with this feature."
          ]
        },
        {
          "name": "Hurl Through Hell",
          "level": 14,
          "entries": [
            "Once per turn when you hit a creature with an attack roll, you can try to instantly transport the target through the Lower Planes. The target must succeed on a Charisma saving throw against your spell save DC, or the target disappears and hurtles through a nightmare landscape. The target takes 8d10 Psychic damage if it isn't a Fiend, and it has the Incapacitated condition until the end of your next turn, when it returns to the space it previously occupied or the nearest unoccupied space.",
            "Once you use this feature, you can't use it again until you finish a Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it."
          ]
        }
      ]
    },
    "great old one patron": {
      "name": "Great Old One Patron",
      "source": "XPHB",
      "className": "Warlock",
      "description": "Unearth Forbidden Lore of Ineffable Beings\n\nWhen you choose this subclass, you might bind yourself to an unspeakable being from the Far Realm or an elder god—a being such as Tharizdun, the Chained God; Zargon, the Returner; Hadar, the Dark Hunger; or Great Cthulhu. Or you might invoke several entities without yoking yourself to one. The motives of these beings are incomprehensible, and the Great Old One might be indifferent to your existence. But the secrets you've learned nevertheless allow you to draw strange magic from it.",
      "features": [
        {
          "name": "Awakened Mind",
          "level": 3,
          "entries": [
            "You can form a telepathic connection between your mind and the mind of another. As a Bonus Action, choose one creature you can see within 30 feet of yourself. You and the chosen creature can communicate telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile). To understand each other, you each must mentally use a language the other knows.",
            "The telepathic connection lasts for a number of minutes equal to your Warlock level. It ends early if you use this feature to connect with a different creature."
          ]
        },
        {
          "name": "Great Old One Spells",
          "level": 3,
          "entries": [
            "The magic of your patron ensures you always have certain spells ready; when you reach a Warlock level specified in the Great Old One Spells table, you thereafter always have the listed spells prepared."
          ]
        },
        {
          "name": "Psychic Spells",
          "level": 3,
          "entries": [
            "When you cast a Warlock spell that deals damage, you can change its damage type to Psychic. In addition, when you cast a Warlock spell that is an Enchantment or Illusions, you can do so without Verbal or Somatic components."
          ]
        },
        {
          "name": "Clairvoyant Combatant",
          "level": 6,
          "entries": [
            "When you form a telepathic bond with a creature using your Awakened Mind, you can force that creature to make a Wisdom saving throw against your spell save DC. On a failed save, the creature has Disadvantage on attack rolls against you, and you have Advantage on attack rolls against that creature for the duration of the bond.",
            "Once you use this feature, you can't use it again until you finish a Short Rest or Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it."
          ]
        },
        {
          "name": "Eldritch Hex",
          "level": 10,
          "entries": [
            "Your alien patron grants you a powerful curse. You always have the Hex spell prepared. When you cast Hex and choose an ability, the target also has Disadvantage on saving throws of the chosen ability for the duration of the spell."
          ]
        },
        {
          "name": "Thought Shield",
          "level": 10,
          "entries": [
            "Your thoughts can't be read by telepathy or other means unless you allow it. You also have Resistance to Psychic damage, and whenever a creature deals Psychic damage to you, that creature takes the same amount of damage that you take."
          ]
        },
        {
          "name": "Create Thrall",
          "level": 14,
          "entries": [
            "When you cast Summon Aberration, you can modify it so that it doesn't require Concentration. If you do so, the spell's duration becomes 1 minute for that casting, and when summoned, the Aberration has a number of Temporary Hit Points equal to your Warlock level plus your Charisma modifier.",
            "In addition, the first time each turn the Aberration hits a creature under the effect of your Hex, the Aberration deals extra Psychic damage to the target equal to the bonus damage of that spell."
          ]
        }
      ]
    }
  }
}
