{
  "detail": {
    "name": "Wizard",
    "source": "XPHB",
    "description": "Wizards are defined by their exhaustive study of magic's inner workings. They cast spells of explosive fire, arcing lightning, subtle deception, and spectacular transformations. Their magic conjures monsters from other planes of existence, glimpses the future, or forms protective barriers. Their mightiest spells change one substance into another, call meteors from the sky, or open portals to other worlds.\n\nMost Wizards share a scholarly approach to magic. They examine the theoretical underpinnings of magic, particularly the categorization of spells into schools of magic. Renowned Wizards such as Bigby, Tasha, Mordenkainen, and Yolande have built on their studies to invent iconic spells now used across the multiverse.\n\nThe closest a Wizard is likely to come to an ordinary life is working as a sage or lecturer. Other Wizards sell their services as advisers, serve in military forces, or pursue lives of crime or domination.\n\nBut the lure of knowledge calls even the most unadventurous Wizards from the safety of their libraries and laboratories and into crumbling ruins and lost cities. Most Wizards believe that their counterparts in ancient civilizations knew secrets of magic that have been lost to the ages, and discovering those secrets could unlock the path to a power greater than any magic available in the present age.",
    "primaryAbility": "Intelligence",
    "complexity": "Average",
    "hd": {
      "number": 1,
      "faces": 6
    },
    "proficiency": [
      "int",
      "wis"
    ],
    "startingProficiencies": {
      "weapons": [
        "simple"
      ],
      "skills": [
        {
          "choose": {
            "from": [
              "arcana",
              "history",
              "insight",
              "investigation",
              "medicine",
              "nature",
              "religion"
            ],
            "count": 2
          }
        }
      ]
    },
    "subclasses": [
      "Abjurer",
      "Diviner",
      "Evoker",
      "Illusionist"
    ],
    "features": [
      {
        "name": "Arcane Recovery",
        "level": 1,
        "entries": [
          "You can regain some of your magical energy by studying your spellbook. When you finish a Short Rest, you can choose expended spell slots to recover. The spell slots can have a combined level equal to no more than half your Wizard level (round up), and none of the slots can be level 6 or higher. For example, if you're a level 4 Wizard, you can recover up to two levels' worth of spell slots, regaining either one level 2 spell slot or two level 1 spell slots.",
          "Once you use this feature, you can't do so again until you finish a Long Rest."
        ]
      },
      {
        "name": "Ritual Adept",
        "level": 1,
        "entries": [
          "You can cast any spell as a Ritual if that spell has the Ritual tag and the spell is in your spellbook. You needn't have the spell prepared, but you must read from the book to cast a spell in this way."
        ]
      },
      {
        "name": "Spellcasting",
        "level": 1,
        "entries": [
          "As a student of arcane magic, you have learned to cast spells. See chapter 7 for the rules on spellcasting. The information below details how you use those rules with Wizard spells, which appear in the Wizard spell list later in the class's description."
        ]
      },
      {
        "name": "Scholar",
        "level": 2,
        "entries": [
          "While studying magic, you also specialized in another field of study. Choose one of the following skills in which you have proficiency: Arcana, History, Investigation, Medicine, Nature, or Religion. You have Expertise in the chosen skill."
        ]
      },
      {
        "name": "Wizard Subclass",
        "level": 3,
        "entries": [
          "You gain a Wizard subclass of your choice. A subclass is a specialization that grants you features at certain Wizard levels. For the rest of your career, you gain each of your subclass's features that are of your Wizard level or lower."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 4,
        "entries": [
          "You gain the Ability Score Improvement feat or another feat of your choice for which you qualify. You gain this feature again at Wizard levels 8, 12, and 16."
        ]
      },
      {
        "name": "Memorize Spell",
        "level": 5,
        "entries": [
          "Whenever you finish a Short Rest, you can study your spellbook and replace one of the level 1+ Wizard spells you have prepared for your Spellcasting feature with another level 1+ spell from the book."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 6,
        "entries": [
          "You gain a feature from your Wizard Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 8,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 10,
        "entries": [
          "You gain a feature from your Wizard Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 12,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Subclass Feature",
        "level": 14,
        "entries": [
          "You gain a feature from your Wizard Subclass."
        ]
      },
      {
        "name": "Ability Score Improvement",
        "level": 16,
        "entries": [
          "You gain the Ability Score Improvement Feat or another feat of your choice for which you qualify."
        ]
      },
      {
        "name": "Spell Mastery",
        "level": 18,
        "entries": [
          "You have achieved such mastery over certain spells that you can cast them at will. Choose a level 1 and a level 2 spell in your spellbook that have a casting time of an action. You always have those spells prepared, and you can cast them at their lowest level without expending a spell slot. To cast either spell at a higher level, you must expend a spell slot.",
          "Whenever you finish a Long Rest, you can study your spellbook and replace one of those spells with an eligible spell of the same level from the book."
        ]
      },
      {
        "name": "Epic Boon",
        "level": 19,
        "entries": [
          "You gain an Epic Boon feat or another feat of your choice for which you qualify. Boon of Spell Recall is recommended."
        ]
      },
      {
        "name": "Signature Spells",
        "level": 20,
        "entries": [
          "Choose two level 3 spells in your spellbook as your signature spells. You always have these spells prepared, and you can cast each of them once at level 3 without expending a spell slot. When you do so, you can't cast them in this way again until you finish a Short Rest or Long Rest. To cast either spell at a higher level, you must expend a spell slot."
        ]
      }
    ]
  },
  "subclasses": {
    "abjurer": {
      "name": "Abjurer",
      "source": "XPHB",
      "className": "Wizard",
      "description": "Shield Companions and Banish Foes\n\nYour study of magic is focused on spells that block, banish, or protect—ending harmful effects, banishing evil influences, and protecting the weak. Abjurers are sought when baleful spirits require exorcism, when locations must be guarded against magical spying, and when portals to other planes of existence must be closed. Adventuring parties value Abjurers for the protection they provide against a variety of hostile magic and other attacks.",
      "features": [
        {
          "name": "Abjuration Savant",
          "level": 3,
          "entries": [
            "Choose two Wizard spells from the Abjuration school, each of which must be no higher than level 2, and add them to your spellbook for free.",
            "In addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Abjuration school to your spellbook for free. The chosen spell must be of a level for which you have spell slots."
          ]
        },
        {
          "name": "Arcane Ward",
          "level": 3,
          "entries": [
            "You can weave magic around yourself for protection. When you cast an Abjuration spell with a spell slot, you can simultaneously use a strand of the spell's magic to create a magical ward on yourself that lasts until you finish a Long Rest. The ward has a Hit Points maximum equal to twice your Wizard level plus your Intelligence modifier. Whenever you take damage, the ward takes the damage instead, and if you have any Resistances or Vulnerabilities, apply them before reducing the ward's Hit Points. If the damage reduces the ward to 0 Hit Points, you take any remaining damage. While the ward has 0 Hit Points, it can't absorb damage, but its magic remains.",
            "Whenever you cast an Abjuration spell with a spell slot, the ward regains a number of Hit Points equal to twice the level of the spell slot. Alternatively, as a Bonus Action, you can expend a spell slot, and the ward regains a number of Hit Points equal to twice the level of the spell slot expended.",
            "Once you create the ward, you can't create it again until you finish a Long Rest."
          ]
        },
        {
          "name": "Projected Ward",
          "level": 6,
          "entries": [
            "When a creature that you can see within 30 feet of yourself takes damage, you can take a Reaction to cause your Arcane Ward to absorb that damage. If this damage reduces the ward to 0 Hit Points, the warded creature takes any remaining damage. If that creature has any Resistances or Vulnerabilities, apply them before reducing the ward's Hit Points."
          ]
        },
        {
          "name": "Spell Breaker",
          "level": 10,
          "entries": [
            "You always have the Counterspell and Dispel Magic spells prepared. In addition, you can cast Dispel Magic as a Bonus Action, and you can add your Proficiency to its ability check.",
            "When you cast either spell with a spell slot, that slot isn't expended if the spell fails to stop a spell."
          ]
        },
        {
          "name": "Spell Resistance",
          "level": 14,
          "entries": [
            "You have Advantage on saving throws against spells, and you have Resistance to the damage of spells."
          ]
        }
      ]
    },
    "diviner": {
      "name": "Diviner",
      "source": "XPHB",
      "className": "Wizard",
      "description": "Learn the Secrets of the Multiverse\n\nThe counsel of a Diviner is sought by those who want a clearer understanding of the past, present, and future. As a Diviner, you strive to part the veils of space, time, and consciousness. You work to master spells of discernment, remote viewing, supernatural knowledge, and foresight.",
      "features": [
        {
          "name": "Divination Savant",
          "level": 3,
          "entries": [
            "Choose two Wizard spells from the Divination school, each of which must be no higher than level 2, and add them to your spellbook for free.",
            "In addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Divination school to your spellbook for free. The chosen spell must be of a level for which you have spell slots."
          ]
        },
        {
          "name": "Portent",
          "level": 3,
          "entries": [
            "Glimpses of the future begin to press on your awareness. Whenever you finish a Long Rest, roll two d20s and record the numbers rolled. You can replace any D20 Test made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn.",
            "Each foretelling roll can be used only once. When you finish a Long Rest, you lose any unused foretelling rolls."
          ]
        },
        {
          "name": "Expert Divination",
          "level": 6,
          "entries": [
            "Casting Divination spells comes so easily to you that it expends only a fraction of your spellcasting efforts. When you cast a Divination spell using a level 2+ spell slot, you regain one expended spell slot. The slot you regain must be of a level lower than the slot you expended and can't be higher than level 5."
          ]
        },
        {
          "name": "The Third Eye",
          "level": 10,
          "entries": [
            "You can increase your powers of perception. As a Bonus Action, choose one of the following benefits, which lasts until you start a Short Rest or Long Rest. You can't use this feature again until you finish a Short Rest or Long Rest."
          ]
        },
        {
          "name": "Greater Portent",
          "level": 14,
          "entries": [
            "The visions in your dreams intensify and paint a more accurate picture in your mind of what is to come. Roll three d20s for your Portent feature rather than two."
          ]
        }
      ]
    },
    "evoker": {
      "name": "Evoker",
      "source": "XPHB",
      "className": "Wizard",
      "description": "Create Explosive Elemental Effects\n\nYour studies focus on magic that creates powerful elemental effects such as bitter cold, searing flame, rolling thunder, crackling lightning, and burning acid. Some Evokers find employment in military forces, serving as artillery to blast armies from afar. Others use their power to protect others, while some seek their own gain.",
      "features": [
        {
          "name": "Evocation Savant",
          "level": 3,
          "entries": [
            "Choose two Wizard spells from the Evocation school, each of which must be no higher than level 2, and add them to your spellbook for free.",
            "In addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Evocation school to your spellbook for free. The chosen spell must be of a level for which you have spell slots."
          ]
        },
        {
          "name": "Potent Cantrip",
          "level": 3,
          "entries": [
            "Your damaging cantrips affect even creatures that avoid the brunt of the effect. When you cast a cantrip at a creature and you miss with the attack roll or the target succeeds on a saving throw against the cantrip, the target takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip."
          ]
        },
        {
          "name": "Sculpt Spells",
          "level": 6,
          "entries": [
            "You can create pockets of relative safety within the effects of your evocations. When you cast an Evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 plus the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save."
          ]
        },
        {
          "name": "Empowered Evocation",
          "level": 10,
          "entries": [
            "Whenever you cast a Wizard spell from the Evocation school, you can add your Intelligence modifier to one damage roll of that spell."
          ]
        },
        {
          "name": "Overchannel",
          "level": 14,
          "entries": [
            "You can increase the power of your spells. When you cast a Wizard spell with a spell slot of levels 1–5 that deals damage, you can deal maximum damage with that spell on the turn you cast it.",
            "The first time you do so, you suffer no adverse effect. If you use this feature again before you finish a Long Rest, you take 2d12 Necrotic damage for each level of the spell slot immediately after you cast it. This damage ignores Resistance and Immunity.",
            "Each time you use this feature again before finishing a Long Rest, the Necrotic damage per spell level increases by 1d12."
          ]
        }
      ]
    },
    "illusionist": {
      "name": "Illusionist",
      "source": "XPHB",
      "className": "Wizard",
      "description": "Weave Subtle Spells of Deception\n\nYou specialize in magic that dazzles the senses and tricks the mind, and the illusions you craft make the impossible seem real.",
      "features": [
        {
          "name": "Illusion Savant",
          "level": 3,
          "entries": [
            "Choose two Wizard spells from the Illusion school, each of which must be no higher than level 2, and add them to your spellbook for free.",
            "In addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Illusion school to your spellbook for free. The chosen spell must be of a level for which you have spell slots."
          ]
        },
        {
          "name": "Improved Illusions",
          "level": 3,
          "entries": [
            "You can cast Illusion spells without providing Verbal components, and if an Illusion spell you cast has a range of 10+ feet, the range increases by 60 feet.",
            "You also know the Minor Illusion cantrip. If you already know it, you learn a different Wizard cantrip of your choice. The cantrip doesn't count against your number of cantrips known. You can create both a sound and an image with a single casting of Minor Illusion, and you can cast it as a Bonus Action."
          ]
        },
        {
          "name": "Phantasmal Creatures",
          "level": 6,
          "entries": [
            "You always have the Summon Beast and Summon Fey spells prepared. Whenever you cast either spell, you can change its school to Illusion, which causes the summoned creature to appear spectral. You can cast the Illusion version of each spell without expending a spell slot, but casting it without a slot halves the creature's Hit Points. Once you cast either spell without a spell slot, you must finish a Long Rest before you can cast the spell in that way again."
          ]
        },
        {
          "name": "Illusory Self",
          "level": 10,
          "entries": [
            "When a creature hits you with an attack roll, you can take a Reaction to interpose an illusory duplicate of yourself between the attacker and yourself. The attack automatically misses you, then the illusion dissipates.",
            "Once you use this feature, you can't use it again until you finish a Short Rest or Long Rest. You can also restore your use of it by expending a level 2+ spell slot (no action required)."
          ]
        },
        {
          "name": "Illusory Reality",
          "level": 14,
          "entries": [
            "You have learned to weave shadow magic into your illusions to give them a semi-reality. When you cast an Illusion spell with a spell slot, you can choose one inanimate, nonmagical object that is part of the illusion and make that object real. You can do this on your turn as a Bonus Action while the spell is ongoing. The object remains real for 1 minute, during which it can't deal damage or give any conditions. For example, you can create an illusion of a bridge over a chasm and then make it real and cross it."
          ]
        }
      ]
    }
  }
}
